[
  {
    "company": "Morgan McKinley",
    "jobTitle": "Junior Software Engineer",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQH9wQ2f1bXjfw/company-logo_100_100/0/1662716523800?e=1671062400&v=beta&t=8NtkBgJfB68KvPohU7vPVKK5Fku6HbhoVEujYpm02j4",
    "location": "Greater Sydney Area",
    "jobDesc": "\n                <ul><li>Junior Contract role looking to convert to Permanent </li><li>A degree in computer science and/or experience in Python is required </li><li>Salary ranges up to $100k + super</li></ul><p><br>\n</p><strong><u>About The Company</u></strong><p><br>\n</p>Our technology team have extensive insurance market experience and understand what it means to run an underwriting and technology centred operation. Our technology is at the forefront of what we do, offering an advanced module-based platform allowing our clients to tailor packages to suit their needs.<p><br>\n</p><strong><u>About The Role</u></strong><p><br>\n</p>Join a fast moving, high achieving team of technology experts to create end-to-end solutions for our customers.<p><br>\n</p><strong><u>Responsibilities</u></strong><p><br>\n</p><ul><li>Work on the BE and Integration for our widely used applications</li><li>Unit testing</li><li>Build and solve problems as a developer is also looking to learn along the journey</li></ul><p><br>\n</p><strong><u>About You</u></strong><p><br>\n</p><ul><li>Have experience in building applications</li><li>Understand the SDLC</li><li>Be self-driven and self-motivated</li><li>Know how to be proactive in your learning and work</li></ul><p><br>\n</p><strong>Apply Now</strong>\n<!---->        ",
    "link": "https://www.morganmckinley.com/au/job/new-south-wales/junior-software-engineer/1060108",
    "posted": 1662899404000,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3271370505"
  },
  {
    "company": "AGS - American Gaming Systems",
    "jobTitle": "Graduate Software Engineer",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQFRANqgkYmkNA/company-logo_100_100/0/1643160427775?e=1671062400&v=beta&t=Z9zhDfInMctx2Qlq9p1BLAP7mueFQ9D1pP4bB74atOs",
    "location": "North Ryde, New South Wales, Australia",
    "jobDesc": "\n                <p><strong>Overview</strong></p><p>AGS is a fun, exciting, and growing company focused on making amazing slot machine games. What is a slot machine game you ask? Well it’s like an Xbox video game except people can win real money.</p><p>We are looking for a self-motivated person who enjoys the complexities and trade-offs of working in a multidiscipline creative environment. If you love making games, and making them with other amazing people then we want to meet you. </p><p><br>\n</p><p> <strong>What you will be doing.</strong></p><ul><li>Making games with a diverse team of Game Designers, Artists, Sound Designers and Engineers.</li><li>Writing code in C# and creating slot games using Unity.</li><li>Solving complex problems, isn’t that why you became an engineer?</li><li>Developing process improvements and tools to make life easier for everyone and yourself.</li><li>Identifying and debugging complex issues,</li><li>Working with Game Designers and Artists to implement the team’s vision of the game.</li><li>Helping SQA identify and fix bugs.</li></ul><p> </p><p><strong>Your strengths.</strong></p><ul><li>Bachelor’s degree in computer science, engineering or related field.</li><li>Experience making games in Unity.</li><li>Experience designing, coding, testing and debugging software.</li><li>A passion to help your team members and to work with them for the greater good.</li><li>Experience with OOP languages.</li><li>Be self-motivated and proactive to get stuff done.</li><li>Understand that change, iteration and failure are required to create and design great things.</li></ul><p> </p><p><strong>Also would be great if you could…</strong></p><ul><li>Have experience with Linux or UNIX.</li><li>Know what we are talking about when we say the words, sprint, retro, backlog and velocity. </li></ul><p> </p><p>Please note that this position requires your presence in our office in North Ryde, NSW Australia as the work cannot be done remotely.</p><p> </p><p> Candidates must be Australians Citizens or a Permanent Residents. Other visa types will not be accepted. Only shortlisted candidates will be contacted.</p><p> </p><p> To get a sense of our organizational culture and day to day events please visit and 'Like' our Facebook Community and Careers page at https://www.facebook.com/AmericanGamingSystems or follow us on Instagram @ PLAY_AGS.</p><p></p>\n<!---->        ",
    "link": "https://www.linkedin.com/jobs/view/3222752845/?refId=e4175e3c-f746-4055-ad09-16014194abc6&trackingId=GGJ5lEggS1abxFuMkyBiiA%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1662899404000
  },
  {
    "company": "ResMed",
    "jobTitle": "Graduate Software Engineer - Test Automation",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQFDnYiOHN6AbA/company-logo_100_100/0/1519902203575?e=1671062400&v=beta&t=j3CWaQOVcnAQoVWkujV-2Vx8UUacpKCFuunlHCmyBbw",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                <p>Digital Health Technology team powers digital experiences and engagement to enhance the lives of millions of people every day through connected care. We build, deliver and manage a portfolio of data management platforms and mobile offerings in support of our core businesses. We thrive on simple and elegant architecture and agility. You’ll be immersed in a dynamic high-growth environment and empowered to excel, take informed risks, and drive ingenuity across the enterprise.</p><p><br>\n</p><p>We are looking for a Software Engineer to be part of the Test Engineering team.</p><p>If you like to think outside the box and possess the mental agility to make a real impact with your skills and knowledge - this is the right role for you. You will be able to learn and grow professionally, collaborate with a highly skilled team of software engineers and automation testers as well as work with the latest tech, writing code and training machines to automate your tasks.</p><p>Join the team where cloud tech, testing, software and data engineering come together to help millions of people sleep better, breathe better and live healthier lives.</p><p><br>\n</p><p><strong>Let's talk about Responsibilities: </strong></p><p>This role is responsible for software development, design and testing in support of the testing activities within Digital Health Technology Group at ResMed (across web, mobile and cloud applications). It also encompasses working with global Product Development teams in Sydney, San Diego and Halifax. These applications are designed for clinicians involved in the care and management of patients with obstructive sleep apnoea and respiratory disorders.</p><p><br>\n</p><ul><li>Apply Java and Python software development skills/techniques and AWS knowledge to the design and development of test automation solutions.</li><li>Enhance tools/applications for the current test automation framework by applying innovative state-of-the-art software development frameworks and data science solutions.</li><li>Propose, define and implement processes and solutions for improved software development and testing.</li><li>Perform post deployment production testing</li><li>Resolve complex problems with efficient designs and implementations.</li><li>Perform design reviews and test code inspections leading to application optimization.</li><li>Collaborate within teams, across business and initiate functional and technical discussions.</li><li>Maintain technical skills and awareness of current state-of-the-art technical advancements.</li></ul><p><br>\n</p><p><strong>Let’s talk Qualifications and Experience: </strong></p><ul><li>Computer Science, Engineering or Science degree or equivalent experience.</li><li>Good understanding of cloud networking concepts.</li><li>Work with automation tools such as Terraform including building cloud-based CI/CD/CT DevOps pipelines.</li><li>Container Tooling – Docker.</li><li>Bonus: relational &amp; non-relational databases (MongoDB, DynamoDB and SQL Server).</li></ul><p><br>\n</p><p>Joining us is more than saying “yes” to making the world a healthier place. It’s discovering a career that’s challenging, supportive and inspiring. Where a culture driven by excellence helps you not only meet your goals, but also create new ones. We focus on creating a diverse and inclusive culture, encouraging individual expression in the workplace and thrive on the innovative ideas this generates. If this sounds like the workplace for you, apply now!</p>\n<!---->        ",
    "link": "https://resmed.wd3.myworkdayjobs.com/ResMed_External_Careers/job/Sydney-NSW-Australia/Senior-Performance-Engineer--Test-Engineering-Team-_JR_014352",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3231271651/?refId=e4175e3c-f746-4055-ad09-16014194abc6&trackingId=lcPZOqliRvSWctNNJnBLYA%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1662899404000
  },
  {
    "company": "Amazon",
    "jobTitle": "2022/23 Software Development Graduate",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQHTvZwCx4p2Qg/company-logo_100_100/0/1612205615891?e=1671062400&v=beta&t=HJpyXv7kFu8Pvir6aMYvNsmf2k5Y1r7WL-qQREs94sk",
    "location": "Brisbane, Queensland, Australia",
    "jobDesc": "\n                <strong><u>Job Summary<br>\n<br>\n</u></strong><strong>DESCRIPTION<br>\n<br>\n</strong>Amazon is looking for passionate Graduate Software Development Engineers (SDEs) to join our team. You will build software for Amazon’s rapid fulfillment businesses for use across the globe.<br>\n<br>\nAmazon offers a unique, inclusive work environment where you’ll be able to work on the A to Z of problems, at scale, for real customers. You’ll join a team solving challenging problems with innovative software solutions, building global software at scale every day and having a ton of fun while you do it.<br>\n<br>\nKey job responsibilities<br>\n<br>\nWe are a group of engineers that values diversity and collaboration to help each other succeed as a team. Bring your experiences, perspectives and skills to help build a great shopping experience for customers all around the world. We're looking for developers with a passion for solving challenging problems, learning on the go and working with teammates to have a global impact.<br>\n<br>\nYou will own the development of software end to end, from working with stakeholders on requirements through to owning the ongoing operations of the software that you build at scale. You will work with a great, global team to tackle new challenges. You will have the opportunity to experiment and learn from your successes and your failures.<br>\n<br>\n**Amazon does not sponsor work visas for this role so you must have the full working rights in Australia so either Australian/NZ citizenship or Australian PR **<br>\n<br>\nKey Responsibilities include:-<br>\n<ul><li>Ability to code right solutions starting with broadly defined problems,</li><li>Understand basic Algorithm fundamentals</li><li>Development of code in object oriented languages like C++ and java and build large scale robust distributed systems<br>\n</li></ul><strong><u>Candidates For This Role Must Have<br>\n<br>\n</u></strong><strong>BASIC QUALIFICATIONS<br>\n</strong><ul><li> You must be in the final year of a university undergraduate or postgraduate degree or have completed your university studies within the past 24 months of applying.</li><li> Enrolled/Completed a degree in Computer Science, Computer Engineering, Information Technology at university or relevant tertiary institution</li><li> You must have Australian/New Zealand citizenship or Australian permanent residency at the time you submit your application.<br>\n</li></ul><strong><u>Preferred Qualifications<br>\n</u></strong><ul><li>Ability to code right solutions starting with broadly defined problems</li><li>Development of code in object oriented languages like C++ and java and build large scale robust distributed systems</li><li>Proven educational track record with sound data structure and algorithm knowledge</li><li>Experience developing in a Linux environment</li><li>Experience developing software on Amazon Web Services (AWS) platforms</li><li>Knowledge of Perl or other scripting languages a plus</li><li>Experience with distributed (multi-tiered) systems, algorithms, and relational databases</li><li>Experience in optimization mathematics (linear programming, nonlinear optimization)</li><li>Ability to effectively articulate technical challenges and solutions</li><li>Deal well with ambiguous/undefined problems; ability to think abstractly<br>\n</li></ul>Note: Applications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. Please note that we are reviewing a high volume of applications and appreciate your patience.<br>\n<br>\n<strong><u>Acknowledgement Of Country<br>\n<br>\n</u></strong>In the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.<br>\n<br>\n<br>\n<strong>Company</strong> - Amazon Support Services PtyLtd<br>\n<br>\nJob ID: A1969563\n<!---->        ",
    "link": "https://www.amazon.jobs/en/jobs/1969563/2022-23-software-development-graduate?cmpid=SPLICX0248M&ss=paid&utm_campaign=cxro&utm_content=job_posting&utm_medium=social_media&utm_source=linkedin.com",
    "posted": 1662382273000,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3203155381/?alternateChannel=search&refId=WF16C4pLVkiN9yr2vrlOiQ%3D%3D&trackingId=TPAFb75Bmc2%2Fu34LoqhfGQ%3D%3D"
  },
  {
    "company": "Amazon Web Services (AWS)",
    "jobTitle": "Graduate Network Development Engineer",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQE_4UwvNNtNTQ/company-logo_100_100/0/1640205885683?e=1671062400&v=beta&t=bdiTf0XE6T730HSslMVDTnuaszWjif4MJvBZQ03aylI",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                <strong><u>Description<br>\n</u></strong><ul><li>Winter 2022 or January/ February 2023 start dates available</li><li>This opportunity is open to Australian and NZ citizens, and Australian permanent residents.<br>\n</li></ul>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br>\n<br>\nWhen you join Amazon Web Services as a student or recent graduate, you’ll have the chance for your voice to be heard and amplified. That’s because our teams are looking to learn as much from you as you’ll learn from them. Our Australian team is looking for Graduate Network Development Engineers to join, learn, and grow with our Sydney engineering team! We have two start dates in July 2022 and early 2023.<br>\n<br>\nOur Network Development Engineer Graduate program will place you in a number of different roles across our Network Reliability Engineering, Network Scaling and Deployment and Capacity Engineering teams. Here, you will also interact with a variety of internal customer, product and software development teams to expand your knowledge and hands-on skills in the latest network technologies, practices and operating environments, preparing you for your ongoing career in AWS networking. You will work with a mentor throughout the program and have real impact on the future of our platform whilst honing your networking and software development skills in a true production environment.<br>\n<br>\nWhy AWS?<br>\n<br>\nInclusive Team Culture<br>\n<br>\nHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.<br>\n<br>\nWork/Life Balance<br>\n<br>\nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.<br>\n<br>\nMentorship &amp; Career Growth<br>\n<br>\nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.<br>\n<br>\nHybrid Work<br>\n<br>\nWe value innovation and recognize this sometimes requires uninterrupted time to focus on a build. We also value in-person collaboration and time spent face-to-face. Our team affords engineers options to work in the office every day or in a flexible, hybrid work model near one of our offices. Our hybrid models allow you the freedom to work from home whenever in-office collaboration isn’t necessary.<br>\n<br>\n<br>\n<strong><u>Basic Qualifications<br>\n</u></strong><ul><li>Graduating winter 2022 or November/ December 2022 or a recent graduate (2021) from a Bachelor’s or Master’s degree in Information Technology, Computer Science, Engineering or a related field, preferably with a Networking major</li><li>Basic knowledge of networking fundamentals (TCP/IP, BGP, OSFP, ISIS, MPLS)</li><li>Experience with, or willing to learn, writing small automation script in any language (Ruby, Python, Perl, , C++)</li><li>Familiar with basic concepts of class, object, expressions, flow controls, exception handling and simple CUI based application<br>\n</li></ul><strong><u>Preferred Qualifications<br>\n</u></strong><ul><li>CCNA or equivalent level networking certification</li><li>Network troubleshooting or support experience<br>\n</li></ul>For more information about our team, visit https://aws.amazon.com/careers/network-careers-syd/<br>\n<br>\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br>\n<br>\n<br>\n<strong>Company</strong> - Amazon Corporate Services Pty<br>\n<br>\nJob ID: A1713349\n<!---->        ",
    "link": "https://www.amazon.jobs/en/jobs/1713349/graduate-network-development-engineer?cmpid=SPLICX0248M&utm_source=linkedin.com&utm_campaign=cxro&utm_medium=social_media&utm_content=job_posting&ss=paid",
    "posted": 1662382273000,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3030814717/?alternateChannel=search&refId=wRGO9u%2FYt28Lun5hV1vJUQ%3D%3D&trackingId=ZuGvuc9QRPuQZaPQjWHalg%3D%3D"
  },
  {
    "company": "Amazon Web Services (AWS)",
    "jobTitle": "Graduate Optical Network Engineer",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQE_4UwvNNtNTQ/company-logo_100_100/0/1640205885683?e=1671062400&v=beta&t=bdiTf0XE6T730HSslMVDTnuaszWjif4MJvBZQ03aylI",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                <strong><u>Job Summary<br>\n<br>\n</u></strong><strong>DESCRIPTION<br>\n</strong><ul><li>Winter 2022 or January- March 2023 start dates available</li><li>This opportunity is open to Australian and NZ citizens, and Australian permanent residents.<br>\n</li></ul>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br>\n<br>\nWhen you join Amazon Web Services as a student or recent graduate, you’ll have the chance for your voice to be heard and amplified. That’s because our teams are looking to learn as much from you as you’ll learn from them. Our Australian team is looking for Graduate Network Development Engineers to join, learn, and grow with our Sydney engineering team! We have two start dates in July 2022 and early 2023.<br>\n<br>\nOur Network Development Engineer Graduate program will place you in a number of different roles across our Network Reliability Engineering, Network Scaling and Deployment and Capacity Engineering teams. Here, you will also interact with a variety of internal customer, product and software development teams to expand your knowledge and hands-on skills in the latest network technologies, practices and operating environments, preparing you for your ongoing career in AWS networking. You will work with a mentor throughout the program and have real impact on the future of our platform whilst honing your networking and software development skills in a true production environment.<br>\n<br>\nWhy AWS?<br>\n<br>\nInclusive Team Culture<br>\n<br>\nHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.<br>\n<br>\nWork/Life Balance<br>\n<br>\nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.<br>\n<br>\nMentorship &amp; Career Growth<br>\n<br>\nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.<br>\n<br>\nHybrid Work<br>\n<br>\nWe value innovation and recognize this sometimes requires uninterrupted time to focus on a build. We also value in-person collaboration and time spent face-to-face. Our team affords engineers options to work in the office every day or in a flexible, hybrid work model near one of our offices. Our hybrid models allow you the freedom to work from home whenever in-office collaboration isn’t necessary.<br>\n<br>\nKey job responsibilities<br>\n<br>\n<br>\n<strong><u>Basic Qualifications<br>\n</u></strong><ul><li> Graduating winter 2022 or November/ December 2022 or a recent graduate (2021) from a Bachelor’s or Master’s degree in Information Technology, Computer Science, Engineering or a related field, preferably with a Networking major</li><li> Knowledge of optical transport network, WDM concept and component overview.</li><li> Understanding of Optical sources and power budgeting</li><li> Basic knowledge of networking fundamentals (TCP/IP, BGP, OSFP, ISIS, MPLS)</li><li> Experience with, or willing to learn, writing small automation script in any language (Ruby, Python, Perl, , C++)</li><li> Willing to support oncall rotations, able to work weekends and public holidays.</li><li> Familiar with basic concepts of class, object, expressions, flow controls, exception handling and simple CUI based application<br>\n</li></ul><strong><u>Preferred Qualifications<br>\n</u></strong><ul><li> Knowledge of optical systems</li><li> CCNA or equivalent level networking certification</li><li> Network troubleshooting or support experience<br>\n</li></ul>For more information about our team, visit https://aws.amazon.com/careers/network-careers-syd/<br>\n<br>\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br>\n<br>\n<strong><u>Acknowledgement Of Country<br>\n<br>\n</u></strong>In the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.<br>\n<br>\n<strong><u>IDE Statement<br>\n<br>\n</u></strong>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected attributes.<br>\n<br>\n<br>\n<strong>Company</strong> - Amazon Corporate Services Pty<br>\n<br>\nJob ID: A2072161\n<!---->        ",
    "link": "https://www.amazon.jobs/en/jobs/2072161/graduate-optical-network-engineer?cmpid=SPLICX0248M&utm_source=linkedin.com&utm_campaign=cxro&utm_medium=social_media&utm_content=job_posting&ss=paid",
    "posted": 1662382273000,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3086745606/?alternateChannel=search&refId=n9Vkz70TvFZO%2FCzPh0aVwA%3D%3D&trackingId=0SbBoP%2BOmMXIKI25%2FPErtA%3D%3D"
  },
  {
    "company": "Scalapay",
    "jobTitle": "2 x Graduate Software Engineer",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFKgH0waIUoZQ/company-logo_100_100/0/1632473414187?e=1671062400&v=beta&t=mNV0Pqvciqsh7xciaCZ1cNBmk07NyPLhRBdlUPvUhTM",
    "location": "Wollongong, New South Wales, Australia",
    "jobDesc": "\n                Scalapay is transforming the way people buy online and in-store, empowering merchants to give their customers magical experiences. With over 4,000 retailers in fashion, beauty, homeware &amp; travel trusting us (Moschino, Decathlon, Calzedonia, Nike, Shein to name a few), we have more than 1M+ customers using Scalapay today across Europe.<br>\n<br>\nFollowing a 497M$ series B in February 2022 led by Tencent and Willoughby Capital, we are now a unicorn 🦄 With this in mind, our teams are growing fast: we’re looking for extraordinary talents to come join the adventure and help us shape and sell the future of ecommerce payments &amp; checkout products.<br>\n<br>\nWorking with us means a day-to-day where things go very fast, where you get the opportunity to lead exciting &amp; challenging projects, and be part of team driven by 4 values: #createmagic #staycurious #beimpactful #playasateam.<br>\n<br>\nScalapay Australia has recently received Great Place to Work Certification and we’re proud of being one of the top 10 startups to work for according to LinkedIn, and 2021’s Startup of the Year in Italy.<br>\n<br>\nThis is where your magic happens. If you love it, Scalapay it ♥<br>\n<br>\nTHE MISSION<br>\n<br>\nJustin, our Engineering Manager, is looking for 2 x Graduate Software Engineers to join our Wollongong based engineering team to support the market demand for our product offering across Europe.<br>\n<br>\n<strong>About The Role<br>\n<br>\n</strong>A Graduate Software Engineering career at Scalapay will give you the foundation to become a Master of Your Craft learning best practice software design principals ensuring you develop into a standout software engineer.<br>\n<br>\nAs you progress within your role you will be given the autonomy to create innovative BNPL products, that are simplistic yet scalable to meet the needs of our customers and clients.<br>\n<br>\nOur team are collaborators working within an Agile environment where we encourage and empower you to take end-to-end ownership of your projects.<br>\n<br>\nYour contribution will be key to the success of the entire engineering team and organisation.<br>\n<br>\n<strong>Responsibilities<br>\n</strong><ul><li> Write clean, well-designed RESTful APIs that integrate e-commerce platforms and client applications with our core<br>\n<br>\n</li></ul>platform.<br>\n<ul><li> Help to innovate and solve interesting problems.</li><li> Contribute to the development of BNPL products.</li><li> Troubleshoot, test and automate to ensure high quality and optimisation.</li><li> Contribute to all phases of the development lifecycle.<br>\n<br>\n</li></ul><strong>Qualifications<br>\n</strong><ul><li> Bachelor's degree in Computer Science or related field.</li><li> Passion for best practice software design and coding practices.</li><li> Ideally a knowledge of React, Javascript, Node.js , relational databases, CI/CD tooling.<br>\n<br>\n</li></ul>What we offer<br>\n<ul><li> Opportunity to work with a team of Industry Leaders who are focused delivering products that offer exceptional user<br>\n<br>\n</li></ul>experience.<br>\n<ul><li> Support to accelerate your professional growth with an annual $3K training budget.</li><li> Work with the latest technologies in an AWS environment ranked in the top 3% of startups globally.</li><li> Encouragement to bring your own flair to the role.</li><li> Attractive Salary package, Employee Share Options, onsite parking and monthly massage.<br>\n<br>\n</li></ul>What we are looking for<br>\n<ul><li> Passion for software development.</li><li> Collaborative team player</li><li> Great attitude with a bias for action.<br>\n<br>\n</li></ul>This role is open to Australian Graduate, Visa Holders and Permanent Residents.<br>\n<br>\n<strong>Scalapay is an Equal Opportunity Employer for any minority, disability, gender identity or sexual orientation.</strong>\n<!---->        ",
    "link": "https://jobs.lever.co/Scalapay/2f7757f1-0514-4676-8f10-e29a4c32f34e?lever-source=LinkedInJobs",
    "posted": 1662382273000,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3273761816/?alternateChannel=search&refId=c1SLrJ20H0Lgq9MIUSxZ5w%3D%3D&trackingId=velexvODS8ZZfvtkxVLwdQ%3D%3D"
  },
  {
    "company": "Optiver",
    "jobTitle": "Graduate FPGA Developer - 2022 or 2023 - Expressions of Interest",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4E0BAQE5InV7BZ_Wjg/company-logo_100_100/0/1659345131555?e=1671062400&v=beta&t=uN6YlZjCBHiAVZ0AqwPsBPMDV_1CIwbmNctmk4J0tYI",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                <i><strong>Please note, our formal applications for Graduate and Intern opportunities are currently closed but we’re seeking expressions of interest and would love to hear from you!<br>\n<br>\n</strong></i><i><strong>Please complete this application to join our FPGA Developer ‘Talent Community’ and ensure that you identify your year of graduation, so that we can keep you up to date with suitable upcoming vacancies.<br>\n<br>\n</strong></i><i>Start dates available for mid-2022 and Feb 2023<br>\n<br>\n</i>Deeply passionate about technology, particularly FPGA hardware? Want to make a tangible impact on the world right from the start? Work alongside our Traders and Software Developers to leverage the latest technologies, techniques, and hardware available to ensure we have the fastest and most reliable trading systems that are crucial to Optiver’s success.<br>\n<br>\nJoin Optiver and accelerate your growth in a truly fascinating, high-performance environment.<br>\n<br>\n<strong>WHO WE ARE:<br>\n<br>\n</strong>Optiver is a tech-driven trading firm and leading global market maker. For over 35 years, Optiver has been improving financial markets around the world, making them more transparent and efficient for all participants. With a focus on cutting-edge engineering, data science and research, we actively trade on 50+ exchanges, where we’re trusted to always provide accurate buy and sell pricing – no matter the market conditions.<br>\n<br>\nOptiver’s Sydney office is one of the primary players within Asian markets, trading a range of products. As an active participant on the Hong Kong, Korea, Singapore, Taiwan, and Japan exchanges, we act as Optiver’s APAC head office.<br>\n<br>\n<strong>WHAT YOU’LL DO:<br>\n<br>\n</strong>In our world, FPGAs play a critical role in executing successful trades. With no external clients, we operate in a fast feedback, quick release environment. We’ll also give the autonomy and responsibility to apply your fresh ideas.<br>\n<br>\nAs a Graduate FPGA Developer, you’ll work in a close-knit team to design and develop highly accurate and efficient devices that solve real business problems. Your goal is to find the simplest solutions to the most complex problems. You’ll also:<br>\n<br>\n<ul><li>Accelerate network infrastructure and trading systems using latest devices, tools and techniques</li><li>Develop rigorous test benches using a combination of VHDL and System Verilog</li><li>Explore new mechanisms for faster data communication/processing to accelerate network infrastructure and trading systems</li><li>Work with the fastest devices/platforms in the industry<br>\n<br>\n</li></ul>By the end of the program, you’ll have learnt everything you need to know about technology at Optiver. Our dedicated Head of IT Education will work with you on your development. You’ll also enjoy:<br>\n<br>\n<ul><li>Workshops on a variety of technology-based topics, along with soft skills to support your holistic growth as a Developer</li><li>A dedicated FPGA Development mentor who will show you the ins-and-outs of our development process and how our trading systems work</li><li>Trader training to get you up to speed on our business. This helps you understand the ins-an-outs of trading, allowing you to make a real impact from the early stages of your Optiver career<br>\n<br>\n</li></ul>Check out Vicky’s ‘Day in the Life’ feature to learn more.<br>\n<br>\n<strong>WHO YOU ARE:<br>\n<br>\n</strong>You’re a problem solver at heart, who won’t stop until you’ve found a solution. And then push yourself even further to improve it. You’re deeply passionate about technology, particularly FPGA hardware, and have a range of out-of-classroom projects or activities to prove it. In addition, you’re:<br>\n<br>\n<ul><li>Knowledgeable about HDL languages: VHDL and/or Verilog as well as some experience with Python and/or C++</li><li>Understand network protocols: Ethernet, IP, TCP/UDP</li><li>Familiar with FPGA logic elements, transceivers, memory and other on-chip resources</li><li>Have some experience developing algorithms in software</li><li>Keen to create high-performance, low-latency designs that critically impact trading success</li><li>Keen to work alongside the best Developers and Traders in the industry, with the humility to continually upskill and improve yourself<br>\n<br>\n</li></ul><strong>WHAT YOU’LL GET:<br>\n<br>\n</strong><ul><li>AUD $250,000 first year salary package (2023 start)</li><li>The chance to work alongside diverse and intelligent peers in a rewarding environment</li><li>Training, mentorship and personal development opportunities</li><li>Gym membership plus weekly in-house chair massages</li><li>Daily breakfast, lunch and an in-house barista</li><li>Regular social events including an annual company trip</li><li>Work-from-home allowance and support</li><li>Guided relocation and a competitive relocation package where necessary<br>\n<br>\n</li></ul>As an intentionally flat organisation, we believe that great ideas and impact can come from everyone. We are passionate about empowering individuals and creating diverse teams that thrive. Every person at Optiver should feel included, valued and respected, because we believe our best work is done together.<br>\n<br>\nOur commitment to diversity and inclusion is hardwired through every stage of our hiring process. We encourage applications from candidates from any and all backgrounds, and we welcome requests for reasonable adjustments during the process to ensure that you can best demonstrate your abilities.<br>\n<br>\n<strong>ELIGIBILITY<br>\n<br>\n</strong><ul><li>A final year university student or recent graduate</li><li>Studying a Computer Science, Software/Electrical/Mechatronic Engineering or similarly technical degree</li><li>An Australian or New Zealand Citizen, Australian Permanent Resident or able to provide evidence of full working rights<br>\n<br>\n</li></ul><strong>Does this sound like the future you’re looking for? Take up the challenge and apply today!<br>\n<br>\n</strong>If you have any questions regarding this opportunity, please contact us at careers@optiver.com.au.\n<!---->        ",
    "link": "https://optiver.com/working-at-optiver/career-opportunities/5912209002/?source=Applicant_Source_LinkedIn&gh_src=9fb491cd2&gh_src=9fb491cd2",
    "posted": 1662382273000,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3204644314/?alternateChannel=search&refId=i1Kw8b%2BLDVC5jCbVM%2BuzCg%3D%3D&trackingId=7Rn3uGexb2WrFT5A8E2MZg%3D%3D"
  },
  {
    "company": "Airwallex",
    "jobTitle": "2022 Software Engineer Intern",
    "type": "intern",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQE0x1xIVWaQgw/company-logo_100_100/0/1562112345232?e=1671062400&v=beta&t=7gozn_mr1O6dWdSVQSHWrJ-BPDI1d_TfBmPrcLLEnuw",
    "location": "Melbourne, Victoria, Australia",
    "jobDesc": "\n                Airwallex is the leading financial technology platform for modern businesses growing beyond borders. With one of the world’s most powerful payments and banking infrastructure, our technology empowers businesses of all sizes to accept payments, move money globally, and simplify their financial operations, all in one single platform.<p><br>\n</p>Established in 2015 in Melbourne, our purpose is to connect entrepreneurs, business builders, makers and creators with opportunities in every corner of the world. Today, Airwallex has a global footprint across Asia-Pacific, Europe, and North America.<p><br>\n</p>You will be responsible for partnering with Airwallex’s engineering teams to drive a high performance, data driven culture. You’ll work on high priority areas, such as ensuring operational effectiveness and alignment across the Engineering organisation as Airwallex continues to scale across the globe. We have ambitious goals, cutting edge technology and multiple opportunities to come in and start delivering simple and effective engineering led solutions to our customers. Our tech stack (Kotalin, Kafka, Kubernetes and React) is built to be flexible, architecturally designed to be scalable and event driven at its core.<p><br>\n</p>As an intern you will be given a project that you will work from day one. You will also be given a structured training program and a mentor and manager to make sure you have the best experience and are supported to contribute. Our leaders welcome all Airwallex people to contribute to our IT road map and to constantly challenge the processes that we build our platforms through. You will get the opportunity to learn and apply best-practice software engineering, focused on strong software engineering fundamentals and pragmatism from all of our engineers. Most importantly we want you to have lots of fun and learn lots whilst you are working with us!<p><br>\n</p><strong><u>You Will Ideally Be Able To Demonstrate The Following</u></strong><p><br>\n</p><ul><li>You can think on your feet - with experience building platforms which resolve fast paced, ever changing success measures.</li><li>You are team player– you enjoy working in a collaborative, innovative and customer first driven environment.</li><li>You are naturally curious– always asking why to better understand our customer needs.</li><li>You are a passionate problem solver – You love digging deep and brainstorming with colleagues in order to come up with the best solution for a problem</li></ul><p><br>\n</p>This role will be a good match for you if you had the following:<p><br>\n</p><ul><li>Currently within 12 months of completing a Bachelor's or Master's degree, at any stage in your PhD (in your penultimate year) </li><li>Computing and Object-Oriented Programming (OOP) Fundamentals</li><li>Strong verbal and written communication skills</li><li>Desire to learn and grow with Airwallex as a technologist</li></ul><p><br>\n</p>At Airwallex we like to ensure we create the best environment for our people providing a collaborative open office space, PlayStation and table tennis to unwind, a fully stocked kitchen which includes breakfast, snacks, fruit, beers, you name it! We also organise regular team building events, encourage flexible/remote working and offer learning and development opportunities. Most importantly, we give our people the freedom to be creative.<p><br>\n</p>Our internship program will be a hybrid of remote working and in person in the Melbourne or Sydney office depending on where you are based in Australia.<p><br>\n</p><strong>Requirements: </strong>Please provide us with the latest PDF copies of your transcript and CV outlining when you finish your studies when applying<p><br>\n</p><i>Airwallex is proud to be an equal opportunity employer. We value diversity and anyone seeking employment at Airwallex is considered based on merit, qualifications, competence and talent. We don’t regard colour, religion, race, national origin, sexual orientation, ancestry, citizenship, sex, marital or family status, disability, gender, or any other legally protected status. If you have a disability or special need that requires accommodation, please let us know.</i>\n<!---->        ",
    "link": "https://jobs.lever.co/airwallex/df0ed4ce-0be8-4928-b313-a8a4517b163a?lever-source=LinkedInJobs",
    "posted": 1662382273000,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3178155107/?alternateChannel=search&refId=99%2FOtJvy1q5usPjaOvd0yQ%3D%3D&trackingId=LGzReIYNWd1Mr%2FVaB4jimw%3D%3D"
  },
  {
    "company": "Tesla",
    "jobTitle": "Product Engineering Intern",
    "type": "intern",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQHUcu98SZ2TVw/company-logo_100_100/0/1607665771371?e=1671062400&v=beta&t=B66eUFuulILXMNV5O_XnBlvtT16vbVYVQC5x5qtzDfQ",
    "location": "Melbourne, Victoria, Australia",
    "jobDesc": "\n                <strong><u>What To Expect<br>\n<br>\n</u></strong>The Tesla Energy Product Engineering team is responsible for diagnosing and resolving product issues and escalations from Field Service teams to drive the best customer experience and fleet availability. In this internship you will identify and help resolve fleet-wide performance, operation, and maintenance challenges across the growing fleet of energy products by creating analytics that provide insights to drive action to maintain and improve the fleet.<br>\n<br>\n<strong><u>What You’ll Do<br>\n</u></strong><ul><li>Troubleshoot and resolve hardware, software, and firmware issues that cause downtime for Tesla’s Industrial Storage customers. </li><li>Define the actions that need to be taken by the field service and technical support teams when a specific failure mode occurs, publish those actions in Tesla’s Service tools, and develop any specialized training required to complete those actions.</li><li>Provide support on escalated customer cases from around the world in order to minimize system downtime for Tesla’s customers. </li><li>Work with field service and technical support teams to create the documentation and training necessary to commission, operate, repair, and service Tesla’s Industrial Storage products installed globally.</li></ul> <strong>What You’ll Bring<br>\n</strong><ul><li>Currently working towards a degree in Electrical Engineering or relevant program </li><li>Strong engineering fundamentals and intuition, applied to firmware/software-enabled systems </li><li>Remain engaged, proactive, and positive while solving very challenging problems</li><li>This role is full time and for a 6 month contract<br>\n</li></ul><strong>Desired Competencies <br>\n</strong><ul><li>Experience with battery systems and power systems </li><li>Experience using Python or equivalent for data analysis on very large databases </li><li>Knowledge of CAN Bus communication </li><li>Experience with developing, managing or maintaining equipment running Linux based applications </li></ul>\n<!---->        ",
    "link": "https://www.tesla.com/careers/search/job/product-engineering-intern-141526?source=LinkedIn",
    "posted": 1662382273000,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3283996741/?alternateChannel=search&refId=nJio0pY4tbThN5VOuwkmIQ%3D%3D&trackingId=HUdKPU6Ke5TXTuMn5tPkeA%3D%3D"
  },
  {
    "company": "Jump Trading LLC",
    "jobTitle": "Campus | Software / Hardware Engineer (Intern / Industrial Placement)",
    "type": "intern",
    "logo": "https://media-exp1.licdn.com/dms/image/C4E0BAQEXnIY9IgMYDg/company-logo_100_100/0/1519888992804?e=1671062400&v=beta&t=9veTUrBAFc-Pbjsybj8lEPG1VwhKmT9MGMmRQn5z8S4",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                We’re looking for talented software and hardware engineering students to join our new Sydney office to help us build ultra-low-latency hardware and software systems that power trading on a global scale.<br>\n<br>\nIf you have interest in low-level or embedded software, operating systems, networking, and/or hardware, you’ll enjoy working with us.<br>\n<br>\nYou’ll join our small team of engineers in Sydney who work with FPGAs, tinker with the linux kernel, write high performance C++, and more to build some of the fastest electronic trades in the world (think time-scale of nanoseconds).<br>\n<br>\nPrior experience in trading is not expected, we’ll teach you everything you need to know.<br>\n<br>\nWe have opportunities for students interested in software engineering, hardware engineering, and the intersection of both!<br>\n<br>\n<strong><u>Skills You'll Need<br>\n</u></strong><ul><li>Undergraduate or Graduate concentration in Electrical Engineering, Computer Engineering, Computer Science, or related areas </li><li>Experience and interest in one or both of the following</li><ul><li>Low-level / embedded software development</li><li>FPGAs or other hardware/systems design</li></ul><li>Experience with C, C++, or Python</li><li>Experience with RTL development (SystemVerilog/Verilog/VHDL), if interested in working with hardware</li><li>Excellent marks in courses such as operating systems, distributed systems, digital circuits, networking, computer architecture</li><li>Passion for solving complex problems and ability to draw upon knowledge and experience from a variety of technical areas to produce extremely high-performance solutions<br>\n</li></ul><strong><u>Other Helpful And Related Experience<br>\n</u></strong><ul><li>lowRISC or RISC-V</li><li>CocoTB, Chisel, Opencore, or Bluespec</li><li>HLS or OpenCL </li><li>Any programming close to the metal with CPU, GPU, microprocessors, etc.</li><li>Linux kernel and driver programming</li><li>Robotics, Telecommunications, or High Speed Networking </li><li>Raspberry Pi or Arduino</li></ul>\n<!---->        ",
    "link": "https://www.jumptrading.com/careers/4072128/?gh_jid=4072128",
    "posted": 1662382273000,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3241459033/?alternateChannel=search&refId=KwEGGgYGeGHB8Qg81OA5Iw%3D%3D&trackingId=dYUvLiqEEOTWOnVFQkoNvQ%3D%3D"
  },
  {
    "company": "Nexus Silicon Technologies",
    "jobTitle": "Full Stack Developer Intern",
    "type": "intern",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQHuMu6ApjfyGg/company-logo_100_100/0/1641804394967?e=1671062400&v=beta&t=uIxejNHnDjxse_LU7NXdeQC7SvbQX4CNHs3sVaAp3iU",
    "location": "Canberra, Australian Capital Territory, Australia",
    "jobDesc": "\n                <strong>Job Title: Full Stack Developer Intern</strong><p><br>\n</p>Location: Canberra, ACT, Australia<p><br>\n</p>We are looking for a highly skilled full stack developer intern who is comfortable with both front and back end programming. Full stack developers are responsible for developing and designing front end web architecture, ensuring the responsiveness of applications, and working alongside graphic designers for web design features, among other duties.<p><br>\n</p><strong>Full Stack Developer Intern Responsibilities:</strong><p><br>\n</p><ul><li>Developing front end website architecture.</li><li>Designing user interactions on web pages.</li><li>Developing back-end website applications.</li><li>Creating servers and databases for functionality.</li><li>Ensuring cross-platform optimization for mobile phones.</li><li>Ensuring responsiveness of applications.</li><li>Working alongside graphic designers for web design features.</li><li>Seeing through a project from conception to finished product.</li><li>Designing and developing APIs.</li><li>Meeting both technical and consumer needs.</li><li>Staying abreast of developments in web applications and programming languages.</li></ul><p><br>\n</p><strong>Full Stack Developer Intern Requirements:</strong><p><br>\n</p><ul><li>Degree in computer science.</li><li>Strong organizational and project management skills.</li><li>Proficiency with fundamental front-end languages such as HTML, CSS, and JavaScript.</li><li>Familiarity with JavaScript frameworks such as Angular JS, React, and Amber.</li><li>Proficiency with server-side languages such as Python, Ruby, Java, PHP, and .Net.</li><li>Familiarity with database technology such as MySQL, Oracle, and MongoDB.</li><li>Excellent verbal communication skills.</li><li>Good problem-solving skills.</li><li>Attention to detail.</li></ul><p><br>\n</p><strong>About Us:</strong><p><br>\n</p>Nexus Silicon was formed with the goal of becoming the supplier of choice for clients, employees, and contingent workers. Today, we’re one of the fastest-growing companies in Australia and ranked as one of the best companies to work for by Staffing Industry Analysts and Australia Business. Nexus Silicon provides high-volume staffing, IT managed Services, IT Consulting, Software &amp; Mobile App development, Accounting Outsourcing, IT support, Cloud Infrastructure support &amp; Outsourcing, SOW, and pay rolling services to structured contingent workforce programs and projects across Australia, Nepal &amp; India. We also offer contract-to-hire and direct placement. Our “No-Sell, Service-Only” approach has resulted in “Accelerated Hires,” lower costs, reduced risks, and better service for Fortune 2000 Companies, Large System Integrators, and Government Agencies.<p><br>\n</p>Powered by JazzHR<p><br>\n</p>GvpHqa5rrS\n<!---->        ",
    "link": "https://www.linkedin.com/jobs/view/3233046218/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=hhW0bG05n%2B4iSuBr3Ap0eA%3D%3D&trackingId=%2BMIj7AhmcFkiC1ikAfqfTQ%3D%3D&trk=flagship3_search_srp_jobs",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3233046218/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=hhW0bG05n%2B4iSuBr3Ap0eA%3D%3D&trackingId=%2BMIj7AhmcFkiC1ikAfqfTQ%3D%3D&trk=flagship3_search_srp_jobs",
    "posted": 1662382273000
  },
  {
    "company": "Nexus Silicon Technologies",
    "jobTitle": "AI Engineer Intern",
    "type": "intern",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQHuMu6ApjfyGg/company-logo_100_100/0/1641804394967?e=1671062400&v=beta&t=uIxejNHnDjxse_LU7NXdeQC7SvbQX4CNHs3sVaAp3iU",
    "location": "Canberra, Australian Capital Territory, Australia",
    "jobDesc": "\n                <strong>Job Title: AI Engineer Intern<br>\n<br>\n</strong>Location: Canberra, ACT, Australia<br>\n<br>\nWe are looking for a highly capable AI Engineer Intern to optimize our AI systems. You will be evaluating existing (AI) processes, performing statistical analysis to resolve data set problems, and enhancing the accuracy of our AI software's predictive automation capabilities.<br>\n<br>\n<strong><u>AI Engineer Intern Responsibilities<br>\n</u></strong><ul><li>Consulting with managers to determine and refine artificial intelligence objectives.</li><li>Designing machine learning systems and self-running artificial intelligence (AI) software to automate predictive models.</li><li>Transforming data science prototypes and applying appropriate AI algorithms and tools.</li><li>Ensuring that algorithms generate accurate user recommendations.</li><li>Turning unstructured data into useful information by auto-tagging images and text-to-speech conversions.</li><li>Solving complex problems with multi-layered data sets, as well as optimizing existing machine learning libraries and frameworks.</li><li>Developing AI algorithms to analyze huge volumes of historical data to make predictions.</li><li>Running tests, performing statistical analysis, and interpreting test results.</li><li>Documenting machine learning processes.</li><li>Keeping abreast of developments in machine learning.<br>\n</li></ul><strong><u>AI Engineer Intern Requirements<br>\n</u></strong><ul><li>Bachelor's degree in computer science, data science, mathematics, or a related field.</li><li>Advanced proficiency with Python, Java, and R code writing.</li><li>Extensive knowledge of AI frameworks, libraries, data structures, data modeling, and software architecture.</li><li>In-depth knowledge of mathematics, statistics, and algorithms.</li><li>Superb analytical and problem-solving abilities.</li><li>Great communication and collaboration skills.</li><li>Excellent time management and organizational abilities.<br>\n</li></ul><strong><u>About Us<br>\n<br>\n</u></strong>Nexus Silicon was formed with the goal of becoming the supplier of choice for clients, employees, and contingent workers. Today, we’re one of the fastest-growing companies in Australia and ranked as one of the best companies to work for by Staffing Industry Analysts and Australia Business. Nexus Silicon provides high-volume staffing, IT managed Services, IT Consulting, Software &amp; Mobile App development, Accounting Outsourcing, IT support, Cloud Infrastructure support &amp; Outsourcing, SOW, and pay rolling services to structured contingent workforce programs and projects across Australia, Nepal &amp; India. We also offer contract-to-hire and direct placement. Our “No-Sell, Service-Only” approach has resulted in “Accelerated Hires,” lower costs, reduced risks, and better service for Fortune 2000 Companies, Large System Integrators, and Government Agencies.<br>\n<br>\nPowered by JazzHR\n<!---->        ",
    "link": "https://au.talent.com/view?id=78d4084563be&source=linkedin-premium&utm_medium=linkedin-premium",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3265514478/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=AovnkSIukob0AkoZql1oGg%3D%3D&trackingId=9yzGDSjOb8m6lrZeEuz0Zw%3D%3D&trk=flagship3_search_srp_jobs",
    "posted": 1662382273000
  },
  {
    "company": "Palantir Technologies",
    "jobTitle": "Forward Deployed Software Engineer, New Grad",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQGxa0XGCRty6A/company-logo_100_100/0/1644957302142?e=1671062400&v=beta&t=_WhwqV-Qpi3fBl3xOAZEfoI8v0bZr8oCmK14x_Q1Iqs",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                <strong><u>A World-Changing Company<br>\n<br>\n</u></strong>At Palantir, we’re passionate about building software that solves problems. We partner with the most important institutions in the world to transform how they use data and technology. Our software has been used to stop terrorist attacks, discover new medicines, gain an edge in global financial markets, and more. If these types of projects excite you, we'd love for you to join us.<br>\n<br>\n<strong>The Role<br>\n<br>\n</strong>Forward Deployed Software Engineers (FDSEs) work directly with customers to quickly understand their greatest problems and design and implement solutions to use data against them. Our customers rely on Palantir’s platforms for some of their most critical operations, and projects often start with an open ended question like “Why are we delaying so many flights?” or “How can we better identify instances of money laundering?” As an FDSE, you’ll apply your problem solving ability, creativity, and technical skills to help organizations use their data to drive a real impact in the world. You’ll have the opportunity to gain rare insight into and contribute to some of the world’s most important industries and institutions.<br>\n<br>\nAs an FDSE your responsibilities look similar to those of a startup CTO: you’ll work in small teams with minimal supervision and own end-to-end execution of high stakes projects. Your day might span discussing architecture with fellow engineers, wrangling massive-scale data, coding a custom web app, speaking with customer executives, or establishing strategy for your team.<br>\n<br>\n<strong>Our Principles<br>\n</strong><ul><li>Impact: We take on meaningful and challenging projects that change the world for the better.</li><li>Ownership: We see projects through from beginning to end, working through any obstacles we may encounter.</li><li>Collaboration: We work internally with people from a variety of backgrounds — such as other FDSEs, product teams, and Deployment Strategists. We also work externally with our customers, often on site, to understand and solve their problems.</li><li>Trust: We trust each other to effectively manage time and priorities and give people the space to think for themselves.</li><li>Growth: We encourage ourselves and our peers to seek new challenges and opportunities for growth, as well as find new ways to innovate and share knowledge</li><li>Learning: We often face entirely novel problems where we need to pick up a lot of new knowledge and learn how to use it to make progress. We believe experiential learning is one of the best teachers.<br>\n</li></ul><strong><u>What We Value<br>\n</u></strong><ul><li>Engineering background, preferred in fields such as Computer Science, Mathematics, Software Engineering, Physics, and Data Science.</li><li>A highly analytical mindset and eagerness to solve technical problems with data structures, storage systems, cloud infrastructure, front-end frameworks, and other technical tools.</li><li>Experience or interest in working with and using large scale data to solve valuable business problems.</li><li>Proficiency with one or more programming languages, such as Python, Java, C++, TypeScript/JavaScript, or similar.</li><li>Ability to collaborate effectively in teams of technical and non-technical individuals, and comfortable working in a rapidly changing environment with dynamic objectives and iteration with users.</li><li>Ability to continuously learn, work independently, and make decisions with minimal supervision.</li><li>Willingness and interest to travel as needed to client sites. Ability to travel 25-50% preferred, but requirements vary by team and location.<br>\n</li></ul><strong><u>To Apply, Please Include The Following<br>\n</u></strong><ul><li>An updated resume / CV</li><li>Thoughtful responses to our application questions<br>\n</li></ul><strong>Offer Deadline<br>\n<br>\n</strong>In an effort to build more transparency into our recruitment process, we’d like to share our offer deadline expectations. By applying to this position, you commit to confirming your decision within two weeks of receiving your written offer.<br>\n<br>\nPalantir is committed to promoting a culture of diversity, equity, and inclusion. We believe that all Palantirians share the responsibility of upholding our commitment to these values and encourage candidates from a wide range of backgrounds, perspectives, and lived experiences to join us in solving the world’s hardest problems.<br>\n<br>\nPalantir is committed to making the job application process accessible to everyone. If you are living with a disability (visible or not visible) and need to request a reasonable accommodation for any part of the application or hiring process, please reach out and let us know how we can help.\n<!---->        ",
    "link": "https://jobs.lever.co/palantir/6db3b287-f063-4b64-bb6e-e8b00ff12902?lever-source%255B%255D=Job%2520Board%3A%2520LinkedIn&lever-origin=applied",
    "posted": 1662382273000,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3251672724/?alternateChannel=search&refId=aGxjjiGMShMHmtqsYYM2%2Fg%3D%3D&trackingId=L4X%2BTPvT%2F1Lf9F%2Ft5SsN3Q%3D%3D"
  },
  {
    "company": "Palantir Technologies",
    "jobTitle": "Forward Deployed Software Engineer, New Grad",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQGxa0XGCRty6A/company-logo_100_100/0/1644957302142?e=1671062400&v=beta&t=_WhwqV-Qpi3fBl3xOAZEfoI8v0bZr8oCmK14x_Q1Iqs",
    "location": "Canberra, Australian Capital Territory, Australia",
    "jobDesc": "\n                <strong><u>A World-Changing Company<br>\n<br>\n</u></strong>At Palantir, we’re passionate about building software that solves problems. We partner with the most important institutions in the world to transform how they use data and technology. Our software has been used to stop terrorist attacks, discover new medicines, gain an edge in global financial markets, and more. If these types of projects excite you, we'd love for you to join us.<br>\n<br>\n<strong>The Role<br>\n<br>\n</strong>Forward Deployed Software Engineers (FDSEs) work directly with customers to quickly understand their greatest problems and design and implement solutions to use data against them. Our customers rely on Palantir’s platforms for some of their most critical operations, and projects often start with an open ended question like “Why are we delaying so many flights?” or “How can we better identify instances of money laundering?” As an FDSE, you’ll apply your problem solving ability, creativity, and technical skills to help organizations use their data to drive a real impact in the world. You’ll have the opportunity to gain rare insight into and contribute to some of the world’s most important industries and institutions.<br>\n<br>\nAs an FDSE your responsibilities look similar to those of a startup CTO: you’ll work in small teams with minimal supervision and own end-to-end execution of high stakes projects. Your day might span discussing architecture with fellow engineers, wrangling massive-scale data, coding a custom web app, speaking with customer executives, or establishing strategy for your team.<br>\n<br>\n<strong>Our Principles<br>\n</strong><ul><li>Impact: We take on meaningful and challenging projects that change the world for the better.</li><li>Ownership: We see projects through from beginning to end, working through any obstacles we may encounter.</li><li>Collaboration: We work internally with people from a variety of backgrounds — such as other FDSEs, product teams, and Deployment Strategists. We also work externally with our customers, often on site, to understand and solve their problems.</li><li>Trust: We trust each other to effectively manage time and priorities and give people the space to think for themselves.</li><li>Growth: We encourage ourselves and our peers to seek new challenges and opportunities for growth, as well as find new ways to innovate and share knowledge</li><li>Learning: We often face entirely novel problems where we need to pick up a lot of new knowledge and learn how to use it to make progress. We believe experiential learning is one of the best teachers.<br>\n</li></ul><strong><u>What We Value<br>\n</u></strong><ul><li>Engineering background, preferred in fields such as Computer Science, Mathematics, Software Engineering, Physics, and Data Science.</li><li>A highly analytical mindset and eagerness to solve technical problems with data structures, storage systems, cloud infrastructure, front-end frameworks, and other technical tools.</li><li>Experience or interest in working with and using large scale data to solve valuable business problems.</li><li>Proficiency with one or more programming languages, such as Python, Java, C++, TypeScript/JavaScript, or similar.</li><li>Ability to collaborate effectively in teams of technical and non-technical individuals, and comfortable working in a rapidly changing environment with dynamic objectives and iteration with users.</li><li>Ability to continuously learn, work independently, and make decisions with minimal supervision.<br>\n</li></ul><strong><u>Requirements<br>\n</u></strong><ul><li>Security clearance or the ability to obtain a clearance<br>\n</li></ul><strong><u>To Apply, Please Submit The Following<br>\n</u></strong><ul><li>An updated resume / CV.</li><li>Thoughtful responses to our application questions.<br>\n</li></ul><strong>Offer Deadline<br>\n<br>\n</strong>In an effort to build more transparency into our recruitment process, we’d like to share our offer deadline expectations. By applying to this position, you commit to confirming your decision within two weeks of receiving your written offer.<br>\n<br>\nPalantir is committed to promoting a culture of diversity, equity, and inclusion. We believe that all Palantirians share the responsibility of upholding our commitment to these values and encourage candidates from a wide range of backgrounds, perspectives, and lived experiences to join us in solving the world’s hardest problems.<br>\n<br>\nPalantir is committed to making the job application process accessible to everyone. If you are living with a disability (visible or not visible) and need to request a reasonable accommodation for any part of the application or hiring process, please reach out and let us know how we can help.\n<!---->        ",
    "link": "https://jobs.lever.co/palantir/4983faea-5fbe-4a1f-bd4b-c9aec78062de?lever-source%255B%255D=Job%2520Board%3A%2520LinkedIn&lever-origin=applied",
    "posted": 1662382273000,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3268430507/?alternateChannel=search&refId=aGxjjiGMShMHmtqsYYM2%2Fg%3D%3D&trackingId=SbKUzJWKLVHz7jIiQ3satA%3D%3D"
  },
  {
    "company": "ResMed",
    "jobTitle": "Graduate Software Engineer - Test Automation",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQFDnYiOHN6AbA/company-logo_100_100/0/1519902203575?e=1671062400&v=beta&t=j3CWaQOVcnAQoVWkujV-2Vx8UUacpKCFuunlHCmyBbw",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                <p>Digital Health Technology team powers digital experiences and engagement to enhance the lives of millions of people every day through connected care. We build, deliver and manage a portfolio of data management platforms and mobile offerings in support of our core businesses. We thrive on simple and elegant architecture and agility. You’ll be immersed in a dynamic high-growth environment and empowered to excel, take informed risks, and drive ingenuity across the enterprise.</p><p><br>\n</p><p>We are looking for a Software Engineer to be part of the Test Engineering team.</p><p>If you like to think outside the box and possess the mental agility to make a real impact with your skills and knowledge - this is the right role for you. You will be able to learn and grow professionally, collaborate with a highly skilled team of software engineers and automation testers as well as work with the latest tech, writing code and training machines to automate your tasks.</p><p>Join the team where cloud tech, testing, software and data engineering come together to help millions of people sleep better, breathe better and live healthier lives.</p><p><br>\n</p><p><strong>Let's talk about Responsibilities: </strong></p><p>This role is responsible for software development, design and testing in support of the testing activities within Digital Health Technology Group at ResMed (across web, mobile and cloud applications). It also encompasses working with global Product Development teams in Sydney, San Diego and Halifax. These applications are designed for clinicians involved in the care and management of patients with obstructive sleep apnoea and respiratory disorders.</p><p><br>\n</p><ul><li>Apply Java and Python software development skills/techniques and AWS knowledge to the design and development of test automation solutions.</li><li>Enhance tools/applications for the current test automation framework by applying innovative state-of-the-art software development frameworks and data science solutions.</li><li>Propose, define and implement processes and solutions for improved software development and testing.</li><li>Perform post deployment production testing</li><li>Resolve complex problems with efficient designs and implementations.</li><li>Perform design reviews and test code inspections leading to application optimization.</li><li>Collaborate within teams, across business and initiate functional and technical discussions.</li><li>Maintain technical skills and awareness of current state-of-the-art technical advancements.</li></ul><p><br>\n</p><p><strong>Let’s talk Qualifications and Experience: </strong></p><ul><li>Computer Science, Engineering or Science degree or equivalent experience.</li><li>Good understanding of cloud networking concepts.</li><li>Work with automation tools such as Terraform including building cloud-based CI/CD/CT DevOps pipelines.</li><li>Container Tooling – Docker.</li><li>Bonus: relational &amp; non-relational databases (MongoDB, DynamoDB and SQL Server).</li></ul><p><br>\n</p><p>Joining us is more than saying “yes” to making the world a healthier place. It’s discovering a career that’s challenging, supportive and inspiring. Where a culture driven by excellence helps you not only meet your goals, but also create new ones. We focus on creating a diverse and inclusive culture, encouraging individual expression in the workplace and thrive on the innovative ideas this generates. If this sounds like the workplace for you, apply now!</p>\n<!---->        ",
    "link": "https://resmed.wd3.myworkdayjobs.com/ResMed_External_Careers/job/Sydney-NSW-Australia/Senior-Performance-Engineer--Test-Engineering-Team-_JR_014352?source=LinkedIn",
    "posted": 1662382273000,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3231271651/?alternateChannel=search&refId=MpDiGEnYOCy47Rt9G2Qpfw%3D%3D&trackingId=vPGSpxC16M9DhGXkkLOL1g%3D%3D"
  },
  {
    "company": "ResMed",
    "jobTitle": "Graduate,Software (App) Engineering",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQFDnYiOHN6AbA/company-logo_100_100/0/1519902203575?e=1671062400&v=beta&t=j3CWaQOVcnAQoVWkujV-2Vx8UUacpKCFuunlHCmyBbw",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                Digital Health Technology team powers digital experiences and engagement to enhance the lives of millions of people every day through connected care. We build, deliver and manage a portfolio of data management platforms and mobile offerings in support of our core businesses. We thrive on simple and elegant architecture and agility. You’ll be immersed in a dynamic high-growth environment and empowered to excel, take informed risks, and drive ingenuity across the enterprise.<br>\n<br>\nDo you have a passion for building solutions that will spring ResMed’s Digital Healthcare products into the next decade? Are you keen to work for an organization that is focused on building a platform that is enabling and re-imagining the connected healthcare space? Do you have a wide variety of experience deploying services that are cloud native and meet high quality standards? We want you to work with a great team creating a device and patient therapy focused platform serving healthcare professionals across the globe.<br>\n<br>\nIn Sydney a stellar engineering team, within the Digital Health Technology Group of ResMed, is advancing digital solutions that manage, monitor and support patient’s health needs in over 140 different countries.<br>\n<br>\n<strong>About The Team:<br>\n<br>\n<br>\n</strong>We are a small cross-functional product team with a broad range of responsibilities and duties. We collaborate with product managers and other development teams globally across the Digital Health Technology group of ResMed. We’re passionate about solving problems across the entire software development lifecycle – whether that’s investigating new technologies, frameworks, and cloud services, developing new features, improving our CI/CD pipelines and test automation, or figuring out how to better automate our release process. We’re always up for a challenge and love learning new things!<br>\n<br>\n<strong>What We Are Looking For:<br>\n<br>\n<br>\n</strong>We’re looking for a <strong>Graduate Software Engineer</strong> who is proficient in front-end technologies including Angular. You will also be able to fluently explain your software architecture and why certain things were done in a particular way.<br>\n<br>\nYou love learning the intricate details of a certain language or framework and when something unknown comes your way, you have that passion and drive to dig deep and find it out. Some experience on the backend side of things is preferable using any object oriented language.<br>\n<br>\nYou’ll be comfortable working both autonomously and as part of a team and will be willing to lend your talents and experience to other team members when they need it.<br>\n<br>\nWe are not looking for a unicorn. If you do not have some of the skills mentioned below its fine as long as you show as you have that hunger to learn and adapt.<br>\n<br>\n<strong>Some of the tasks you’ll be performing include:<br>\n<br>\n</strong><ul><li>Get involved in our micro-frontend journey as we get ready to break up an age old monolith</li><li>Expanding on the existing frameworks and services to implement new features and innovate on our software products</li><li>Designing and architecting new microservices and micro-frontends.</li><li>Working with others to design, implement and support our AWS infrastructure and services</li><li>Production support (occasionally)<br>\n<br>\n</li></ul><strong>Required Skills and Experience:<br>\n<br>\n</strong><ul><li>1+ year of software engineering experience mostly working with front-end technologies</li><li>Experience with Angular. You hopefully eat Angular for breakfast, Typescript for lunch ending with a nice dinner with HTML and CSS</li><li>Experience with microservice and micro-frontend architectures</li><li>Solid ability in writing clean maintainable code</li><li>CI/CD pipeline tools and infrastructure (preferably experience in Jenkins, Terraform, AWS CodeBuild and AWS CodePipeline)</li><li>Strong problem solving and analytical skills</li><li>Experience writing automated tests</li><li>Experience with a cloud platform, preferably AWS</li><li>Bachelor’s degree in computer science or equivalent</li><li>Excellent oral and written communication skills<br>\n<br>\n</li></ul><strong>Desirable Skills and Experience</strong>:<br>\n<ul><li>Languages: Java (currently our primary language for the backend), Python(mostly used for automation)</li><li>Some experience with the Spring framework or willingness to learn if required</li><li>AWS certifications are a bonus</li><li>Interest in digital health and medical devices<br>\n<br>\n</li></ul><strong>Why Join Us:<br>\n<br>\n</strong><ul><li>You’ll have the full support of the team as you get up to speed and learn our system</li><li>As you gain experience, you’ll have the opportunity to take and set the direction of the systems you work on</li><li>We believe in continual learning and development. We have access to several online learning platforms</li><li>We support each other’s personal development goals and as a team look for opportunities for everyone to gain experience in their areas of interest</li><li>We understand everyone has a way of working that is most efficient for them, as such we have adopted a flexible working model and most of the team primarily work from home.</li><li>We have a fantastic campus in Bella Vista with subsidised lunches and coffee, free on-site parking, and free 24/7 access to our on-site gym and pool<br>\n<br>\n</li></ul>Joining us is more than saying “yes” to making the world a healthier place. It’s discovering a career that’s challenging, supportive and inspiring. Where a culture driven by excellence helps you not only meet your goals, but also create new ones. We focus on creating a diverse and inclusive culture, encouraging individual expression in the workplace and thrive on the innovative ideas this generates. If this sounds like the workplace for you, apply now!<br>\n<br>\n\n<!---->        ",
    "link": "https://resmed.wd3.myworkdayjobs.com/ResMed_External_Careers/job/Sydney-NSW-Australia/Graduate-Software--App--Engineering_JR_017816-1?source=LinkedIn",
    "posted": 1662382273000,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3214167414/?alternateChannel=search&refId=O%2FYFVP39KrfxwBdPi2r4TA%3D%3D&trackingId=iXiYLNUptD11QeoCDoHJ1Q%3D%3D"
  },
  {
    "company": "Crypto Recruit",
    "jobTitle": "Software Engineer Intern - Crypto Staking Platform",
    "type": "intern",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQEfzwcB4Ooo9g/company-logo_100_100/0/1661142356712?e=1671062400&v=beta&t=A7MiMZmruTYiP0Jy2s6WQAE00HzbZ5DmJY11arxVb3c",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                Develop smart contracts and services that interact with the smart contracts. Build data ETL pipelines using Python.<p><br>\n</p><strong><u>About This Role</u></strong><p><br>\n</p>As our Software Engineer Intern, you will have the opportunity to learn about a wide range of technologies at the company, including blockchain protocols, smart contracts, node.js-based backend systems, and react/js-based frontend apps. You will work closely with a group of talented Product Managers, UX Designers, and other Backend/Frontend Engineers. Let us know your interest and passion, and we may even be able to tailor-make an internship specific to you!<p><br>\n</p><strong>What will you do?</strong> Some possible responsibilities depending on our passion and skillset<p><br>\n</p><ul><li>Build new backend services using node.js and Typescript</li><li>Develop smart contracts and services that interact with the smart contracts</li><li>Build data ETL pipelines using Python</li><li>Build frontend apps that are beautiful, simple, and delightful</li></ul> <strong>What excites us about you?</strong><p><br>\n</p><ul><li>You are currently in a reputable Bachelors or Masters program in the US and graduating this year (2022)</li><li>You are passionate about blockchain technology and a decentralized future, and you are familiar with the technologies behind blockchains.</li><li>You are familiar with one of the following: Solidity/smart contracts, node.js, or React</li><li>Able to work independently and set up an efficient development environment</li></ul> <strong>What will be great to have?</strong><p><br>\n</p><ul><li>You are contributing to the open-source community</li><li>You have previous internship experiences</li><li>You have experience with smart contracts / Solidity (this is a plus but not required, and we will be happy to bring you up to speed on the job)</li></ul> <strong>To hear more about this role you can :</strong><p><br>\n</p><ul><li> email - neil@cryptorecruit.com</li></ul><p><br>\n</p><strong>Cryptorecruit are the worlds leading specialist recruiter for the blockchain/Cryptocurrency industry. We recruit positions from CEO,CTO, Project Manager, Solidity developer, frontend and Backend Blockchain developers to marketing/sales and customer service roles. Please browse our website and at www.cryptorecruit.com to search all our job vacancies.</strong>\n<!---->        ",
    "link": "https://apply.jobadder.com/17537/1425300/fexelaoaqclebkt33foxenb32m?site=au2&show=details&utm_source=adzuna&utm_medium=adzuna&cmpid=1000-891",
    "posted": 1663109485907,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3263872909/?alternateChannel=search&refId=FEMy0PH6vXcFUZYUvSdX2g%3D%3D&trackingId=wqRWM5K1MWPUG1DcSLEajQ%3D%3D"
  },
  {
    "company": "Amazon",
    "jobTitle": "2022-23 Software Dev Engineer Intern - Brisbane, Amazon Fresh",
    "type": "intern",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQHTvZwCx4p2Qg/company-logo_100_100/0/1612205615891?e=1671062400&v=beta&t=HJpyXv7kFu8Pvir6aMYvNsmf2k5Y1r7WL-qQREs94sk",
    "location": "Brisbane, Queensland, Australia",
    "jobDesc": "\n                <strong><u>Job Summary<br>\n<br>\n</u></strong><strong>DESCRIPTION<br>\n<br>\n</strong>Come and build production software as an Amazon Software Development Engineer Intern. We are looking for passionate developers who love solving challenging problems, learning on the job, and working in a team to get stuff done.<br>\n<br>\nYou'll work on all phases of the software lifecycle alongside a diverse team. Your fresh perspective will inform innovative solutions to problems customers' face every day.<br>\n<br>\nAmazon offers a unique work environment. You will be able to work on the A to Z of problems, at scale, for real customers.<br>\n<br>\nGet your career off to a flying start! Solve challenging problems. Build software that helps customers daily. And have a ton of fun doing all that. We want to hear from you today!<br>\n<br>\n<strong><u>Responsibilities<br>\n</u></strong><ul><li> Ability to design and code right solutions starting with broadly defined problems.</li><li> Drive best practices and engineering excellence.</li><li> Work with other team members to develop the architecture and design of new and current systems.</li><li> Work in an agile environment to deliver high quality software.<br>\n</li></ul>This internship will start from December 2022 to February 2023. You must be available during this period to be eligible.<br>\n<br>\nNote: Applications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. Please note that we are reviewing a high volume of applications and appreciate your patience.<br>\n<br>\n<strong><u>Acknowledgement Of Country<br>\n<br>\n</u></strong>In the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.<br>\n<br>\n<br>\n<strong><u>Basic Qualifications<br>\n</u></strong><ul><li> Candidates will need to be in their penultimate year of their overall Bachelors/ Masters in Computer Science or Engineering or related field.</li><li> You must have Australian/New Zealand citizenship or Australian permanent residency at the time you submit your application.</li><li> Excellent problem solving skills.</li><li> Possess an extremely sound understanding of areas in the basic areas of Computer Science such as Algorithms, Data Structures, Object Oriented Design, Databases.</li><li> Be able to write Amazon quality code in an object oriented language - preferably in C/C++/Java in a Linux environment.</li><li> Candidate must have good written and oral communication skills, be a fast learner and have the ability to adapt quickly to a fast-paced development environment.<br>\n<br>\n</li></ul><strong><u>Preferred Qualifications<br>\n<br>\n</u></strong>Please note this role is based in Brisbane.<br>\n<br>\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected attributes.<br>\n<br>\n<br>\n<strong>Company</strong> - Amzn Commercial Srvcs Pty Ltd<br>\n<br>\nJob ID: A1969587\n<!---->        ",
    "link": "https://www.amazon.jobs/en/jobs/1969587/2022-23-software-dev-engineer-intern-brisbane-amazon-fresh?cmpid=SPLICX0248M&ss=paid&utm_campaign=cxro&utm_content=job_posting&utm_medium=social_media&utm_source=linkedin.com",
    "posted": 1663109587802,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3260820936/?alternateChannel=search&refId=q%2B9n%2BbDpPalk80Zzt4LMgQ%3D%3D&trackingId=wd29oRRw9pepk74BHvXFzw%3D%3D"
  },
  {
    "company": "Boeing",
    "jobTitle": "Graduate Software Engineer",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4E0BAQHpXZDZYImrdA/company-logo_100_100/0/1542647676208?e=1671062400&v=beta&t=yyNDEkx7cJzuBuMhtxvNOLMCKnAQZAPNDPfoNvVU7Oc",
    "location": "Williamtown, New South Wales, Australia",
    "jobDesc": "\n                <strong>Job Description</strong><p><br>\n</p>At Boeing, we innovate and collaborate to make the world a better place. From the seabed to outer space, you can contribute to work that matters with a company where diversity, equity and inclusion are shared values. We’re committed to fostering an environment for every teammate that’s welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us.<p><br>\n</p>Location:<p><br>\n</p>RAAF Base Williamtown<p><br>\n</p>Category:<p><br>\n</p>Engineering / Technical<p><br>\n</p>Position Type:<p><br>\n</p>Permanent<p><br>\n</p>Job Reference:<p><br>\n</p>BOE/1650468<p><br>\n</p>6J.7B.6D7_Lvl_1_Software_Engineer.pdf (PDF, 100KB)<p><br>\n</p>Job Specification<p><br>\n</p>Share This:<p><br>\n</p><strong>Graduate Software Engineer</strong><p><br>\n</p>Boeing Defence Australia is looking for talented final year Software Engineers to develop and deliver world class capabilities and systems to protect Australia and its national interests. Boeing Defence Australia provides a dynamic highly technical work environment that will see you grow professionally whilst allowing you to achieve a healthy work life balance. We looking for people who thrive on solving problems and bring unique, creative solutions to solve our operating challenges. Boeing Defence Australia is at the forefront of technology, actively improving the aerospace industry.<p><br>\n</p><strong>The Opportunity</strong><p><br>\n</p>The successful candidate will be a key part of BDA's Ground Systems Mission Support and Operations Software team engaged on the E-7A AEW&amp;C program. This particular role will see you work as part of a team responsible the serviceability, upgrade and support of the Mission Support Segment of the E-7A Wedgetail AEW&amp;C platform for the Royal Australian Air Force.<p><br>\n</p>This role is suited to final year Software Engineers.<p><br>\n</p>On graduation and receipt of your security clearance you would relocate to <strong>Newcastle NSW</strong>and commence work on the many exciting projects within the Ground Systems capability.<p><br>\n</p><strong>Responsibilities</strong><p><br>\n</p>As a graduate engineer on the BDA graduate program you will have:<p><br>\n</p><ul><li>Opportunity to rotate within the business and broaden experience.</li><li>Structured learning environment for exposure to the broader company.</li><li>Access to a designated support network including a mentor and buddy.</li><li>Access to graduate workshops to develop soft skills.</li><li>Opportunities to network across the business.</li><li>Be a part of the wider Boeing graduate cohort.</li></ul><p><br>\n</p>As a Boeing engineer you will have the opportunity to engage in a broad range of engineering activities including:<p><br>\n</p><ul><li>Developing, testing, documenting and supporting software for the organisation and customers.</li><li>Problem solving and troubleshooting.</li><li>Assisting in the specification and maintenance of software requirements.</li><li>Suggest opportunities for design and process improvement.</li><li>Develop technical documentation.</li><li>Learn on the job, working under the guidance of experienced engineers.</li></ul><p><br>\n</p><strong>Experience/Qualifications</strong><p><br>\n</p><ul><li>Successful completion of Bachelor degree in Software Engineering, Computer Science or similar engineering degree stream.</li><li>Excellent written and oral communication skills.</li><li>A desire to learn.</li><li>Australian citizenship.</li></ul><p><br>\n</p><strong>Benefits</strong><p><br>\n</p><ul><li>Flexible working options</li><li>Study assistance</li><li>Salary packaging</li><li>Employee Incentive Program</li><li>Global opportunities</li><li>Relocation Package</li></ul><p><br>\n</p>Boeing has implemented a new COVID-19 Vaccination Policy in Australia that requires all new Boeing Australia hires to show proof of being fully vaccinated from COVID-19, or have an approved medical exemption. This role is categorised as Group 1 under the Boeing Australia COVID-19 Vaccination and Safety Controls Policy.<p><br>\n</p>We are committed to building a diverse and inclusive workplace. Female applicants, people of Aboriginal or Torres Strait Island descent and ex-defence personnel are encouraged to apply.<p><br>\n</p>Applicants must be Australian Citizens to meet defence security requirements.<p><br>\n</p><strong>Equal Opportunity Employer:</strong><p><br>\n</p>Boeing is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, genetic factors, military/veteran status or other characteristics protected by law.\n<!---->        ",
    "link": "https://jobs.boeing.com/job/-/-/185/36094156224?utm_source=linkedin&utm_medium=job_posting&utm_campaign=ra-us&dclid=COCi0JbWl_oCFcwO1Qod41MDIA",
    "posted": 1663274902808,
    "linkedinLink": "https://www.linkedin.com/jobs/search/?currentJobId=3264906099&keywords=Graduate%20Software%20Engineer%20Boeing"
  },
  {
    "company": "Honeywell",
    "jobTitle": "Software Engr I",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQFvcIh3UnA5zw/company-logo_100_100/0/1535662846602?e=1671062400&v=beta&t=o9kuD_BYxranVV0Q3Aj04FGtQ1UYGrlRT1QchTOhRNo",
    "location": "North Ryde, New South Wales, Australia",
    "jobDesc": "\n                Join the industry leader to design the next generation of breakthroughs<br>\n<br>\nUnique opportunity in Australia to work at the Honeywell Software Centre Sydney on automation and digitalization software for the buildings domain.<br>\n<ul><li>Use your engineering and software skills to develop game changing innovations and solve interesting engineering challenges, to help make the world more productive, sustainable, secure &amp; safer</li><li>Join a friendly supportive team where you can learn from the best Get to learn &amp; apply modern technologies to solve real world problems, and have the opportunity to follow flexible career paths</li><li>Develop our premier cloud offering Honeywell Forge Predictive Maintenance, deployed in a whole range of different industries around the world.<br>\n</li></ul>The Honeywell Software Centre Sydney is a global software development centre &amp; design studio for Honeywell. We build systems that enable our buildings customers to improve their operations and are recognised as a worldwide leader in the development of innovative systems and human machine interface software, using contemporary development methodologies &amp; tools. We hire talented people, nurture their growth, give opportunities to make a difference, and promote from within.<br>\n<br>\n<strong><u>About The Role<br>\n<br>\n</u></strong>Reporting to the Software Development Manager, you will be responsible for the development of new software innovations and features for our Honeywell Forge Predictive Maintenance offering.<br>\n<br>\n<strong><u>Key Responsibilities<br>\n</u></strong><ul><li>Perform software engineering tasks as part of a team to develop innovations for Honeywell’s market leading mission critical software solutions</li><li>Apply contemporary software development methodologies and tools, such as Agile and Iterative development, across the full development lifecycle</li><li>Provide responsive customer support for software solutions developed<br>\n</li></ul><strong><u>Key Experience &amp; Capabilities<br>\n</u></strong><ul><li>Recent graduate (or graduate who will finish in the next 6 months) in engineering and software, such as Software Engineering, Mechatronic, Electrical engineering with credit average or above</li><li>Able to work well in a team to achieve results</li><li>Solid development skills – Hacker rank, Git Repository evidence</li><li>C#, .NET Core, Javascript, Java, C/C++, or any other general-purpose language<br>\n</li></ul>If you’re an engineer at heart who is passionate about using software and technology to solve real world problems, then this is the role for you! We are looking for outstanding candidates who like taking initiative and working with others to get results. We develop using an exciting and diverse range of software technologies and tools. If you live and breathe software, love to master new skills to solve complex and rewarding problems, then we want to hear from you!<br>\n<br>\n<strong><u>About Us<br>\n<br>\n</u></strong>The world is changing. And it’s a familiar story at Honeywell. Our $36 billion business was founded on a legacy of firsts spanning 130 years. We’re building a safer, smarter, and more sustainable world through our technology and software across each of our 930 sites globally. Our impact is seen in every shape and size around the world. Our solutions are felt daily in aerospace, buildings and cities, retail, chemicals and materials, safety, industrial and manufacturing, safety, and supply chains.<br>\n<br>\n<strong>Discover More<br>\n<br>\n</strong>We’ve been innovating for more than 100 years and now we’re creating what’s next. There’s a lot more available for you to discover. Our solutions, our case studies, our #futureshapers, and so much more. Learn more at careers.honeywell.com/us/en/<br>\n<br>\nIf you believe what happens tomorrow is determined by what we do today, you’ll love working at Honeywell.<br>\n<br>\nThe future is what we make it. So join us and let’s do this together.<br>\n<br>\nHoneywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status.<br>\n<br>\nHoneywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status.<br>\n<br>\nFor more information on applicable equal employment regulations, refer to the EEO is the Law poster.<br>\n<br>\nPlease refer to the EEO is the Law Supplement Poster &amp; the Pay Transparency Policy .<br>\n<br>\nFor more information on how we process your information in the job application process, please refer to Recruitment Privacy Notice.<br>\n<br>\nIf a disability prevents you from applying for a job through our website, request assistance here. No other requests will be acknowledged.<br>\n<br>\nCopyright © 2020 Honeywell International Inc<br>\n<br>\nAdditional Information<br>\n<ul><li>JOB ID: HRD173111</li><li>Category: Engineering</li><li>Location: 2 Richardson Place,North Ryde,NEW SOUTH WALES,2113,Australia</li><li>Nonexempt</li></ul> Global (ALL)\n<!---->        ",
    "link": "https://careers.honeywell.com/us/en/job/HONEUSHRD173111EXTERNALENUS/Software-Engr-I?utm_source=linkedin&utm_medium=phenom-feeds",
    "posted": 1663274915789,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3261196666/?alternateChannel=search&refId=T9QMdEUJsvtbv1F4%2BmlbYA%3D%3D&trackingId=DYegNAqCVbfY2MVv2VVLVw%3D%3D"
  },
  {
    "company": "Honeywell",
    "jobTitle": "Graduate Software Engineer",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQFvcIh3UnA5zw/company-logo_100_100/0/1535662846602?e=1671062400&v=beta&t=o9kuD_BYxranVV0Q3Aj04FGtQ1UYGrlRT1QchTOhRNo",
    "location": "North Ryde, New South Wales, Australia",
    "jobDesc": "\n                <br>\n<br>\nAt Honeywell, we make a lot of incredible things. But most importantly, we make the future, and are looking for people to join our team global team of future shapers. When you join Honeywell, you become a member of our performance culture comprised of diverse leaders, thinkers, innovators, dreamers, and doers who are changing the future. Our people are committed to each other and to the realisation of our vision through their unique job functions. Our businesses embrace the challenges of innovation so that we define the future. And our global opportunities are endless for you to grow and get recognised for your passion to perform.<br>\n<br>\n<strong>The Honeywell Software Centre Sydney is a global software development centre &amp; design studio</strong> for Honeywell. We build systems that enable our industrial customers to improve their operations and are recognised as a worldwide leader in the development of innovative systems and human machine interface software, using contemporary development methodologies &amp; tools. We hire talented people, nurture their growth, give opportunities to make a difference, and promote from within.<br>\n<br>\nIf you are you passionate about solving challenging technical problems using software to make the world a better place, would like significant product software projects to work on, and are looking for a supportive organization with plenty of opportunities to build you career this could be the dream job for you.<br>\n<br>\n<strong><u>About The Role<br>\n<br>\n</u></strong>As a Graduate Software Engineer, you’ll work with others in a team to contribute to the development of new software innovation, using contemporary software processes, tools and quality systems to develop mission critical software solutions. You will be reporting to the Software Development Manager and be a part of 4-6 other team members within a scrum team.<br>\n<br>\n<strong><u>Key Responsibilities<br>\n</u></strong><ul><li>Perform software engineering tasks as part of a team to develop innovations for Honeywell’s market leading mission critical software solutions</li><li>Apply contemporary software development methodologies and tools, such as Agile and Iterative development, across the full development lifecycle</li><li>Provide responsive customer support for software solutions developed<br>\n</li></ul><strong><u>Key Experience &amp; Capabilities<br>\n</u></strong><ul><li>Recent graduate (or graduate who will finish in the next 6 months) in engineering and software, such as Software Engineering, Mechatronic, Electrical engineering with credit average or above</li><li>Able to work well in a team to achieve results</li><li>Solid development skills – Hackerrank, Git Repository evidence</li><li>Prefers C++ experience for more experienced role, familiarity with JavaScript, React, HTML, CSS also highly valued.<br>\n</li></ul>If you’re an engineer at heart who is passionate about using software and technology to solve real world problems, then this is the role for you! We are looking for outstanding students who like taking initiative and working with others to get results. We develop using an exciting and diverse range of software technologies and tools. If you live and breathe software, love to master new skills to solve complex and rewarding problems, then we want to hear from you!<br>\n<br>\nYou will have the opportunity to work with our talented and friendly team of professionals and be part of a global team!<br>\n<br>\n<strong><u>Application Information<br>\n</u></strong><ul><li>Applications will close by 25th July'22</li><li> Anticipated start date would be Feb 2023</li><li>Permanent Residency in Australia or New Zealand, or Citizenship is required. Student and bridging visas will not be accepted</li><li>Successful candidates will be required to successfully complete pre-employment background and drug screening.</li><li>For more information visit: www.earlycareersathoneywell.com.au Also meet our graduates at https://earlycareersathoneywell.com.au/our-graduates<br>\n</li></ul>Discover More<br>\n<br>\nWe’ve been innovating for more than 100 years and now we’re creating what’s next. There’s a lot more available for you to discover. Our solutions, our case studies, our #futureshapers, and so much more. Learn more at careers.honeywell.com/us/en/<br>\n<br>\nIf you believe what happens tomorrow is determined by what we do today, you’ll love working at Honeywell.<br>\n<br>\nThe future is what we make it. So, join us and let’s do this together.<br>\n<br>\nHoneywell is an equal opportunity employer, and we support a diverse workforce. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status. Aboriginal and Torres Strait Islander peoples are encouraged to apply.<br>\n<br>\nCopyright © 2020 Honeywell International Inc<br>\n<br>\nAdditional Information<br>\n<ul><li>JOB ID: req338120</li><li>Category: Engineering</li><li>Location: 2 Richardson Place,North Ryde,NEW SOUTH WALES,2113,Australia</li><li>Nonexempt</li></ul>\n<!---->        ",
    "link": "https://careers.honeywell.com/us/en/job/HONEUSREQ338120EXTERNALENUS/Graduate-Software-Engineer?utm_source=linkedin&utm_medium=phenom-feeds",
    "posted": 1663274930089,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3241487921/?alternateChannel=search&refId=qlCAwSro%2BPJCvvS6ldJXqw%3D%3D&trackingId=eZHtVTO7qqiV%2FP9wXzUA%2Bg%3D%3D"
  },
  {
    "company": "swipejobs",
    "jobTitle": "Graduate Software Engineer",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C510BAQFYMnBBRucMVg/company-logo_100_100/0/1528862539066?e=1671062400&v=beta&t=KzRmg4PqciWjxJBmN8htjoaPSAUnVlErSU1C2nDp3EM",
    "location": "North Sydney, New South Wales, Australia",
    "jobDesc": "\n                <p>At swipejobs we are a small team, in a fast paced environment, focused on the U.S market. We are a fully funded, entrepreneurial tech company using leading edge technology to transform the staffing market.</p><p><br>\n</p><p>We are looking for <strong>Graduate Software Developers</strong> to join our two-year Graduate Program. To be successful in this role, you need to be passionate with coding, curious with technology and take ownership of your work.</p><p><br>\n</p><p>You will need to have successfully <strong>completed</strong> a degree in <strong>Computer Science</strong> or <strong>Software Engineering </strong>with majors in Software Engineering, Big Data or Computer Science who finished in 2021 or will be finishing in 2022 or 2023. You will need a strong academic record and experience in programming is favourable.</p><p><br>\n</p><p>You need to have the ability to learn on the go, show strong initiative to pick things up and run with them, and excel in a collaborative environment. You will also need to be able to communicate well, have a great attitude to work and think that work and play goes hand in hand. If you like solving problems, exploring new and better ways of doing things, discussing and working with new technology; you will fit right in!</p><p><br>\n</p><p>You will find yourself working alongside talented, driven people who will push you to learn and excel. We focus on the important things and get them done.</p><p><br>\n</p><p>We have a casual friendly working environment, a flat organisational structure (where everyone is accessible on a day to day basis) and a technology stack that is cutting edge. There will be opportunities for problem solving and innovation; where your contribution can have a significant impact as we strive to be the global leader in labour market technology.</p><p><br>\n</p><p>As a Graduate at swipejobs, you will be based in North Sydney. Food and drinks are provided with a team lunch every day.</p><p><br>\n</p><p>If you are talented, driven, keen to get accelerated development and not get stuck in the grind of a big-co grad program, then come along for the journey; we would like to hear from you!</p><p><br>\n</p><p>To apply, submit your <strong>resume</strong>, <strong>student transcript</strong> and a short note on why you would be the perfect person to join our team.</p><p><br>\n</p><p><strong>Please note: all applicants must have valid Australian working rights. </strong></p><p><br>\n</p><p>Swipejobs offers a number of flexible employment options, including part-time. There are also options to work from anywhere for 4 weeks a year.</p>\n<!---->        ",
    "link": "https://www.linkedin.com/jobs/view/3233219118/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=MN%2B7eYcnVnHKBZn%2F9uf80Q%3D%3D&trackingId=TSVuokAa%2Fy%2BIfGY0J43RAQ%3D%3D&trk=flagship3_search_srp_jobs",
    "posted": 1663274941818,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3233219118/?alternateChannel=search&refId=74nmOf1KiAbtdgtCkJwevg%3D%3D&trackingId=Or3NMoHT%2BCVanNSKd6YuLA%3D%3D"
  },
  {
    "company": "Amazon Web Services (AWS)",
    "jobTitle": "2022 Software Development Graduate - ASAP Start",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQE_4UwvNNtNTQ/company-logo_100_100/0/1640205885683?e=1671062400&v=beta&t=bdiTf0XE6T730HSslMVDTnuaszWjif4MJvBZQ03aylI",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                <strong><u>Job Summary<br>\n<br>\n</u></strong><strong>DESCRIPTION<br>\n<br>\n</strong>Amazon is looking for passionate Graduate Software Development Engineers (SDEs) to join our team. You will build software for Amazon’s rapid fulfillment businesses for use across the globe.<br>\n<br>\nAmazon offers a unique, inclusive work environment where you’ll be able to work on the A to Z of problems, at scale, for real customers. You’ll join a team solving challenging problems with innovative software solutions, building global software at scale every day and having a ton of fun while you do it.<br>\n<br>\nWe are a group of engineers that values diversity and collaboration to help each other succeed as a team. Bring your experiences, perspectives and skills to help build a great shopping experience for customers all around the world. We're looking for developers with a passion for solving challenging problems, learning on the go and working with teammates to have a global impact.<br>\n<br>\nKey job responsibilities<br>\n<br>\nYou will own the development of software end to end, from working with stakeholders on requirements through to owning the ongoing operations of the software that you build at scale. You will work with a great, global team to tackle new challenges. You will have the opportunity to experiment and learn from your successes and your failures.<br>\n<br>\nApply today to join our incredible team building software for our customers around the world. Have fun and build great software!<br>\n<br>\n**Amazon does not sponsor work visas for this role so you must have the full working rights in Australia so either Australian/NZ citizenship or Australian PR **<br>\n<br>\n<br>\n<strong><u>Preferred Qualifications<br>\n<br>\n</u></strong><strong>BASIC QUALIFICATIONS<br>\n</strong><ul><li> Experience developing in a Linux environment</li><li> Experience developing software on Amazon Web Services (AWS) platforms<br>\n</li></ul>Note: Applications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. Please note that we are reviewing a high volume of applications and appreciate your patience.<br>\n<br>\n<strong><u>Acknowledgement Of Country<br>\n<br>\n</u></strong>In the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.<br>\n<br>\n<strong><u>Preferred Qualifications<br>\n</u></strong><ul><li> You must be in the final year of a university undergraduate or postgraduate degree or have completed your university studies within the past 24 months of applying.</li><li> Enrolled/Completed a degree in Computer Science, Computer Engineering, Information Technology at university or relevant tertiary institution</li><li> Strong, object-oriented design and coding skills (C/C++ and/or Java preferably on a UNIX or Linux platform)</li><li> Knowledge of Perl or other scripting languages a plus</li><li> Experience with distributed (multi-tiered) systems, algorithms, and relational databases</li><li> Experience in optimization mathematics (linear programming, nonlinear optimization)</li><li> Ability to effectively articulate technical challenges and solutions</li><li> Deal well with ambiguous/undefined problems; ability to think abstractly<br>\n<br>\n</li></ul><strong>Company</strong> - AWS Australia Pty Ltd<br>\n<br>\nJob ID: A2131280\n<!---->        ",
    "link": "https://www.amazon.jobs/en/jobs/2131280/2022-software-development-graduate-asap-start?cmpid=SPLICX0248M&ss=paid&utm_campaign=cxro&utm_content=job_posting&utm_medium=social_media&utm_source=linkedin.com",
    "posted": 1663274955060,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3147298283/?alternateChannel=search&refId=nLKyuDPrYTjm7m4ESB9Uhw%3D%3D&trackingId=iBWBi7tPni8Ja5BwGYV7%2FQ%3D%3D"
  },
  {
    "company": "Verifone",
    "jobTitle": "Graduate Software Engineer",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFYp3ikeAfwWA/company-logo_100_100/0/1519856320587?e=1671062400&v=beta&t=Goq8sJ9oGmfyw2qcoF_El1s1KALc-oqCLB56Kxu1NO4",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                Details<p><br>\n</p>Verifone Australia provides integrated payments solutions, we manufacture the Hardware, develop the Terminal Software, and provide developer SDK’s and Payments API's that allow merchants to provide robust and innovative solutions to their customers.<p><br>\n</p>Our Solutions Engineering team (located in North Sydney) is looking for Engineering resources to join us on a 3 month contractual role with a possibility of becoming permanent.<p><br>\n</p>Engineering Interns will join one of our Agile feature teams who are aligned with one of our key customers program of work. These teams are made up with Developers, Automation Engineers, a Business Analyst, Product owner and are supported by Architecture, Security and Compliance experts along with team-mates from our Infrastructure and Operations team and our customer facing support teams..<p><br>\n</p>You will focus initially on Android development, Test automation, and Business analysis. As we come to understand your underlying strengths and career aspirations, we can then tailor a career development path for you.<p><br>\n</p>if this sounds like a good fit for your skills, we'd love to talk with you about your aspirations and being part of our Internship program. Verifone is a global organisation and our internship program will get you working with some of the brightest minds in the payments industry and smart engineers from Australia, NZ, USA, India and Europe , you will get solid industry and Software and Solution Engineering experience<p><br>\n</p><strong>What qualifications will you need to be successful?</strong><p><br>\n</p><ul><li>A bachelor's degree in computer science, computer engineering or related technical discipline</li><li>Only for candidates who graduate in 2020/2021</li><li>Australian/New Zealand citizen/Australian Permanent Resident</li></ul><p><br>\n</p><strong>Our commitment</strong><p><br>\n</p>Verifone is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. Verifone is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n<!---->        ",
    "link": "https://www.verifone.com/en/careers/job-posting/4846550003?gh_jid=4846550003",
    "posted": 1663274968700,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3266283027/?alternateChannel=search&refId=r1Kz%2Ft6PiCWc7epMZPTmhg%3D%3D&trackingId=QIN8giRgXoOFtPEHSABbig%3D%3D"
  },
  {
    "company": "FDM Group",
    "jobTitle": "Software Development Graduate Program",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4E0BAQGRSVTWH93-yg/company-logo_100_100/0/1656929650628?e=1671062400&v=beta&t=-uQF0Pu86KeME_qjISLk-JiY1WkJaPyK4utmbzOpNgo",
    "location": "Melbourne, Victoria, Australia",
    "jobDesc": "\n                <p><strong>There are thousands of graduates in the market, stand out from the crowd.</strong></p><p><br>\n</p><p>Do you thrive in fast-paced technical environments and have a strong attention to detail? Are you eager to have a career where you are encouraged to meet your potential and have the opportunity to work for a prestigious company with an impressive global presence?</p><p><br>\n</p><p>FDM is a FTSE 250 employer operating across Asia-Pacific, the UK, mainland Europe and North America. We provide various opportunities for our consultants to work in technical roles alongside some of the world’s biggest brands banking &amp; finance, insurance, consultancy, retail and charity industry.</p><p><br>\n</p><p>We are currently seeking candidates interested in building a career within <strong>Software Development</strong>. Once you have finished your training with us, you will have a highly sought-after skill set and experience in a technical role that requires high levels of expertise, opening a number of exciting alternative future career paths to you.</p><p><br>\n</p><p>A career in Software Development is incredibly varied and comes with fantastic career progression opportunities such as Lead Developer, Technical Architect and Chief Information Officer or specialist roles such as Applications Developer, Web Developer, Systems Developer and Cloud Engineer.</p><p><br>\n</p><p><strong>What will my time at FDM be like?</strong></p><p>When you join the FDM training academy in Sydney, you will have the opportunity to receive the relevant technical training and qualifications needed to succeed in a career in tech. After successfully completing your training, you will work with one or more of our clients during the two-year program.</p><p><br>\n</p><p>Our award-winning Careers Program allows you to become an expert within your field as you will gain transferable skills and receive full support and mentoring throughout your time with us.</p><p><br>\n</p><p><strong>What will I offer FDM? </strong></p><ul><li>Excellent communication skills and an ability to build relationships</li><li>Ambitious characteristics with a drive to succeed within tech</li><li>Bachelor’s degree or higher, preferably within a STEM discipline but all degrees accepted</li><li>Strong analytical ability</li><li>High attention to detail</li><li>Good decision-making skills within fast-paced working environments</li><li>Geographical flexibility across Sydney and Melbourne to support our clients</li><li>Commitment to a two-year contract with FDM upon completion of the training period</li></ul><p><br>\n</p><p><strong>What will FDM offer me?</strong></p><ul><li>Attractive salary package (Salary + 10% Superannuation + 3months of fully- funded training + BAYE option)</li><li>Access to industry-recognised qualifications</li><li>Development employability skills including Microsoft Excel, CV writing, interview and presentation techniques</li><li>Modern training academies in city centre locations</li><li>Social events and networking opportunities</li><li>A foot in the door to some of the world’s most reputable organisations</li><li>Mentoring and ongoing support throughout your entire FDM journey</li></ul><p><br>\n</p><p><br>\n</p><p><i>FDM embraces diversity and encourages applications from people with disability. Candidates will have the opportunity to request support or reasonable adjustments during the recruitment process in order to demonstrate their ability to meet the inherent requirements of the job.</i></p>\n<!---->        ",
    "link": "https://careers.fdmgroup.com/vacancies/217/australia--software-development-consultant.html?utm_source=linkedin&utm_medium=jobad&utm_campaign=grad_dev_&utm_content=aus_",
    "posted": 1663274983321,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3247167294/?alternateChannel=search&refId=5ClTWaKIlRhC%2BpM%2B2FJA0Q%3D%3D&trackingId=YS1NzbGdicBul7GypKKjxw%3D%3D"
  },
  {
    "company": "RPMGlobal",
    "jobTitle": "Graduate Software Consultant",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQG_fcmV8QJOfA/company-logo_100_100/0/1569197874643?e=1671062400&v=beta&t=ACzRPkusQQ-EG4oSQAgqLrEnXnkYaot-UMPO9kuv9_w",
    "location": "Brisbane, Queensland, Australia",
    "jobDesc": "\n                <strong><u>About The Role<br>\n<br>\n</u></strong>RPMGlobal is seeking a Software Engineering or Computer Science Graduate with an interest in Business Intelligence and data.<br>\n<br>\nThe Graduate Software Consultant will be an integral member of multi-disciplined project teams providing services to multiple departments, with a specific focus on data, business intelligence and reporting.<br>\n<br>\nThe role will be focused on the development, use and implementation of our operational mining software within our Operational Data team. The role is based out of the RPM Brisbane CBD headquarters.<br>\n<br>\nKey Responsibilities<br>\n<ul><li> Support the RPM Software Consulting group. </li><li> Critical data analysis and cleansing. </li><li> Perform software related consulting activities. </li><li> Respond to technical support requests. </li><li> Develop reports based on analysis and findings. <br>\n</li></ul><strong><u>About You<br>\n<br>\n</u></strong>You will have:<br>\n<ul><li> Tertiary Qualification in Software Engineering, Computer Science or Data Analytics. </li><li> Ability to communicate well and build relationships with colleagues and customers. </li><li> A high standard of written and spoken English language. </li><li> An aptitude in learning new software applications. </li><li> Must have the right to legally work in Australia. <br>\n</li></ul><strong><u>About RPM<br>\n<br>\n</u></strong>RPMGlobal is the mining industry’s leading advisory and consulting, enterprise technology and training provider and has been at the forefront of change and innovation in the mining industry for over 50 years.<br>\n<br>\nWe advance the mining industry towards a safer, more efficient, and more sustainable future through the delivery of innovative software solutions and deep domain mining expertise. Guided by our underlying principles of mining expertise, innovation, and sustainability, we strive to create safer and more efficient operations for our mining customers.<br>\n<br>\nOur focus on providing advanced mining advisory and consulting, enterprise technology and training across the mining lifecycle, enables us to guide customers through the current and emerging challenges the industry faces worldwide. This includes helping them meet the shift in social norms and consumer and investor ESG-related expectations.<br>\n<br>\nPlease, no agencies or recruiters.<br>\n<br>\n\n<!---->        ",
    "link": "https://rpmglobal.bamboohr.com/jobs/view.php?id=62",
    "posted": 1663275004187,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3252926633/?alternateChannel=search&refId=uC102A5PD4m60tB1EUQbHA%3D%3D&trackingId=v5Q%2BhvU%2Fm3yogJvFlQxQMw%3D%3D"
  },
  {
    "company": "Infosys",
    "jobTitle": "Graduate Technology Associate",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFT17AbDs0seQ/company-logo_100_100/0/1656660630831?e=1671062400&v=beta&t=MhN6MVVYiDATQSxhzrdtx_csqdW9eC47kFDlADwqfaA",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                <p><strong><u>Expression of Interest – Early 2023 – Graduate – Technology Associate - Sydney</u></strong></p><p><br>\n</p><p>Infosys is a global leader in next-generation digital services and consulting. We enable clients in more than 50 countries to navigate their digital transformation. With over four decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem.</p><p><br>\n</p><p>Visit www.infosys.com to see how Infosys (NYSE: INFY) can help your enterprise navigate your next.</p><p><br>\n</p><p>Roles and Responsibilities:</p><p>As a Technology Associate, you will work on exciting projects with some of the largest companies in the world. You’ll be met with many new opportunities and do more by becoming a part of the Infosys community. We value lifelong learning, creative thinking and foster an entrepreneurial culture. Come amplify your potential and become your very best while helping us co-create the digital and disruptive future of innovation and technology.</p><p><br>\n</p><p>We offer varied pathways in areas like:</p><ul><li>Data Analytics</li><li>Cyber Security</li><li>ERP (such as SAP, Oracle etc)</li><li>Cloud Technologies and Infrastructure Solutions</li><li>Quality Engineering through Testing</li><li>Digital Technologies</li><li>Application Development (such as Business Applications, Mobile Applications, UX/UI etc) and Maintenance</li><li>Artificial Intelligence and Automation and more…</li></ul><p><br>\n</p><p>If your passion is to build solutions that really make a difference to enterprises, the community and your world, Infosys is the right place for you. If you recently completed your graduation or have 0-2 years’ industry experience and are looking for your big career break, then come join us.</p><p><br>\n</p><p>Essential Skills:</p><ul><li>Bachelor’s degree in Science, Technology or Engineering required from an accredited institution (Graduated or near completion)</li><li>Software Development/Programming skills – in any language (Java, Java Script, Python etc)</li><li>Knowledge (through University development projects) in Database structures, data extraction and data manipulation using basic SQL</li></ul><p><br>\n</p><p>Preferred Skills:</p><ul><li>General knowledge about latest technologies including Cloud, Microservices etc</li><li>Project delivery approaches leveraging Agile framework, DevOps (CI/CD – Continuous Integration and Continuous Delivery/Deployment)</li><li>A recent graduate or currently in pursuit of the degree</li><li>The job entails sitting as well as working at a computer for extended periods of time. Should be able to communicate by telephone, email, or face to face. Travel may be required as per the job requirements</li></ul><p><br>\n</p><p>What Infosys can offer you:</p><ul><li>Flexible Working Arrangements</li><li>Advanced, anytime anywhere learning platforms</li><li>Income Protection Insurance</li><li>Health Insurance Benefits</li><li>Employee Assistance Program</li><li>Discounted Corporate Gym Memberships and many more…</li></ul><p><br>\n</p><p>All aspects of employment at Infosys are based on merit, competence and performance. We are committed to embracing diversity and creating an inclusive environment for all employees. Infosys is proud to be an equal opportunity employer.</p><p><br>\n</p><p>At Infosys, we recognize that everyone has individual requirements. If you are a person with disability, illness or injury and require adjustments to the recruitment and selection process, please contact our Recruitment team for adjustment only on Infosys_ta@infosys.com or include your preferred method of communication in email and someone will be in touch.</p>\n<!---->        ",
    "link": "https://digitalcareers.infosys.com/global-careers/company-job/description/reqid/97953BR",
    "posted": 1663275048360,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3241971456/?alternateChannel=search&refId=kPoa%2B7Gw1w1ZubeknwAwTw%3D%3D&trackingId=4VLUCcx2NMzIf02yAr3uEw%3D%3D"
  },
  {
    "company": "Amazon Web Services (AWS)",
    "jobTitle": "Network Development Engineer Internship",
    "type": "intern",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQE_4UwvNNtNTQ/company-logo_100_100/0/1640205885683?e=1671062400&v=beta&t=bdiTf0XE6T730HSslMVDTnuaszWjif4MJvBZQ03aylI",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                <strong><u>Description<br>\n<br>\n</u></strong>Amazon Web Services (AWS), the largest consumer cloud offering in the world, is looking for Network Development Engineer Interns to join, learn and grow with our Sydney engineering team!<br>\n<br>\nAWS is the world leader in providing a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of businesses around the world! This is your opportunity to work directly on the platform that impacts millions of users worldwide, all from the comfort of our Sydney offices.<br>\n<br>\nAs a Network Development Engineer intern in the AWS team, you will be building, growing and maintaining Amazon’s Retail and Web Services network, one of the most complex and largest scale networks of its type, leveraging the latest in high scale networking hardware, multi-tier topologies and advanced tooling so that it can match Amazon's rapid growth. Members of this team play a key role in furthering these technologies, delivering ever expanding network capacity, connectivity whilst ensuring a safe and reliable operating environment, often through development of automated systems and tooling for network operation.<br>\n<br>\nYou will gain exposure in a number of different roles across our Network Engineering, Network Scaling and Deployment and Network Operations teams, where you will also interact with a variety of internal customer, product and software development teams to expand your knowledge and hands on skills in the latest network technologies, practices and operating environments, preparing you for your ongoing career in AWS networking. You will work with a mentor throughout the program and have real impact on the future of our platform whilst honing your networking and software development skills in a true production environment.<br>\n<br>\nInclusive Team Culture<br>\n<br>\nHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.<br>\n<br>\nWork/Life Harmony<br>\n<br>\nOur team puts a high value on work-life harmony. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.<br>\n<br>\nMentorship &amp; Career Growth<br>\n<br>\nOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. Our senior members enjoy one-on-one mentoring. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded engineer and enable them to take on more complex tasks in the future.<br>\n<br>\n<br>\n<strong><u>Basic Qualifications<br>\n</u></strong><ul><li>Graduating in 2023 or 2024 from a bachelor of Information Technology, Computer Science, engineering or science with IT/networking/telecommunications or software major.</li><li>Knowledge of networking fundamentals (TCP/IP, BGP, OSFP, ISIS, MPLS)</li><li>Knowledge of at least one application or foundation programming language (Ruby, Python, Perl, C++)<br>\n</li></ul><strong><u>Preferred Qualifications<br>\n</u></strong><ul><li>CCNA or equivalent level networking certification</li><li>Network troubleshooting or support experience<br>\n</li></ul>This opportunity is open to Australian and NZ citizens, and Australian permanent residents. International students with visa 485 (Temporary Graduate visa) are welcome to apply. For more information about our team, visit https://aws.amazon.com/careers/network-careers-syd/ Amazon is an Equal Opportunity Affirmative Action Employer- F/M/V/D<br>\n<br>\n<br>\n<strong>Company</strong> - Amazon Corporate Services Pty<br>\n<br>\nJob ID: A1713359\n<!---->        ",
    "link": "https://www.amazon.jobs/en/jobs/1713359/network-development-engineer-internship?cmpid=SPLICX0248M&utm_source=linkedin.com&utm_campaign=cxro&utm_medium=social_media&utm_content=job_posting&ss=paid",
    "posted": 1663275074622,
    "linkedinLink": "https://www.linkedin.com/jobs/view/3123181619/?alternateChannel=search&refId=QPRFUXXyGHN4FlQg1DpeUA%3D%3D&trackingId=J7yomjSbZ7b8ZpBePpQoHw%3D%3D"
  },
  {
    "company": "Amazon Web Services (AWS)",
    "jobTitle": "2022-23 Software Dev Engineer Intern",
    "type": "intern",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQE_4UwvNNtNTQ/company-logo_100_100/0/1640205885683?e=1671062400&v=beta&t=bdiTf0XE6T730HSslMVDTnuaszWjif4MJvBZQ03aylI",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                <strong><u>Job Summary<br>\n<br>\n</u></strong><strong>DESCRIPTION<br>\n<br>\n</strong>We are looking for a passionate, hard-working, and talented Software Development Engineer Interns who can build innovative &amp; mission critical system software applications &amp; tools. You will have an enormous opportunity to make a large impact on the design, architecture, and development of consumer products. You will be responsible for delivery and support of large-scale, multi-tiered, distributed software applications and tools.<br>\n<br>\n<strong><u>Responsibilities<br>\n</u></strong><ul><li> Ability to design and code right solutions starting with broadly defined problems.</li><li> Drive best practices and engineering excellence.</li><li> Work with other team members to develop the architecture and design of new and current systems.</li><li> Work in an agile environment to deliver high quality software.<br>\n</li></ul>This internship will start from December 2022 to February 2023. You must be available during this period to be eligible.<br>\n<br>\nNote: Applications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. Please note that we are reviewing a high volume of applications and appreciate your patience.<br>\n<br>\n<strong><u>Acknowledgement Of Country<br>\n<br>\n</u></strong>In the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.<br>\n<br>\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected attributes.<br>\n<br>\n<br>\n<strong><u>Basic Qualifications<br>\n</u></strong><ul><li> Candidates will need to be in their penultimate year of their overall Bachelors/ Masters in Computer Science or Engineering or related field.</li><li> You must have Australian/New Zealand citizenship or Australian permanent residency at the time you submit your application.</li><li> Excellent problem solving skills.</li><li> Possess an extremely sound understanding of areas in the basic areas of Computer Science such as Algorithms, Data Structures, Object Oriented Design, Databases.</li><li> Be able to write Amazon quality code in an object oriented language - preferably in C/C++/Java in a Linux environment.</li><li> Candidate must have good written and oral communication skills, be a fast learner and have the ability to adapt quickly to a fast-paced development environment.<br>\n</li></ul><strong><u>Preferred Qualifications<br>\n</u></strong><ul><li>Strong, object-oriented design and coding skills (C/C++ and/or Java preferably on a UNIX or Linux platform)</li><li>Knowledge of Perl or other scripting languages a plus</li><li>Experience with distributed (multi-tiered) systems, algorithms, and relational databases</li><li>Experience in optimization mathematics (linear programming, nonlinear optimization)</li><li>Ability to effectively articulate technical challenges and solutions</li><li>Deal well with ambiguous/undefined problems; ability to think abstractly</li><li>Previous technical internship(s) preferred<br>\n<br>\n</li></ul><strong>Company</strong> - AWS Australia Pty Ltd<br>\n<br>\nJob ID: A1969578\n<!---->        ",
    "link": "https://www.amazon.jobs/en/jobs/1969578/2022-23-software-dev-engineer-intern?cmpid=SPLICX0248M&ss=paid&utm_campaign=cxro&utm_content=job_posting&utm_medium=social_media&utm_source=linkedin.com",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3148100117/?alternateChannel=search&refId=48hrGzgFLQc1howOf8ocWA%3D%3D&trackingId=5waWtYCiQiLNPddg2fbDew%3D%3D",
    "posted": 1663275087227
  },
  {
    "company": "Cobblestone Energy",
    "jobTitle": "GRADUATE SOFTWARE ENGINEER - Dubai, UAE",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQF4PBrf9BZgVg/company-logo_100_100/0/1622142239115?e=1671667200&v=beta&t=w6-nedKzdFSQHtwMFNDtqT-OQHm2ULTldl8GBsGHWcg",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                Starting salary of <strong>55</strong><strong>,000 USD per annum</strong> in a zero-tax environment.<br>\n<br>\nFast progression for strong performers.<br>\n<br>\n<strong>Job location: </strong>Dubai, UAE<br>\n<br>\n<strong>About us:<br>\n<br>\n</strong>Cobblestone Energy is a proprietary trading firm that specializes in the wholesale electricity market across Europe. Electricity is fundamental to the world's economic activities. We trade enough electricity every day to power a small country, and in doing so, we help to address the mismatch between electricity generation and consumption.<br>\n<br>\n<strong>Job Description<br>\n<br>\n</strong>At Cobblestone Energy we are on a mission to build the most advanced European electricity trading and analytics platform, with our technology being used by our teams of commercial traders to create significant value. We are looking for enthusiastic and resourceful developers who are passionate about building exceptionally reliable and performance data processing solutions. You want to help the commercial team make data-informed decisions, have a curious mindset, and are motivated to understand our business better. Developing a strong domain knowledge of our industry over time is key to long term success in this role.<br>\n<br>\nIf you have excellent programming skills, strong problem-solving skills, and a passion for developing and improving applications utilizing cutting edge technologies, then we would like to meet you.<br>\n<br>\n<strong>What We Offer In This Role<br>\n</strong><ul><li>Competitive remuneration, with fast progression for strong performers. </li><li>A challenging but exciting, open, and fun work environment. </li><li>An opportunity to work with remarkably talented colleagues. </li><li>Vast growth potential in every aspect. </li><li>15% target bonus with further upside. </li><li>Employee share scheme participation </li><li>International relocation support </li><li>Opportunity to be embedded within a commercial team for those with strong commercial interest <br>\n<br>\n</li></ul><strong>Responsibilities<br>\n</strong><ul><li>Write software applications and programs for backend/frontend purposes. </li><li>Analyse programs and apps to improve their features and functionalities. </li><li>Test &amp; debug programs and fix any reported bugs. </li><li>Collaborate with the tech team to improve the performance, efficiency, and scalability of our tools. <br>\n<br>\n</li></ul><strong>Requirements<br>\n</strong><ul><li>BS/BE in Computer Science/Computer Engineering/Electrical &amp; Computer Eng. </li><li>Programming skills in Python language. </li><li>Knowledge of at least one popular Python framework (like Django, Flask ...) is a plus. </li><li>Programming skills in Java is a plus. </li><li>Familiarity &amp; Knowledge in front-end technologies such as HTML5, CSS, JQuery, JS, etc. </li><li>Strong knowledge of REST APIs and webservices. </li><li>Strong knowledge of Relational Databases (MySQL, PostgreSQL, SQL Server ...) and SQL language. </li><li>Knowledge of NoSQL databases is a plus. </li><li>Knowledge of AWS is a plus / Knowledge of data visualization tools, mainly Tableau, is a plus. </li><li>Ability to work in a team environment. </li><li>Strong problem-solving skills and analytical skills. </li><li>Resilience and a determination to succeed. </li><li>Independent thinkers with growth mindset. </li><li>Must be passionate, self-motivated, and able to learn quickly. </li><li>Strong sense of integrity. </li><li>Personal values that match our company values.</li></ul>\n<!---->        ",
    "link": "https://boards.greenhouse.io/cobblestoneenergy4/jobs/5241021003?gh_src=5e1423bd3us",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3282014232/?alternateChannel=search&refId=A6filxNP9A%2FvIJDt78KMhw%3D%3D&trackingId=ygJrQPB9bMqmB0zc7eperw%3D%3D",
    "posted": 1663802734037
  },
  {
    "company": "Fresh",
    "jobTitle": "Software Engineer Intern",
    "type": "intern",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQFPUacoXjNBgQ/company-logo_100_100/0/1651393730489?e=1671667200&v=beta&t=zGmen35HZgJNOGUeCzCGnIJKG4M7dRb10erAw149eTA",
    "location": "Melbourne, Victoria, Australia",
    "jobDesc": "\n                <p><strong>About Us</strong></p><p>Formerly known as Fresh Equities, Fresh was born from an understanding of the key unmet needs that issuers have when it comes to their capital markets strategy. We know the grind that is balancing capital raise requirements and protecting shareholder value, and we know the challenge of reaching and engaging retail shareholders and growing your share price. That's why we invented the Capital Markets Management System, a backbone of tools and analytics to help issuers grow their share price, increase shareholder conviction, and raise capital with minimum dilution.</p><p><br>\n</p><p><strong>TLDR;</strong></p><ul><li>Fresh is a startup and moving fast to help ASX listed companies engage directly with their investors.</li><li>We have a diverse, tight-knit team that is growing as we do.</li><li>Our office is in the CBD with excellent views across the city and an awesome balcony for sunny days.</li><li>The week is split up working remotely and on-site. Snacks, weekly lunches, table tennis, monthly fun days and quarterly off-sites bring us all together and help us all grow and learn as a group.</li><li>We have a modern tech stack that you can work on, NextJS on the front end, deployed on Vercel, and an Elixir backend with GCP for deployment.</li></ul><p><br>\n</p><p>To learn more about our offering, head to https://www.freshamplify.com</p><p><br>\n</p><p><br>\n</p><p><strong>The Opportunity</strong></p><p>We are looking for a budding software engineer to join our internship program. </p><p><br>\n</p><ul><li>You'll have the opportunity to expand your knowledge and have dedicated one-on-one time with our Senior Developers.</li><li>You’ll have time to learn and build on your tech skills, as well as your soft skills that will be valuable in your career moving forward.</li><li>We will integrate you into our multi-functional team, working alongside Product Managers, Designers, and other engineers. </li><li>You’ll be working on our production codebase in no time!</li><li>The chance to learn about capital markets and the ability to interact with team members across all departments such as Customer Success, Equities, Sales, &amp; Management</li></ul><p><br>\n</p><p><br>\n</p><p><strong>About You</strong></p><ul><li>Currently or recently studied a relevant degree in Computer Science, Information Technology, etc.</li><li>Excited to learn, develop, and become part of a team.</li><li>You’ll have knowledge of frontend technologies, Javascript/Typescript, HTML, CSS &amp; React.</li><li>Understanding of backend development, relational databases, and functional languages.</li><li>Bonus points if you’re familiar with Elixir programming language!</li></ul><p><br>\n</p><p><br>\n</p><p><strong>Your Team</strong></p><p>The product team is made up of several small, multi-disciplinary squads. These squads are focused on solving a specific problem. To achieve this, the team starts with a hypothesis and builds, tests, and iterates based on their findings. In these teams, everyone is expected to be a problem solver first. You will be in an environment that is dedicated to learning and growth. While squads are able to act autonomously, we are an incredibly supportive product team and you will be supported by the organisation at large.</p><p><br>\n</p><p><br>\n</p><p><strong>Why Fresh?</strong></p><p>At Fresh we empower our team to identify and solve problems as they see them by working in tight, often cross-functional teams, to deliver amazing user outcomes.</p><p><br>\n</p><p>If you don’t meet all these traits, that’s ok. Diversity of thought, background and approach are all essential ingredients for an amazing customer outcome. Just let us know what it is you think you can bring to the role and the team and why you’re excited to join in.</p><p><br>\n</p><p><strong>In addition to an amazing internship program, we also offer:</strong></p><ul><li>End of month &amp; quarterly celebrations</li><li>Snacks and weekly lunches</li><li>A workplace focused on building communities and providing educational resources for the market.</li><li>Commitment to setting standards in the ESG world.</li><li>Plus lots more!</li></ul><p><br>\n</p><p><br>\n</p><p><strong>Our Recruitment Process</strong></p><ol><li><strong>Apply</strong> - Submit your resume &amp; cover letter</li><li><strong>Take-home task</strong> - A simple challenge using React, HTML, &amp; CSS code</li><li><strong>Google Meet chat</strong> - An opportunity for you to meet your team and debrief your completed task with us</li><li><strong>Group Interview</strong> - Interview at Fresh HQ</li><li><strong>Offer</strong> - Welcome to Fresh!</li></ol><p><br>\n</p><p><br>\n</p><p><br>\n</p><p><i>Fresh is proudly an equal opportunity employer. We value diversity and know we are better and stronger as a team when the team is made up of individuals with different backgrounds and experiences.</i></p><p><br>\n</p><p><i>We recruit, employ, train, compensate and promote regardless of race, colour, gender, sexual orientation, age, physical or mental disability, marital status, family or carer’s responsibilities, pregnancy, religion, or political opinion and we aspire to always be a place that people want to come to do their best work in an inclusive, progressive and open-minded environment.</i></p><p><br>\n</p><p><i>If you have any other questions on the role feel free to reach out to careers@freshequities.com.</i></p><p><br>\n</p><p><i>Recruiters - we respect your expertise and work but at the moment are handling this and other roles internally and ask that you refrain from contacting us to offer your services.</i></p>\n<!---->        ",
    "link": "https://www.linkedin.com/jobs/view/3280204686/?eBP=JYMBII_JOBS_HOME_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=C%2B1NxImc7MhwQvS7zAgz1w%3D%3D&trackingId=v3KlZu6LJGUMRCnendlqDw%3D%3D&trk=flagship3_jobs_discovery_jymbii",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3280204686/?eBP=JYMBII_JOBS_HOME_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=C%2B1NxImc7MhwQvS7zAgz1w%3D%3D&trackingId=v3KlZu6LJGUMRCnendlqDw%3D%3D&trk=flagship3_jobs_discovery_jymbii",
    "posted": 1663802775857
  },
  {
    "company": "Crossover for Work",
    "jobTitle": "Junior Software Engineer, Trilogy (Remote) - $60,000/year USD",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4E0BAQG8bdX5sQ24KQ/company-logo_100_100/0/1620025336126?e=1671667200&v=beta&t=NSq9zj_sRF8-0Tr8Yd4hJ9A3TQbPw7grnc1G2p7xXVs",
    "location": "Melbourne, Victoria, Australia",
    "jobDesc": "\n                Crossover is the world's #1 source of full-time remote jobs. Our clients offer top-tier pay for top-tier talent. We're recruiting this role for our client, Trilogy. Have you got what it takes?<p><br>\n</p>Jumpstart your technical career in Trilogy's 2023 fellowship program. You'll receive unparalleled mentorship, growth opportunities, and career advancement in our two-year program. Work with the best and brightest minds in the software industry!<p><br>\n</p>This is an exciting opportunity to tackle the most pressing problems in the industry, create innovative solutions for customers, and interact with senior executives. Unlike a lot of jobs, when we say entry-level, we mean it. No work experience required.<p><br>\n</p>Your journey will start with Trilogy University - our unique paid training program designed to transform entry-level recruits into tech professionals. During this three-month boot camp, you'll learn the art of innovating solutions to any problem you face. It's during this time that our culture of trust and innovation is instilled, as you work together with your teammates. We're excited to announce that the 2023 Trilogy University will be held in person in Dubai, with all expenses paid by Trilogy!<p><br>\n</p>Following Trilogy University, you will join a fully remote team working across the world. Perform breakthrough experiments utilizing the full power of cloud services, AI, and ML to tackle high-level business challenges. Receive regular training and feedback. And join an elite class of alumni who have launched careers as entrepreneurs, leaders, and influencers.<p><br>\n</p>It won't be easy, but there will never be a dull moment. Join us to jumpstart your career with the world’s top technical minds.<p><br>\n</p><strong><u>What You Will Be Doing</u></strong><p><br>\n</p><ul><li>Exploring a new business problem every 6-8 weeks</li><li>Conducting research and interviewing stakeholders to understand the problem</li><li>Running weekly experiments – write code, review outcomes, debug, log learnings, and iterate</li><li>Delivering prototypes and deployments to customers</li><li>All-expenses-paid international travel twice a year to meet with members of your cohort in exciting global destinations</li></ul><p><br>\n</p><strong><u>What You Won’t Be Doing</u></strong><p><br>\n</p><ul><li>Doing repetitive tasks - no two problems are the same</li><li>Getting it right all the time - frequent feedback will enable you to fail fast and learn quickly</li><li>Working solo - work as part of a small team to tackle challenges</li></ul><p><br>\n</p><strong><u>Junior Software Engineer Key Responsibilities</u></strong><p><br>\n</p>Create clear, simple, technically-superior solutions to complicated problems<p><br>\n</p><strong><u>Basic Requirements</u></strong><p><br>\n</p><ul><li>A degree in Computer Science, Engineering, or another technical field, attained by June 2023</li><li>Strong coding abilities in any language</li><li>Proven problem-solving skills and an ability to communicate clearly</li><li>Quick-learner who can work independently</li><li>Ability to start full-time work in February 2023</li></ul><p><br>\n</p><strong><u>About Trilogy</u></strong><p><br>\n</p>Hundreds of software businesses run on the Trilogy Business Platform. For three decades, Trilogy has been known for 3 things: Relentlessly seeking top talent, Innovating new technology, and incubating new businesses. Our technological innovation is spearheaded by a passion for simple customer-facing designs. Our incubation of new businesses ranges from entirely new moon-shot ideas to rearchitecting existing projects for today's modern cloud-based stack. Trilogy is a place where you can be surrounded with great people, be proud of doing great work, and grow your career by leaps and bounds.<p><br>\n</p>There is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!<p><br>\n</p><strong>Working with Crossover</strong><p><br>\n</p>This is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover. The compensation level for this role is $30 USD/hour, which equates to $60,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic.<p><br>\n</p><strong>What to expect next:</strong><p><br>\n</p><ul><li>You will receive an email with a link to start your self-paced, online job application.</li><li>Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.</li></ul><p><br>\n</p><strong>Important!</strong> If you do not receive an email from us:<p><br>\n</p><ul><li>First, emails may take up to 15 minutes to send, refresh and check again.</li><li>Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.</li><li>Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.</li><li>If all else fails, just reset your password by visiting https://www.crossover.com/auth/reset-password if you already applied using LinkedIn EasyApply.</li></ul> Crossover Job Code: LJ-4513-AU-Melbourn-JuniorSoftware.009<p><br>\n</p>\n<!---->        ",
    "link": "https://www.linkedin.com/jobs/view/3277186626/?eBP=JYMBII_JOBS_HOME_ORGANIC&recommendedFlavor=COMPANY_RECRUIT&refId=C%2B1NxImc7MhwQvS7zAgz1w%3D%3D&trackingId=bVGYbBBYwwt9bBcZKgb%2BUw%3D%3D&trk=flagship3_jobs_discovery_jymbii",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3277186626/?eBP=JYMBII_JOBS_HOME_ORGANIC&recommendedFlavor=COMPANY_RECRUIT&refId=C%2B1NxImc7MhwQvS7zAgz1w%3D%3D&trackingId=bVGYbBBYwwt9bBcZKgb%2BUw%3D%3D&trk=flagship3_jobs_discovery_jymbii",
    "posted": 1663802825238
  },
  {
    "company": "Bukalapak",
    "jobTitle": "Graduate Software Engineer",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C510BAQGC-91AXtMCHQ/company-logo_100_100/0/1585543979975?e=1671667200&v=beta&t=TjAZCHUth4UrxoNXXd5DtEzzbVCkBG4JVCgVxMnFf3Q",
    "location": "Melbourne, Victoria, Australia",
    "jobDesc": "\n                <p><strong>Graduate Software Engineer</strong></p><p><br>\n</p><p>Bukalapak is a tech unicorn with over 110 million users, 13.5 million business partners, 2 thousand plus employees, and big plans for growth!</p><p><strong> </strong></p><p>With brand new offices now open in Australia, Singapore and Korea we are searching for Software Engineers to join us in our mission of creating a fair economy for all. We do this by building platforms that help connect local stores in Indonesia and beyond to a world-class distribution, logistics, and payment network.</p><p><strong> </strong></p><p>As our business continues to grow, we want you to grow with us. We’re not looking for any one particular programming language, we're looking for problem solvers and leaders. As a graduate software engineer, your work will impact tens of millions of users around the world. If you have a passion for developing web applications at scale and learning things across many business platforms and modern products, we would like to hear from you!</p><p><strong> </strong></p><p><strong>The impact you’ll have:</strong></p><p><br>\n</p><ul><li>You’ll apply and mentor others in agile software development best practice</li><li>You’ll develop code that integrates with various systems, both within our platform as well as those made by third-party partners</li><li>You’ll fully own end-to-end development (including design, implementation, automated testing, and deployment) and maintenance of robust, performant, and scalable web applications</li><li>You’ll closely collaborate with other engineers and specialists from backend services, web frontend, mobile apps, security, and infrastructure on product and system design and ideation</li><li>Through the technology you build, you’ll help to turn barriers into opportunities for millions of individuals and businesses through Indonesia, the Philippines, and beyond!</li></ul><p> </p><p><strong>Requirements:</strong></p><p><br>\n</p><ul><li>Professional experience across a range of development languages whilst being able to highly specialised in one or more languages - Golang and Ruby are highly regarded, but not essential</li><li>Professional experience building secure and scalable applications in Vue.js, ReactJS, and/or Angular</li><li>Professional experience on both relational (MySQL, PostgresQL) and NoSQL (Cassandra, MongoDB and/or ElasticSearch) databases</li><li>Proficiency with Linux</li><li>Experience with cloud, such as GCP, Azure, AWS</li><li>Work Authorisation in Australia</li><li>A desire to keep it simple, collaborate, have fun, and most importantly enable our customers to grow. </li><li>Strong communication and collaboration with teams across time zones.</li></ul><p><br>\n</p><p><strong>What would be nice to have:</strong></p><p><br>\n</p><ul><li>Experience with developing web application at scale</li><li>Masters/Ph.D. degree, further education in Computer Science or Software Engineering, or equivalently extensive professional experience in software development.</li><li>Smart, highly motivated, pragmatic and results-driven</li><li>Contribution to open source projects or quality side projects on github</li></ul><p><br>\n</p><p><strong>The perks!</strong></p><p><br>\n</p><ul><li>Brand new office centrally located above Melbourne Central</li><li>Free snacks, drinks, and bi-weekly team lunches</li><li>Flexible work options</li><li>Video games, board games, and dog friendly!</li><li>Modern End of Trip / bike storage facilities with 24/7 access</li><li>Work across a range of business lines from Fintech through to Gaming</li><li>Interstate and international relocation opportunities</li></ul><p><br>\n</p><p>To apply, please simply click ‘apply’ and follow the prompts. </p><p><strong> </strong></p><p>To learn more about Bukalapak’s journey and work please visit https://buka.co.id/index-en.html</p><p><strong> </strong></p><p>We welcome and respond to all direct applications for this role.</p>\n<!---->        ",
    "link": "https://www.linkedin.com/jobs/view/3270511380/?eBP=JYMBII_JOBS_HOME_ORGANIC&recommendedFlavor=COMPANY_RECRUIT&refId=C%2B1NxImc7MhwQvS7zAgz1w%3D%3D&trackingId=KOUyqAP2AHL1qzkl2a046Q%3D%3D&trk=flagship3_jobs_discovery_jymbii",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3270511380/?eBP=JYMBII_JOBS_HOME_ORGANIC&recommendedFlavor=COMPANY_RECRUIT&refId=C%2B1NxImc7MhwQvS7zAgz1w%3D%3D&trackingId=KOUyqAP2AHL1qzkl2a046Q%3D%3D&trk=flagship3_jobs_discovery_jymbii",
    "posted": 1663802854900
  },
  {
    "company": "Deloitte",
    "jobTitle": "Consulting - Digital Technology & Engineering - 2022/23 Graduate Program (Canberra)",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGNtpblgQpJoQ/company-logo_100_100/0/1662120927694?e=1672272000&v=beta&t=SGBwYtXqIIiMIo_CxiZymvpv-WySeNn6VcviH42obIY",
    "location": "Canberra, Australian Capital Territory, Australia",
    "jobDesc": "\n                Description:<br>\n<br>\n<strong>Job Requisition ID:</strong> 23382<br>\n<ul><li>Holistic well-being program – flu vaccinations, fresh fruit and free health assessments </li><li>Get involved in real client work that’s meaningful and purpose-led, developing and building your skills along the way. </li><li>Receive support and coaching to progress your career <br>\n</li></ul>Reimagine how experience platforms can be better designed and delivered and provide rich user interfaces utilising cutting-edge technologies!<br>\n<br>\n<strong>What will you get to do? <br>\n<br>\n</strong>We are a large function within our Customer &amp; Marketing team. We are made up of specialists from all aspects of development, AR/VR and digital analysis. As the conduit between business, technology and creative disciplines, we deliver solid solutions to complex challenges, and bring the best customer experiences to life.<br>\n<ul><li>.NET &amp; Sitecore – We design and deliver modern, scalable digital platforms and applications using Microsoft technologies following best practice software engineering patterns like domain driven design, BFFs and microservices. Technologies leveraged include Sitecore Experience Platform, ASP.NET MVC, ASP.NET Core and cloud platforms including Microsoft Azure and AWS. </li><li>Java &amp; Adobe - We build enterprise scale services that are available, scalable &amp; responsive focused on customer experience. Bring together the very best of the Adobe platforms which provide solutions in content management, personalisation and marketing, and blend them with the Java frameworks, tools and techniques that are deployed and delivered on modern architectures. </li><li>Digital Business Analyst – We analyse and prioritise business requirements and employ several tools and methodologies to co-design and create an optimum digital experience. We also work closely with technology stakeholders to identify and deliver digital solutions to fit the needs of their client. </li><li>Emerging Technology - Use 3D graphics and game technologies to solve business problems by creating apps, software, AR/VR experiences, and brand activations. We work with Unity3D and C# to build bespoke, cutting-edge solutions. </li><li>Commerce - If your passionate about setting the strategy and vision for purchase experiences, then designing and building them this is the team for you. You will have the opportunity to leverage your business analysis and design skills to influence digital commerce experiences across consumer and business clients. Our technical team delivers these experiences across a number of technologies such as Salesforce Commerce Cloud, Magento, Sitecore, SAP and emerging MACH technologies to support headless and PWA experiences. <br>\n</li></ul><strong>Your future starts with us. <br>\n<br>\n</strong>We are Deloitte Digital, a Digital Customer &amp; Marketing consultancy, where we believe that the intersection of creativity, technology and business will deliver the most powerful progress for our clients.<br>\n<br>\nOur difference comes from our depth and diversity. We have the business acumen of a strategic advisor; the design capability of a creative agency and the engineering depth of a technology firm.<br>\n<br>\n<strong><u>Enough About Us, Let’s Talk About You.<br>\n</u></strong><ul><li>You have a technical background, like Computer Science or Software Engineering, or you have technical experience </li><li>You’re a positive communicator and a team player </li><li>You’re interested in the intersect of technology and business <br>\n</li></ul><strong>Why Deloitte? <br>\n<br>\n</strong>At Deloitte, we create positively differentiated work experiences that enable our people to feel valued and achieve their full potential. Deloitte Australia opens the door to a career that can cross borders virtually and physically across Asia Pacific to gain experience and access projects beyond Australia’s borders. We value difference, and embrace people with diverse backgrounds, experiences, gender identities, abilities and thinking styles. Knowing that people work best in a variety of ways, we are happy to discuss alternative arrangements if the working pattern you are looking for is not specifically indicated.<br>\n<br>\nWe’re committed to continually building a safe and respectful workplace, where all our people feel appreciated and accepted. Through the creation of endorsed employee-led diversity networks which promote cultural, disability, LGBTI+, Aboriginal and Torres Strait Islander people and gender equality, we’re leading the way to shape an environment where everybody can thrive.<br>\n<br>\nWe are proud to have been recognised for our efforts in inspiring change and accelerating progress – check out our careers site for recent recognition in this space.<br>\n<br>\n<strong>Next Steps <br>\n<br>\n</strong>Sound like the sort of role for you? Apply now.<br>\n<br>\nBy applying to this job, you will be assessed against the Deloitte Global Talent Standards. We’ve designed these standards to provide our clients with a consistent and exceptional Deloitte employee experience globally.<br>\n<br>\nAt Deloitte, we know we’re at our best when we look out for one another; prioritise respect, fairness, development and wellbeing; foster an inclusive culture and embrace diversity in all forms. All qualified applicants will receive consideration for employment regardless of their background, experience, identity, ability or thinking style, and if you need assistance or an accommodation during the application process for accessibility reasons this is available upon request.<br>\n<br>\nThe preferred candidate will be subject to background screening by Deloitte or by their external third-party provider.\n<!---->        ",
    "link": "https://jobs.deloitte.com.au/job/Canberra-Consulting-Digital-Technology-&-Engineering-202223-Graduate-Program-%28Canberra%29-ACT/589255110/?utm_source=LINKEDIN&utm_medium=referrer",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3269213141/?refId=e663c944-082a-408c-a0b1-fd0a4c48e55b&trackingId=3DEFNOogT2y0DsESqvmgbg%3D%3D",
    "posted": 1664004830840
  },
  {
    "company": "Wiley Edge",
    "jobTitle": "2022 Graduate Program: Software Development ",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4E0BAQEp_ZR4vmCiKg/company-logo_100_100/0/1653386232697?e=1672272000&v=beta&t=8bSqZAy2Jg0B0vbB2rYwnwiQhbRcSFTucBwrMPUcYpw",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                <p>You’ve worked hard, put the hours in at Uni, so now’s the time to kick-start your tech career with mthree. <strong>We recruit year round</strong> and have start dates throughout 2022.</p><p>Like the idea of working with technology to design and develop complex applications in a dynamic team environment? Want to work with stakeholders across the business to create, test and improve applications that play a fundamental role in an organisation’s daily operations? At mthree, we look to pair talented graduates with leading global businesses and we’re always on the lookout for ambitious people, like you, to join the mthree Alumni Graduate Program. We can provide you with professional, <strong>fully paid, free training</strong> to embark on your career as an mthree Alumni Graduate Software Developer. We offer a generous graduate salary with <strong>pay rises every 6 months</strong> to reflect your progress …. and we open doors to world leading organisations.</p><p><br>\n</p><p><strong>We’d like to hear from you if you have …</strong></p><ul><li>Graduated in last two years or are completing your studies in 2022 (we have rolling start dates throughout the year!)</li><li>A passion for programming and problem solving</li><li>Some practical coding knowledge and experience</li><li>A hunger to learn and upskill</li><li>You will need to be a Australian or NZ Citizen, or a Permanent residency holder, as we are unable to provide visa sponsorship for this position</li></ul><p><strong>We offer training pathways in:</strong></p><p>Full stack engineering (Java)</p><p>Full stack development (C#/.NET)</p><p>Mainframe development using Cobol</p><p>Programming in Q/KDB+</p><p>Software development with C++</p><p><br>\n</p><p><strong>You’ll get:</strong></p><ul><li>In-depth interactive training in small classes with graduates like you. Our training is created and delivered by industry experts who know your field inside out </li><li>A generous graduate salary with pay rises every 6 months to reflect your progress</li><li>Ongoing training and support throughout your placement</li><li>An opportunity to kickstart your career and gain valuable experience in an attractive and exciting industry</li></ul><p><strong>How it works:</strong></p><ol><li>Apply via the mthree website</li><li>Complete the assessments</li><li>Get trained remotely (training is fully paid, free and there are no hidden costs or catches)</li><li>Connect with opportunities at some of the world’s most exciting companies</li></ol><p><br>\n</p><p><strong>Important information on Diversity</strong></p><p>We take great pride in celebrating the diversity of every person who contributes to making mthree the company it is today and will be in the future. We are proud to provide an environment where our colleagues can flourish. We never want people to change - only add to the amazing mix of people that work for mthree.</p>\n<!---->        ",
    "link": "https://edgejobs.wiley.com/en/position/2022-graduate-program-software-development-sydney-nsw-australia-7/?utm_source=linkedin&utm_medium=&utm_campaign=",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3242846539/?refId=f4264e60-2f2f-4924-9712-5ec3cbc708ff&trackingId=t%2B%2F72o6hR9KhJMHVvyR1YQ%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664004848366
  },
  {
    "company": "TechnologyOne",
    "jobTitle": "Graduate Software Developer - 2023",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQEtywexu72Wrw/company-logo_100_100/0/1661116398165?e=1672272000&v=beta&t=vLQB1kzdwSXSN4oJTcTDHsS-V8t6YT4l9ETfRtyrJ98",
    "location": "Fortitude Valley, Queensland, Australia",
    "jobDesc": "\n                At TechnologyOne, we have one mission – transform business and make life simple for our customers. How do we do this? With the help of awesome people like <strong>YOU</strong>.<br>\n<br>\nTo help us accomplish our mission, we need people from all walks of life. We believe a vibrant, diverse and inclusive workforce is the way forward. As an industry leader in diversity, we strive to make TechOne an inclusive place to work for everyone. We run unconscious bias awareness programs, offer career resilience courses, run pay analysis to ensure equitable pay, as well as have several user groups dedicated to promoting diversity, including “Women as One” and “Ally at TechOne”. Philanthropic? TechOne has you covered! The TechOne Foundation is dedicated to lifting 500,000 children out of poverty. We do this with our “1% pledge” – 1% of time, product, and profit. By donating not only 1% of our company profit, but also our software, we are able to make an immediate and lasting impact with organisations around the world. TechnologyOne employees are also gifted 2.5 days each year to use towards volunteering at any of our registered charities.<br>\n<br>\nNo matter how you prefer to do it, TechnologyOne is set up to allow you to make an impact.<br>\n<br>\nWe are looking for a talented Graduate Software Developer to join our TechnologyOne and work within one of our many product teams.<br>\n<br>\nFrom your first day, you will be mentored by team members to grow your skillset and help revolutionise the ERP Software space and create insanely great, market-leading solutions that delight, amaze, and transform our customer’s business.<br>\n<br>\nWe are looking for someone to start <strong>Jan 30 2023.<br>\n<br>\n</strong><strong><u>About You…<br>\n</u></strong><ul><li>Recently Graduated with your Bachelors, Masters, or PhD in a Software related field, on track to graduate by December 2022.</li><li>Experience with .Net framework, .Net Core and C# </li><li>You thrive on solving complex problems and enjoy a new challenge </li><li>A desire to be an impactful Full-Stack Developer <br>\n</li></ul><i>We’re not expecting perfection, we’re looking for potential. If you haven’t ticked off all of the above yet, but want to, we </i><strong><i>strongly</i></strong><i> encourage you to submit your application. We can help you realise your potential.<br>\n<br>\n</i><strong><u>What You’ll Be Doing…<br>\n</u></strong><ul><li>Grow your career and skillset under the guidance of a high-performing, collaborative team </li><li>Developing a deep and ‘hands on’ understanding of the product: its features, functions, design and architecture to develop amazing code </li><li>Performing analysis on business problems to develop smart solutions that make life simple for our customers </li><li>Delivering exceptional bug free software</li><li>Personally using and testing the software as it is being built to ensure it is of the highest quality and insanely great<br>\n</li></ul><strong><u>Benefits…<br>\n</u></strong><ul><li>Amazing events in our office such as Hack Days, celebrating and fundraising for our charitable Foundation, our Marvels and many more! </li><li>Competitive remuneration packages </li><li>Additional 2.5 days of annual leave dedicated to volunteering through our Foundation with some of our wonderful charity partners </li><li>Meaningful initiatives to support your financial, physical and mental wellbeing <br>\n</li></ul><strong><u>More About TechOne…<br>\n<br>\n</u></strong>TechnologyOne (ASX:TNE) is Australia's largest enterprise software company and one of Australia's top 150 ASX-listed companies, with offices across six countries. We create solutions that transform business and make life simple for our customers. We do this by providing powerful, deeply integrated enterprise software that is incredibly easy to use. Over 1,200 leading corporations, government departments and statutory authorities are powered by our software. <br>\n<br>\nWe pride ourselves on providing our people with earned recognition through career progression, competitive salaries and a supportive environment. We double in size approximately every 4-5 years so career opportunities abound. Everything is about to change. Are you ready? <br>\n<br>\nApply Now\n<!---->        ",
    "link": "https://applynow.net.au/jobs/TECH21222504-graduate-software-developer-2023?source=linkedin",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3283215807/?refId=f4264e60-2f2f-4924-9712-5ec3cbc708ff&trackingId=eP6VHxwETUyh0%2BtljxHSIw%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664004863967
  },
  {
    "company": "FDM Group",
    "jobTitle": "AWS Cloud Consultant Graduate Program",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4E0BAQGRSVTWH93-yg/company-logo_100_100/0/1656929650628?e=1672272000&v=beta&t=caqe-33smCGpRn_aRMncsNQq4h8cqspss12-1-yiiiY",
    "location": "Brisbane, Queensland, Australia",
    "jobDesc": "\n                <p><strong>Your career starts here.</strong></p><p>FDM has teamed up with AWS to offer a new training stream to upskill graduates who are looking to jumpstart their career working in Cloud Computing Engineering.</p><p>No prior cloud knowledge is required. The AWS Cloud and IT Fundamentals training will teach you the technical skills you need for an entry-level cloud role. You will have the opportunity to learn through real-world, scenario-based applications, labs and coursework, while also focusing on professional skills such as adaptive communication, time management, resume building, and interviewing to prepare for employer meeting and interviews.</p><p>As an FDM Cloud Computing Engineer Consultant, you will gain invaluable hands-on experience contributing to the digital transformation and enhanced utilisation of the cloud for large organisations. You will have the opportunity to create breakthrough cloud environments, as well as diagnose and fix issues to improve existing cloud-based systems to revolutionise business.</p><p>Upon training completion, you will be placed with one of our major brand clients as an FDM Consultant. A career in Cloud Computing Engineering suits those who are interested in understanding the root cause of a problem and are passionate about learning outside of their current knowledge set.</p><p> </p><p><strong>What will my time at FDM be like?</strong></p><p>When you join the FDM training academy, you will have the opportunity to receive the commercially aligned technical training and qualifications needed to succeed in a career in tech. After successfully completing your training, you will work with one or more of our clients during the two-year program.</p><p>Our award-winning Careers Program allows you to become an expert within your field as you will gain transferable skills and receive full support and mentoring throughout your time with us.</p><p> </p><p> </p><p><strong>What will I offer FDM?</strong></p><ul><li>Passion for learning outside of your current knowledge set as the industry develops</li><li>Excellent communication skills and an ability to build relationships</li><li>Interest in understanding how technology components interrelate to each other and ensure systems are running smoothly</li><li>Logical approach with the ability to break large complex problems down into smaller components</li><li>Ambitious characteristics with a drive to succeed within tech</li><li>Bachelor’s degree or higher, preferably within a STEM discipline but all degrees accepted</li><li>Strong analytical ability</li><li>Good decision-making skills within fast-paced working environments</li><li>Geographical flexibility across Sydney and Melbourne to support our clients</li><li>Commitment to a two-year contract with FDM upon completion of the training period</li></ul><p> </p><p><strong>What will FDM offer me?</strong></p><ul><li>Commercially relevant training</li><li>Access to industry-recognised qualifications</li><li>Development employability skills including Microsoft Excel, CV writing, interview and presentation techniques</li><li>Modern training academies in city centre locations</li><li>Social events and networking opportunities </li><li>A foot in the door to some of the world’s most reputable organisations</li><li>Mentoring and ongoing support throughout your entire FDM journey</li></ul><p></p>\n<!---->        ",
    "link": "https://careers.fdmgroup.com/vacancies/307/australia--aws-cloud-consultant-graduate-program.html?utm_source=linkedin&utm_medium=jobad&utm_campaign=grad_cloud_&utm_content=aus_",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3207868920/?refId=f4264e60-2f2f-4924-9712-5ec3cbc708ff&trackingId=%2Fb%2Fqi3W4SZWQZgJ0Sf2%2FxA%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664004880190
  },
  {
    "company": "Infosys",
    "jobTitle": "Expression of Interest - Graduate Technology Associate",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFT17AbDs0seQ/company-logo_100_100/0/1656660630831?e=1672272000&v=beta&t=o9fugaxHs76yzWtzcsj1vu0XmawggoEYw4hzf4g7VX8",
    "location": "Canberra, Australian Capital Territory, Australia",
    "jobDesc": "\n                <p><strong><u>Expression of Interest – Early 2023 – Graduate – Technology Associate - Canberra</u></strong></p><p><br>\n</p><p>Infosys is a global leader in next-generation digital services and consulting. We enable clients in more than 50 countries to navigate their digital transformation. With over four decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem.</p><p><br>\n</p><p>Visit www.infosys.com to see how Infosys (NYSE: INFY) can help your enterprise navigate your next.</p><p><br>\n</p><p>Roles and Responsibilities:</p><p>As a Technology Associate, you will work on exciting projects with some of the largest companies in the world. You’ll be met with many new opportunities and do more by becoming a part of the Infosys community. We value lifelong learning, creative thinking and foster an entrepreneurial culture. Come amplify your potential and become your very best while helping us co-create the digital and disruptive future of innovation and technology.</p><p><br>\n</p><p>We offer varied pathways in areas like:</p><ul><li>Data Analytics</li><li>Cyber Security</li><li>ERP (such as SAP, Oracle etc)</li><li>Cloud Technologies and Infrastructure Solutions</li><li>Quality Engineering through Testing</li><li>Digital Technologies</li><li>Application Development (such as Business Applications, Mobile Applications, UX/UI etc) and Maintenance</li><li>Artificial Intelligence and Automation and more…</li></ul><p><br>\n</p><p>If your passion is to build solutions that really make a difference to enterprises, the community and your world, Infosys is the right place for you. If you recently completed your graduation or have 0-2 years’ industry experience and are looking for your big career break, then come join us.</p><p><br>\n</p><p>Essential Skills:</p><ul><li>Bachelor’s degree in Science, Technology or Engineering required from an accredited institution (Graduated or near completion)</li><li>Software Development/Programming skills – in any language (Java, Java Script, Python etc)</li><li>Knowledge (through University development projects) in Database structures, data extraction and data manipulation using basic SQL</li></ul><p><br>\n</p><p>Preferred Skills:</p><ul><li>General knowledge about latest technologies including Cloud, Microservices etc</li><li>Project delivery approaches leveraging Agile framework, DevOps (CI/CD – Continuous Integration and Continuous Delivery/Deployment)</li><li>A recent graduate or currently in pursuit of the degree</li><li>The job entails sitting as well as working at a computer for extended periods of time. Should be able to communicate by telephone, email, or face to face. Travel may be required as per the job requirements</li></ul><p><br>\n</p><p>What Infosys can offer you:</p><ul><li>Flexible Working Arrangements</li><li>Advanced, anytime anywhere learning platforms</li><li>Income Protection Insurance</li><li>Health Insurance Benefits</li><li>Employee Assistance Program</li><li>Discounted Corporate Gym Memberships and many more…</li></ul><p><br>\n</p><p>All aspects of employment at Infosys are based on merit, competence and performance. We are committed to embracing diversity and creating an inclusive environment for all employees. Infosys is proud to be an equal opportunity employer.</p><p><br>\n</p><p>At Infosys, we recognize that everyone has individual requirements. If you are a person with disability, illness or injury and require adjustments to the recruitment and selection process, please contact our Recruitment team for adjustment only on Infosys_ta@infosys.com or include your preferred method of communication in email and someone will be in touch.</p>\n<!---->        ",
    "link": "https://digitalcareers.infosys.com/global-careers/company-job/description/reqid/97955BR",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3263004637/?refId=f4264e60-2f2f-4924-9712-5ec3cbc708ff&trackingId=mMB8HYxdStO76zf5FI7VYQ%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664004929039
  },
  {
    "company": "Infosys",
    "jobTitle": "Expression of Interest - Graduate Technology Associate",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFT17AbDs0seQ/company-logo_100_100/0/1656660630831?e=1672272000&v=beta&t=o9fugaxHs76yzWtzcsj1vu0XmawggoEYw4hzf4g7VX8",
    "location": "Perth, Western Australia, Australia",
    "jobDesc": "\n                <p><strong><u>Expression of Interest – Early 2023 – Graduate – Technology Associate - Perth</u></strong></p><p><br>\n</p><p>Infosys is a global leader in next-generation digital services and consulting. We enable clients in more than 50 countries to navigate their digital transformation. With over four decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem.</p><p><br>\n</p><p>Visit www.infosys.com to see how Infosys (NYSE: INFY) can help your enterprise navigate your next.</p><p><br>\n</p><p>Roles and Responsibilities:</p><p>As a Technology Associate, you will work on exciting projects with some of the largest companies in the world. You’ll be met with many new opportunities and do more by becoming a part of the Infosys community. We value lifelong learning, creative thinking and foster an entrepreneurial culture. Come amplify your potential and become your very best while helping us co-create the digital and disruptive future of innovation and technology.</p><p><br>\n</p><p>We offer varied pathways in areas like:</p><ul><li>Data Analytics</li><li>Cyber Security</li><li>ERP (such as SAP, Oracle etc)</li><li>Cloud Technologies and Infrastructure Solutions</li><li>Quality Engineering through Testing</li><li>Digital Technologies</li><li>Application Development (such as Business Applications, Mobile Applications, UX/UI etc) and Maintenance</li><li>Artificial Intelligence and Automation and more…</li></ul><p><br>\n</p><p>If your passion is to build solutions that really make a difference to enterprises, the community and your world, Infosys is the right place for you. If you recently completed your graduation or have 0-2 years’ industry experience and are looking for your big career break, then come join us.</p><p><br>\n</p><p>Essential Skills:</p><ul><li>Bachelor’s degree in Science, Technology or Engineering required from an accredited institution (Graduated or near completion)</li><li>Software Development/Programming skills – in any language (Java, Java Script, Python etc)</li><li>Knowledge (through University development projects) in Database structures, data extraction and data manipulation using basic SQL</li></ul><p><br>\n</p><p>Preferred Skills:</p><ul><li>General knowledge about latest technologies including Cloud, Microservices etc</li><li>Project delivery approaches leveraging Agile framework, DevOps (CI/CD – Continuous Integration and Continuous Delivery/Deployment)</li><li>A recent graduate or currently in pursuit of the degree</li><li>The job entails sitting as well as working at a computer for extended periods of time. Should be able to communicate by telephone, email, or face to face. Travel may be required as per the job requirements</li></ul><p><br>\n</p><p>What Infosys can offer you:</p><ul><li>Flexible Working Arrangements</li><li>Advanced, anytime anywhere learning platforms</li><li>Income Protection Insurance</li><li>Health Insurance Benefits</li><li>Employee Assistance Program</li><li>Discounted Corporate Gym Memberships and many more…</li></ul><p><br>\n</p><p>All aspects of employment at Infosys are based on merit, competence and performance. We are committed to embracing diversity and creating an inclusive environment for all employees. Infosys is proud to be an equal opportunity employer.</p><p><br>\n</p><p>At Infosys, we recognize that everyone has individual requirements. If you are a person with disability, illness or injury and require adjustments to the recruitment and selection process, please contact our Recruitment team for adjustment only on Infosys_ta@infosys.com or include your preferred method of communication in email and someone will be in touch.</p>\n<!---->        ",
    "link": "https://digitalcareers.infosys.com/global-careers/company-job/description/reqid/98426BR",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3263003809/?refId=f4264e60-2f2f-4924-9712-5ec3cbc708ff&trackingId=y1fWjX%2B6T6WNFea04DU0JA%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664004960165
  },
  {
    "company": "PageUp",
    "jobTitle": "Graduate Software Developer",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQFwu9fFJ5VN_A/company-logo_100_100/0/1620712499782?e=1672272000&v=beta&t=Xpb6HhQ2n10MyAvEkfh05R8HN6XDIQOP-h78aRk-HNM",
    "location": "Melbourne, Victoria, Australia",
    "jobDesc": "\n                <p>Love the idea of heavy lifting with code? What about experimenting with novel ways of delivering quality software to customers? Perfect, because we are splitting our customer-loved monolithic .NET app into event-sourced microservices and continuously-delivered single-page applications.<br>\n<br>\n</p><br>\n<strong>The Position:</strong>As a graduate software engineer commencing Feb 2023, you will help with the maintenance of our existing .net code-base, but also, and more importantly, help with building new features on top of our new multi-platform, multi-language tech stack. In our cross-functional, empowered agile teams, every member of the team gets to be involved in every part of the software lifecycle - including interaction testing with our users, developing, deploying and measuring the success of their software as our customers are using it.We are using some of the most cutting-edge technologies and practices that you'll ever find in a software dev team in Australia; highlights include:<ul><li>Multiple languages, including C#, F# and JavaScript</li><li>Frameworks such as ASP .NET 5, AngularJS, NodeJS</li><li>Cloud Service Providers such as Amazon Web Services, Azure</li><li>Advanced practices such as Continuous Delivery (CD), Domain Driven Design (DDD), Behaviour Driven Development (BDD)</li><li>Advanced architectures such as Event Sourcing, CQRS, Zero-downtime and Blue/Green Deployments</li><li>Contribute to Open Source as part of your day job</li></ul><strong>Who are we?</strong>PageUp is a leading global SaaS provider offering a highly customisable end-to-end talent management solution designed to help businesses attract, recruit, onboard, develop and retain the best talent and deliver the best possible hiring experience. From humble beginnings in Melbourne, we are now proud to have homes in Sydney, the USA, UK, Singapore, Manila, and Dublin. Our platform is used by 5.3 million customer-employee users in over 190 countries and our exciting growth journey continues as we build our global brand. Our culture fosters growth, learning and professional development, and you’ll receive a personal development program when you join our professional services team as a PageUp graduate. Join us on our journey! <strong>Equal Opportunity at PageUp</strong>We know that in many cases individuals from underrepresented groups will not apply for jobs when they don’t meet all criteria, we don’t want this to be the case in our team. If you think you have what it takes but don't necessarily tick every single bullet point on the job description, please still apply and give it a try. We'd love to have a chat and see if you could be our newest member. <strong>So what makes us stand out?</strong>PageUp is a 2021 Best Place to Work on the AFR list, recognised for our practices and achievements in community building, flexibility, communication, and transparency during the COVID-19 pandemic and beyond. This recognition highlights the strong culture we've built at PageUp and reflects our tireless efforts and commitment to create community, trust, and flexibility within our culture.Oh, and our customers love PageUp for its deep, customisable functionality for a range of workflows and industries, all accompanied by outstanding customer service. <strong>And, of course, the perks.</strong>Our benefits provide something for everyone! Flexible working; an extra day of leave to do something awesome (no really - it's called Awesome Day); generous paid parental leave for primary and secondary carers; health benefits; a wellbeing allowance; employee assistance program; volunteer leave and more.Our global presence also means those with a little wanderlust have the opportunity to take their career to new places. Pardon the pun.<p> <br>\n<br>\n</p> \n<!---->        ",
    "link": "https://secure.dc3.pageuppeople.com/apply/311/cw/applicationForm/initApplication.asp?lJobID=422701&sLanguage=en&sSourcePointer=cw&lJobSourceTypeID=661",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3266336350/?refId=8a68e483-12f8-4e8b-b9d3-d1a315c16aa6&trackingId=E0VyKzVJSVeeZwenTs9FNg%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664004977692
  },
  {
    "company": "Hatch",
    "jobTitle": "2023 Graduate Engineer - Digital (Perth)",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQFt6pR7WYBzsw/company-logo_100_100/0/1657309182950?e=1672272000&v=beta&t=YM0nkPuxRLDhaK7XUF58FySLYrDiwZnEfOqh_2NfXYA",
    "location": "Perth, Western Australia, Australia",
    "jobDesc": "\n                <strong>Requisition ID: </strong>63601<br>\n<br>\n<strong>Job Category: </strong>Campus<br>\n<br>\n<strong>Location: </strong>Perth, Western Australia, Australia<br>\n<br>\nWith over six decades of business and technical experience in the mining , energy , and infrastructure sectors, we see challenges evolving in every industry. We respond quickly with solutions that are smarter, more efficient, and innovative. We draw upon our 9,000 staff , with experience in over 150 countries , to challenge the status quo and create positive change for our clients, our employees, and the communities we serve.<br>\n<br>\nWe're at the forefront of our clients' digital transformation journey , successfully implementing emerging digital services into our clients' projects and operations that unlock a step change in their performance. Join the team to improve project outcomes, leverage the digital twin , deliver systems integration and interoperability, and support decision-making, autonomous execution , and integrated operations and performance centers.<br>\n<br>\n<strong>Graduate opportunity: Build the extraordinary, every day! <br>\n<br>\n</strong>Looking to take the next step in your career? Hatch are currently seeking a highly motivated Graduate Engineer to join the Digital Group in Perth!<br>\n<br>\n<strong><u>As The Successful Candidate, You Will<br>\n</u></strong><ul><li> Work in a tight-knit and high-performing team with a flexible, friendly and casual culture. </li><li> Gain well-rounded business, operations and technical engineering experience that is supported by knowledgeable and passionate team members. </li><li> Have the opportunity to develop your passion through regular two-way feedback and mentoring to drive your career direction towards the work you enjoy the most. </li><li> Collaborate closely with our client partners to create advanced automation solutions with a focus on production, including potential opportunities to commission on-site. Primarily working on integrated control automation within existing bulk material handling and autonomous dredge sands mining operations. </li><li> Develop software solutions across a wide range of platforms in the Operational Technology and Information Technology layers, including; Industrial controller systems, HMI systems, server applications, database centric software, web user interface development and cloud (e.g. Allen-Bradley PLC’s, Citect HMI, Microsoft SQL, .Net Framework C#, JavaScript / React, Azure). </li><li> Be involved in projects that span the full solution lifecycle and see your creations come to life i.e. from synthesis of new ideas to ongoing offsite support. <br>\n</li></ul><strong><u>You Bring To The Role<br>\n<br>\n</u></strong>You will have (or be working towards) a bachelor’s degree in Engineering (Electrical, Mechatronics, Software or similar) with a solid academic record. Interested in applying control-based software programming to real-world physical environments. Successful candidates will also have excellent interpersonal skills and strong passion for working closely in a team environment to solve complex problems.<br>\n<br>\n<strong>Our Professional Development Program<br>\n<br>\n</strong>As a graduate with Hatch you will build professional relationships with renowned experts, and champion great initiatives for reputable, well-known clients. You will belong to a company that fosters career growth, encourages continuous improvement and is pioneering in nature.<br>\n<br>\n<strong><u>You Will Have Opportunities To<br>\n</u></strong><ul><li> Collaborate with multi-disciplinary teams to complete project deliverables for clients </li><li> Develop mentoring relationships with experienced professionals and experts </li><li> Achieve Professional Chartership and individual career goals </li><li> Work in a flexible framework and environment </li><li> Attend networking events, opportunities and activities </li><li> Continuously learn and develop through a variety of challenging work experiences and career pathways </li><li> Work with one of Australia’s Top Graduate Employers <br>\n</li></ul>If you are passionate about working in a global, inclusive and collaborative team to provide innovative and sustainable solutions for our clients and the communities we serve, we want to hear from you!<br>\n<br>\n<strong>Why join us?<br>\n</strong><ul><li> Work with great people to make a difference </li><li> Collaborate on exciting projects to develop innovative solutions </li><li> Top employer <br>\n</li></ul><strong>What we offer you?<br>\n</strong><ul><li> Flexible work environment </li><li> Long term career development </li><li> Think globally, work locally <br>\n</li></ul>As an accredited Employer of Choice for Gender Equality (WGEA) and Equal Opportunity Employer, we are committed to fostering a workforce in each of our locations that reflects the diversity of the communities in which we operate. Within Australia, this includes supporting and encouraging a flexible workplace and a comprehensive benefit offering. If you have any special needs requirements, please discuss with us and we will do our utmost to accommodate your request.\n<!---->        ",
    "link": "https://jobs.hatch.com/job/Australia-Plains-2023-Graduate-Engineer-Digital-%28Perth%29-West/891649100/?utm_source=LINKEDIN&utm_medium=referrer",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3100949186/?refId=8a68e483-12f8-4e8b-b9d3-d1a315c16aa6&trackingId=nIc%2Bo7LLRamD2XPuKBl1mQ%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664004993535
  },
  {
    "company": "FDM Group",
    "jobTitle": "Software Development Graduate Program",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4E0BAQGRSVTWH93-yg/company-logo_100_100/0/1656929650628?e=1672272000&v=beta&t=caqe-33smCGpRn_aRMncsNQq4h8cqspss12-1-yiiiY",
    "location": "New South Wales, Australia",
    "jobDesc": "\n                <p>If you have a passion for tech, a detail-oriented mind and you thrive in a fast-paced team environment, the FDM Graduate Career Program can help kickstart your dream career. Our long relationships with top-tier client partners allows a foot in the door that can be out of reach to many graduates, giving you the opportunity to add big brands on your CV.</p><p><br>\n</p><p>FDM is a FTSE 250 employer operating across Asia-Pacific, the UK, mainland Europe and North America. Over a 30+ year history, FDM Group has won many awards. In 2022 FDM has risen 5 places to #16 on the GradConnection Top 100 Graduate Employers and is again one of GradAustralia's Top 100 Graduate Employers.</p><p><br>\n</p><p>FDM is a company committed to diversity and inclusion, we celebrate difference because we want everyone to have equal opportunity to belong and grow in their career. We are active in creating a more gender-balanced workforce, with circa 33% of our senior management team and 31% of all employees identifying as female.</p><p><br>\n</p><p>In 2021 alone, we launched the careers of over 2,600 graduates globally. And we provide a wide range of opportunities for our consultants to work in technical roles alongside some of the world’s biggest brands including KPMG Australia, HSBC and Macquarie.</p><p><strong> </strong></p><p><br>\n</p><p><strong>A career where you are encouraged to meet your potential</strong></p><p>We are currently seeking candidates interested in building a career within <strong>Software Development </strong>– all degrees welcome.</p><p><br>\n</p><p>As the key creative, brainstorming masterminds behind all computer applications, software developers design, write, install, and test software systems that they have built for a company.</p><p>This is an incredibly varied role for innovators and collaborators which involves understanding user needs, developing solutions that will solve a problem, provide entertainment or simply make life easier for its intended audience.</p><p><br>\n</p><p>FDM’s program will give you highly sought-after skill sets and experience in a technical role that requires high levels of expertise, opening a number of exciting career progression opportunities from Web Developer to Cloud Engineer and much more.</p><p><br>\n</p><p><br>\n</p><p><strong>What will my time at FDM be like?</strong></p><p>Your journey will begin with training out of FDM’s award-winning academy. Like all interviews and assessments, this is done remotely in response to Covid-19, to ensure the safety of our community.</p><p>You will receive the chance to gain industry recognised qualifications, as well as mentoring and support throughout. After successfully completing your training, you’ll have the technical and professional skills you need to step into an integral position with one or more of our industry-leading, multinational clients in Australia during the two-year program.</p><p><br>\n</p><p><br>\n</p><p><strong>What will I offer FDM?</strong></p><ul><li>Bachelor’s degree or higher, STEM major not required</li><li><strong>An analytical, problem-solving mindset</strong></li><li><strong>Excellent communication skills and eagerness to build relationships</strong></li><li><strong>Passion to work within the IT industry &amp; the ambition to succeed</strong></li><li><strong>Ability to commit to completing our full 2.5-year graduate program – whether eligible under a single visa or as an Australian citizen/permanent resident</strong></li><li>Geographic flexibility throughout Sydney and Melbourne to support our top-tier clients</li></ul><p><br>\n</p><p><br>\n</p><p><strong>What will FDM offer me?</strong></p><ul><li>Fully-funded, industry-recognised training and qualifications</li><li>Key employability skills development - including Microsoft Excel, CV writing, interview and presentation techniques</li><li>Mentoring and ongoing support throughout your entire FDM journey</li><li>Social events and networking opportunities</li><li>A foot in the door to some of the world’s most reputable organisations</li><li>Social events and networking opportunities</li></ul><p><i> </i></p><p><br>\n</p><p><strong>Give yourself a head start – seize this opportunity </strong></p><p>The industry demand for tech talent is so hot, there has never been a better time to launch an exciting IT career. Remember, you don’t need to have studied a STEM subject, what matters is your passion and drive.</p><p><br>\n</p><p>Our next round of courses is about to take off, so make your application now and give yourself the competitive advantage. The FDM Recruitment team will take you through the process and guide you to the path of your successful tech career.</p><p>The world is at your fingertips, the possibilities are unlimited - all you have to do is click apply.</p><p><i> </i></p><p><br>\n</p><p><i>FDM embraces diversity and encourages applications from people with disability. Candidates will have the opportunity to request support or reasonable adjustments during the recruitment process in order to demonstrate their ability to meet the inherent requirements of the job.</i></p>\n<!---->        ",
    "link": "https://careers.fdmgroup.com/vacancies/217/australia--software-development-consultant.html",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3247168231/?refId=8a68e483-12f8-4e8b-b9d3-d1a315c16aa6&trackingId=yb2WMZ%2FkSFGWpM0oJcuuqA%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664005009628
  },
  {
    "company": "Objective Corporation",
    "jobTitle": "Junior Test Engineer",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQF7whw6w5LRHA/company-logo_100_100/0/1520807781753?e=1672272000&v=beta&t=C1tuWp_OXaMP5QqwI3k9-6-cXhv4iuRfIyqEtHKGgFo",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                <p><strong>A bit about us</strong></p><p><br>\n</p><p>At Objective, our technology brings efficiency to all tiers of government and financial services organisations to operate more effectively and transparently. Here you will be challenged and supported to do your life's best work. We also set aside time for you to work on concepts that fall outside the scope of your day job through company initiatives like ‘Innovation Fridays’ and our twice-yearly Hackathons.</p><p><br>\n</p><p><strong> </strong></p><p><strong>The opportunity</strong></p><p><br>\n</p><p>We’re looking for a Junior Test Analyst to join Objective ECM – our flagship product that Objective was built on. Our purpose is to imagine, define and deliver next-generation software to solve tomorrow’s challenges for our customers today. Our product team is made up of tenacious software developers, testers and we need your testing skills to help craft the next part of ECM. </p><p><br>\n</p><p>On a daily basis, we are busy ensuring our products solve our customers’ immediate problems. But what we really strive for is to build solutions for future customer needs: essentially providing answers to problems they didn’t even know they had yet.</p><p><br>\n</p><p><br>\n</p><p><strong>What you will be doing:</strong></p><p><br>\n</p><ul><li>Create test cases that will identify issues before the release of the product.</li><li>Execute exploratory testing, highlighting and reporting defects and owning them until resolution is complete.</li><li>Produce and deliver testing related documentation including test completion and defect reports.</li><li>Collaborate closely in a SCRUM based development environment to resolve issues and ultimately produce quality software for our customers.</li></ul><p><br>\n</p><p><br>\n</p><p><strong>We’re looking for someone who has:</strong></p><p><br>\n</p><ul><li>Test automation experience</li><li>Java, JavaScript or C++ experience</li><li>Database/ RDBMS experience</li><li>Knowledge of JIRA</li><li>A degree qualification in Computer Science, or similar.</li><li>Enthusiastic and have a can-do attitude</li><li>Display a readiness to take ownership of distinct areas of testing</li><li>Presents self positively and communicates assertively</li></ul><p><br>\n</p><p><br>\n</p><p>This role is based in our North Sydney office, Objective HQ. We occupy the top floor of a North Sydney skyscraper with 360-degree views of the city, and you’ll get to work and laugh alongside a friendly and diverse bunch of people in our beautifully appointed open-plan office.</p>\n<!---->        ",
    "link": "https://jobs.lever.co/objective/52627899-26d2-428c-bf8e-ae669c8dc04f?lever-origin=applied&lever-source%5B%5D=linkedin&lever-source=LinkedInJobs",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3251343491/?refId=8a68e483-12f8-4e8b-b9d3-d1a315c16aa6&trackingId=xWeHzqqnSbuMxo8E%2FudTQw%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664005059585
  },
  {
    "company": "GQR Global Markets",
    "jobTitle": "Graduate to Junior C#/C++ Developers- High Frequency Trading Company",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4E0BAQFBH1PZsqLfkQ/company-logo_100_100/0/1519903757515?e=1672272000&v=beta&t=2TQBZFXKsJItdSD3SLvf52Fag0bkdvbfJCuxwN1W9Ko",
    "location": "Homebush, New South Wales, Australia",
    "jobDesc": "\n                <p>You will be working with a global trading business who are well established and also rapidly expanding. Software developers are integral to the success of the business. We are looking for Junior Developers with sharp minds who are seeking out their next challenge. We need engineers who are always looking for a new edge to dig deeply into the trading problem and can craft an outstanding suite of high performing, high-reliability systems and applications. </p><p><strong><br>\n</strong> </p><p><strong>What is offered:</strong> </p><ul><li>Access to work on a world-class trading system that has generated outstanding profits in recent years. </li><li>Rapid deployment and immediate feedback on your work in production, your software can have a major impact on business results </li><li>Autonomy and responsibility when it comes to your workload </li><li>A tailored training program to your needs with extensive training and education about trading options and futures. </li><li>Work directly with Traders who have a deep respect for technology. </li><li>Work with the latest server and networking equipment. </li></ul><p><strong>Essential skills include:</strong> </p><ul><li>1-4 years experience in a software development role, working in finance or a tech firm would be a plus but not a requirement. </li><li>Proven ability to deliver scalable, reliable, high-quality code. </li><li>Test-driven and data-driven design and development experience. </li><li>Experience executing on projects from end to end. </li><li>A passion for modern technology and enthusiasm to learn is highly regarded. </li><li>An interest in or any experience with low-latency optimisation, networking or real-time systems will set you apart from other applicants. </li><li>Academic transcript and out of classroom projects or extra-curricular activities to highlight this. </li></ul><p><i><br>\n</i> </p><p><i>While a resume is preferable we also welcome tentative inquiries from well-qualified persons. Utmost confidentiality and discretion are assured. If interested, please email Lucas.dubyk@gqrgm.com for more information. </i></p>\n<!---->        ",
    "link": "https://www.linkedin.com/jobs/view/3211676297/?refId=8a68e483-12f8-4e8b-b9d3-d1a315c16aa6&trackingId=%2FpNfCrTBSbSgYDHBVA%2B1lg%3D%3D&trk=flagship3_job_home_savedjobs",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3211676297/?refId=8a68e483-12f8-4e8b-b9d3-d1a315c16aa6&trackingId=%2FpNfCrTBSbSgYDHBVA%2B1lg%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664005071350
  },
  {
    "company": "Amadeus",
    "jobTitle": "Software Development Engineer - Graduate",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4E0BAQHUTgVyhSmNlw/company-logo_100_100/0/1519856217187?e=1672272000&v=beta&t=iJD8c3fL1FH9YR2arAVIeT2iAXR9CRBKyLCZNR9CIQQ",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                <p></p><p><strong><u>PURPOSE OF THE ROLE</u></strong></p><p><br>\n</p><p>The team is in charge of developing and maintaining the Service Integrator (SI): Amadeus Enterprise Service Bus. </p><p><br>\n</p><p>The SI is the single entry point to Amadeus applications. Its distributed architecture enables high throughput, scalability, and availability. It routes traffic to thousands of applications servers and processes at peak over 1 000 000 transactions per second without downtime.</p><p><br>\n</p><p>It connects customers to applications of all Amadeus business areas and external providers. Amadeus business areas include Distribution, Hotel IT, Airline IT, including Mission Critical applications such as the Departure Control System. External providers include Airlines, Global distribution systems, Online travel agencies, Insurance providers.</p><p><br>\n</p><p>To achieve that, it supports a wide range of protocols, from industry standards Edifact services to REST/JSON APIs and provides protocol adaptation, applicative service routing, session and security management. It plays a key role in Amadeus Cloud Strategy to migrate all workloads to Microsoft Azure using Kubernetes.</p><p><br>\n</p><p>The team works in close collaboration with other development centers mainly in Europe to design and implement new features. Amadeus leading presence in Asia and the component criticality make Sydney team a key asset for projects managed locally and expert support on urgent issues.</p><p><br>\n</p><p>As a software development engineer, you will be working mainly using modern C++ on the SI codebase, as well as Golang for its Kubernetes operator and Python for the testing framework and tooling. You will be involved in the full Software Development Life Cycle: support of business analysts, technical design, development, testing, implementation, and support. </p><p><br>\n</p><p><strong>The main challenges ahead of us are:</strong></p><p>• Build the communication infrastructure to migrate from a private datacenter to a multi-datacenter architecture in public cloud.</p><p>• Maintain an excellent stability and resiliency: mission critical services cannot fail</p><p>• Ensure compliance with latest security standards (PCI-DSS)</p><p>• Extend the product portfolio with new protocols and features</p><p>• Keep Enhancing the application operability with tooling from Continuous Integration to Monitoring </p><p> </p><p><strong>Main Responsibilities:</strong></p><ul><li>Produce code, problem investigations, support or testing within agreed standards and timescales.</li><li>Write all operational and software documentation necessary for the application from a technical standpoint.</li><li>Conduct analysis and contribute to joint product design efforts.</li><li>Support the other teams involved in the SDLC: Business Analyst, Testers.</li><li>Contribute to SDLC tooling: Continuous integration, testing framework, deloplyment and monitoring.</li><li>Demonstrate initiative in contributing to problem solving, design solutions and team goals.</li><li>Confident in technical skills and demonstrates substantial independence in the technical area.</li><li>Conduct unit and package tests of the software to ensure a level of quality in line with the Amadeus guidelines.</li><li>Take responsibility for a component of a project or a small project.</li><li>Troubleshooting and 3rd level support, working together with Operations team and customer service teams.</li><li>Work cooperatively to achieve team goals making constructive suggestions to move things forward.</li><li>Build stable and useful working relationships with others outside the immediate area of work.</li><li>Provide trainings to other teams.</li><li>Proactively report progress and highlight/escalate issues and problems as necessary.</li><li>Coordinate a Change Request between several impacted developers, either with local or remote teams (Nice, Bangalore, etc.)</li><li>Provide sizing for small and medium developments.</li><li>Monitor and control costs related to own work.</li><li>Record time accurately.</li><li>Develop ability to solve complex problems.</li><li>Demonstrate competence in own area, completing own role independently or with minimal supervision / guidance.</li><li>Continued development of technical capability.</li></ul><p><br>\n</p><p><strong>Relevant Work Experience:</strong></p><p> </p><ul><li>Significant first experience of C++ programming in a multi-threaded environment.</li><li>Network programming and general distributed systems knowledge are a real plus </li><li>Problem solving, investigation skills, distributed systems, multi-threaded programming </li><li>Modern C++ (required), Golang (optional), Python (optional) </li><li>Software development and troubleshooting on GNU/Linux </li><li>Technology enthusiast, Optional: network programming</li></ul>\n<!---->        ",
    "link": "https://amadeus.wd3.myworkdayjobs.com/jobs/job/Sydney-New-South-Wales/Software-Development-Engineer_R3226?source=Linkedin",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3266938327/?refId=8a68e483-12f8-4e8b-b9d3-d1a315c16aa6&trackingId=kdeG1K2MR2%2B7H51tRN9c1g%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664005089271
  },
  {
    "company": "Cobblestone Energy",
    "jobTitle": "GRADUATE SOFTWARE ENGINEER - Dubai, UAE",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQF4PBrf9BZgVg/company-logo_100_100/0/1622142239115?e=1672272000&v=beta&t=8ghULvEavlZSHdmb1nzbBOhFSb4vUzh42PtHUmQPjIQ",
    "location": "Melbourne, Victoria, Australia",
    "jobDesc": "\n                Starting salary of <strong>55</strong><strong>,000 USD per annum</strong> in a zero-tax environment.<br>\n<br>\nFast progression for strong performers.<br>\n<br>\n<strong>Job location: </strong>Dubai, UAE<br>\n<br>\n<strong>About us:<br>\n<br>\n</strong>Cobblestone Energy is a proprietary trading firm that specializes in the wholesale electricity market across Europe. Electricity is fundamental to the world's economic activities. We trade enough electricity every day to power a small country, and in doing so, we help to address the mismatch between electricity generation and consumption.<br>\n<br>\n<strong>Job Description<br>\n<br>\n</strong>At Cobblestone Energy we are on a mission to build the most advanced European electricity trading and analytics platform, with our technology being used by our teams of commercial traders to create significant value. We are looking for enthusiastic and resourceful developers who are passionate about building exceptionally reliable and performance data processing solutions. You want to help the commercial team make data-informed decisions, have a curious mindset, and are motivated to understand our business better. Developing a strong domain knowledge of our industry over time is key to long term success in this role.<br>\n<br>\nIf you have excellent programming skills, strong problem-solving skills, and a passion for developing and improving applications utilizing cutting edge technologies, then we would like to meet you.<br>\n<br>\n<strong>What We Offer In This Role<br>\n</strong><ul><li>Competitive remuneration, with fast progression for strong performers. </li><li>A challenging but exciting, open, and fun work environment. </li><li>An opportunity to work with remarkably talented colleagues. </li><li>Vast growth potential in every aspect. </li><li>15% target bonus with further upside. </li><li>Employee share scheme participation </li><li>International relocation support </li><li>Opportunity to be embedded within a commercial team for those with strong commercial interest <br>\n<br>\n</li></ul><strong>Responsibilities<br>\n</strong><ul><li>Write software applications and programs for backend/frontend purposes. </li><li>Analyse programs and apps to improve their features and functionalities. </li><li>Test &amp; debug programs and fix any reported bugs. </li><li>Collaborate with the tech team to improve the performance, efficiency, and scalability of our tools. <br>\n<br>\n</li></ul><strong>Requirements<br>\n</strong><ul><li>BS/BE in Computer Science/Computer Engineering/Electrical &amp; Computer Eng. </li><li>Programming skills in Python language. </li><li>Knowledge of at least one popular Python framework (like Django, Flask ...) is a plus. </li><li>Programming skills in Java is a plus. </li><li>Familiarity &amp; Knowledge in front-end technologies such as HTML5, CSS, JQuery, JS, etc. </li><li>Strong knowledge of REST APIs and webservices. </li><li>Strong knowledge of Relational Databases (MySQL, PostgreSQL, SQL Server ...) and SQL language. </li><li>Knowledge of NoSQL databases is a plus. </li><li>Knowledge of AWS is a plus / Knowledge of data visualization tools, mainly Tableau, is a plus. </li><li>Ability to work in a team environment. </li><li>Strong problem-solving skills and analytical skills. </li><li>Resilience and a determination to succeed. </li><li>Independent thinkers with growth mindset. </li><li>Must be passionate, self-motivated, and able to learn quickly. </li><li>Strong sense of integrity. </li><li>Personal values that match our company values.</li></ul>\n<!---->        ",
    "link": "https://boards.greenhouse.io/cobblestoneenergy4/jobs/5241022003?gh_src=a9fd40593us",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3282009904/?refId=81898214-8fac-4b2a-be4f-800eb98bcf98&trackingId=SwAjwwOET0anELIjmp37EQ%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664005105977
  },
  {
    "company": "Cobblestone Energy",
    "jobTitle": "GRADUATE SOFTWARE ENGINEER - Dubai, UAE",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQF4PBrf9BZgVg/company-logo_100_100/0/1622142239115?e=1672272000&v=beta&t=8ghULvEavlZSHdmb1nzbBOhFSb4vUzh42PtHUmQPjIQ",
    "location": "Adelaide, South Australia, Australia",
    "jobDesc": "\n                Starting salary of <strong>55</strong><strong>,000 USD per annum</strong> in a zero-tax environment.<br>\n<br>\nFast progression for strong performers.<br>\n<br>\n<strong>Job location: </strong>Dubai, UAE<br>\n<br>\n<strong>About us:<br>\n<br>\n</strong>Cobblestone Energy is a proprietary trading firm that specializes in the wholesale electricity market across Europe. Electricity is fundamental to the world's economic activities. We trade enough electricity every day to power a small country, and in doing so, we help to address the mismatch between electricity generation and consumption.<br>\n<br>\n<strong>Job Description<br>\n<br>\n</strong>At Cobblestone Energy we are on a mission to build the most advanced European electricity trading and analytics platform, with our technology being used by our teams of commercial traders to create significant value. We are looking for enthusiastic and resourceful developers who are passionate about building exceptionally reliable and performance data processing solutions. You want to help the commercial team make data-informed decisions, have a curious mindset, and are motivated to understand our business better. Developing a strong domain knowledge of our industry over time is key to long term success in this role.<br>\n<br>\nIf you have excellent programming skills, strong problem-solving skills, and a passion for developing and improving applications utilizing cutting edge technologies, then we would like to meet you.<br>\n<br>\n<strong>What We Offer In This Role<br>\n</strong><ul><li>Competitive remuneration, with fast progression for strong performers. </li><li>A challenging but exciting, open, and fun work environment. </li><li>An opportunity to work with remarkably talented colleagues. </li><li>Vast growth potential in every aspect. </li><li>15% target bonus with further upside. </li><li>Employee share scheme participation </li><li>International relocation support </li><li>Opportunity to be embedded within a commercial team for those with strong commercial interest <br>\n<br>\n</li></ul><strong>Responsibilities<br>\n</strong><ul><li>Write software applications and programs for backend/frontend purposes. </li><li>Analyse programs and apps to improve their features and functionalities. </li><li>Test &amp; debug programs and fix any reported bugs. </li><li>Collaborate with the tech team to improve the performance, efficiency, and scalability of our tools. <br>\n<br>\n</li></ul><strong>Requirements<br>\n</strong><ul><li>BS/BE in Computer Science/Computer Engineering/Electrical &amp; Computer Eng. </li><li>Programming skills in Python language. </li><li>Knowledge of at least one popular Python framework (like Django, Flask ...) is a plus. </li><li>Programming skills in Java is a plus. </li><li>Familiarity &amp; Knowledge in front-end technologies such as HTML5, CSS, JQuery, JS, etc. </li><li>Strong knowledge of REST APIs and webservices. </li><li>Strong knowledge of Relational Databases (MySQL, PostgreSQL, SQL Server ...) and SQL language. </li><li>Knowledge of NoSQL databases is a plus. </li><li>Knowledge of AWS is a plus / Knowledge of data visualization tools, mainly Tableau, is a plus. </li><li>Ability to work in a team environment. </li><li>Strong problem-solving skills and analytical skills. </li><li>Resilience and a determination to succeed. </li><li>Independent thinkers with growth mindset. </li><li>Must be passionate, self-motivated, and able to learn quickly. </li><li>Strong sense of integrity. </li><li>Personal values that match our company values.</li></ul>\n<!---->        ",
    "link": "https://boards.greenhouse.io/cobblestoneenergy4/jobs/5241025003?gh_src=632296bd3us",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3282010807/?refId=81898214-8fac-4b2a-be4f-800eb98bcf98&trackingId=KsjhwlHWTNaN17WM2tMIag%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664005122698
  },
  {
    "company": "Cobblestone Energy",
    "jobTitle": "GRADUATE SOFTWARE ENGINEER - Dubai, UAE",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQF4PBrf9BZgVg/company-logo_100_100/0/1622142239115?e=1672272000&v=beta&t=8ghULvEavlZSHdmb1nzbBOhFSb4vUzh42PtHUmQPjIQ",
    "location": "Perth, Western Australia, Australia",
    "jobDesc": "\n                Starting salary of <strong>55</strong><strong>,000 USD per annum</strong> in a zero-tax environment.<br>\n<br>\nFast progression for strong performers.<br>\n<br>\n<strong>Job location: </strong>Dubai, UAE<br>\n<br>\n<strong>About us:<br>\n<br>\n</strong>Cobblestone Energy is a proprietary trading firm that specializes in the wholesale electricity market across Europe. Electricity is fundamental to the world's economic activities. We trade enough electricity every day to power a small country, and in doing so, we help to address the mismatch between electricity generation and consumption.<br>\n<br>\n<strong>Job Description<br>\n<br>\n</strong>At Cobblestone Energy we are on a mission to build the most advanced European electricity trading and analytics platform, with our technology being used by our teams of commercial traders to create significant value. We are looking for enthusiastic and resourceful developers who are passionate about building exceptionally reliable and performance data processing solutions. You want to help the commercial team make data-informed decisions, have a curious mindset, and are motivated to understand our business better. Developing a strong domain knowledge of our industry over time is key to long term success in this role.<br>\n<br>\nIf you have excellent programming skills, strong problem-solving skills, and a passion for developing and improving applications utilizing cutting edge technologies, then we would like to meet you.<br>\n<br>\n<strong>What We Offer In This Role<br>\n</strong><ul><li>Competitive remuneration, with fast progression for strong performers. </li><li>A challenging but exciting, open, and fun work environment. </li><li>An opportunity to work with remarkably talented colleagues. </li><li>Vast growth potential in every aspect. </li><li>15% target bonus with further upside. </li><li>Employee share scheme participation </li><li>International relocation support </li><li>Opportunity to be embedded within a commercial team for those with strong commercial interest <br>\n<br>\n</li></ul><strong>Responsibilities<br>\n</strong><ul><li>Write software applications and programs for backend/frontend purposes. </li><li>Analyse programs and apps to improve their features and functionalities. </li><li>Test &amp; debug programs and fix any reported bugs. </li><li>Collaborate with the tech team to improve the performance, efficiency, and scalability of our tools. <br>\n<br>\n</li></ul><strong>Requirements<br>\n</strong><ul><li>BS/BE in Computer Science/Computer Engineering/Electrical &amp; Computer Eng. </li><li>Programming skills in Python language. </li><li>Knowledge of at least one popular Python framework (like Django, Flask ...) is a plus. </li><li>Programming skills in Java is a plus. </li><li>Familiarity &amp; Knowledge in front-end technologies such as HTML5, CSS, JQuery, JS, etc. </li><li>Strong knowledge of REST APIs and webservices. </li><li>Strong knowledge of Relational Databases (MySQL, PostgreSQL, SQL Server ...) and SQL language. </li><li>Knowledge of NoSQL databases is a plus. </li><li>Knowledge of AWS is a plus / Knowledge of data visualization tools, mainly Tableau, is a plus. </li><li>Ability to work in a team environment. </li><li>Strong problem-solving skills and analytical skills. </li><li>Resilience and a determination to succeed. </li><li>Independent thinkers with growth mindset. </li><li>Must be passionate, self-motivated, and able to learn quickly. </li><li>Strong sense of integrity. </li><li>Personal values that match our company values.</li></ul>\n<!---->        ",
    "link": "https://boards.greenhouse.io/cobblestoneenergy4/jobs/5241024003?gh_src=14c97b973us",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3282016136/?refId=81898214-8fac-4b2a-be4f-800eb98bcf98&trackingId=duNGTyNHT8ewsSjAv6trUw%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664005139073
  },
  {
    "company": "Cobblestone Energy",
    "jobTitle": "GRADUATE SOFTWARE ENGINEER - Dubai, UAE",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQF4PBrf9BZgVg/company-logo_100_100/0/1622142239115?e=1672272000&v=beta&t=8ghULvEavlZSHdmb1nzbBOhFSb4vUzh42PtHUmQPjIQ",
    "location": "Brisbane, Queensland, Australia",
    "jobDesc": "\n                Starting salary of <strong>55</strong><strong>,000 USD per annum</strong> in a zero-tax environment.<br>\n<br>\nFast progression for strong performers.<br>\n<br>\n<strong>Job location: </strong>Dubai, UAE<br>\n<br>\n<strong>About us:<br>\n<br>\n</strong>Cobblestone Energy is a proprietary trading firm that specializes in the wholesale electricity market across Europe. Electricity is fundamental to the world's economic activities. We trade enough electricity every day to power a small country, and in doing so, we help to address the mismatch between electricity generation and consumption.<br>\n<br>\n<strong>Job Description<br>\n<br>\n</strong>At Cobblestone Energy we are on a mission to build the most advanced European electricity trading and analytics platform, with our technology being used by our teams of commercial traders to create significant value. We are looking for enthusiastic and resourceful developers who are passionate about building exceptionally reliable and performance data processing solutions. You want to help the commercial team make data-informed decisions, have a curious mindset, and are motivated to understand our business better. Developing a strong domain knowledge of our industry over time is key to long term success in this role.<br>\n<br>\nIf you have excellent programming skills, strong problem-solving skills, and a passion for developing and improving applications utilizing cutting edge technologies, then we would like to meet you.<br>\n<br>\n<strong>What We Offer In This Role<br>\n</strong><ul><li>Competitive remuneration, with fast progression for strong performers. </li><li>A challenging but exciting, open, and fun work environment. </li><li>An opportunity to work with remarkably talented colleagues. </li><li>Vast growth potential in every aspect. </li><li>15% target bonus with further upside. </li><li>Employee share scheme participation </li><li>International relocation support </li><li>Opportunity to be embedded within a commercial team for those with strong commercial interest <br>\n<br>\n</li></ul><strong>Responsibilities<br>\n</strong><ul><li>Write software applications and programs for backend/frontend purposes. </li><li>Analyse programs and apps to improve their features and functionalities. </li><li>Test &amp; debug programs and fix any reported bugs. </li><li>Collaborate with the tech team to improve the performance, efficiency, and scalability of our tools. <br>\n<br>\n</li></ul><strong>Requirements<br>\n</strong><ul><li>BS/BE in Computer Science/Computer Engineering/Electrical &amp; Computer Eng. </li><li>Programming skills in Python language. </li><li>Knowledge of at least one popular Python framework (like Django, Flask ...) is a plus. </li><li>Programming skills in Java is a plus. </li><li>Familiarity &amp; Knowledge in front-end technologies such as HTML5, CSS, JQuery, JS, etc. </li><li>Strong knowledge of REST APIs and webservices. </li><li>Strong knowledge of Relational Databases (MySQL, PostgreSQL, SQL Server ...) and SQL language. </li><li>Knowledge of NoSQL databases is a plus. </li><li>Knowledge of AWS is a plus / Knowledge of data visualization tools, mainly Tableau, is a plus. </li><li>Ability to work in a team environment. </li><li>Strong problem-solving skills and analytical skills. </li><li>Resilience and a determination to succeed. </li><li>Independent thinkers with growth mindset. </li><li>Must be passionate, self-motivated, and able to learn quickly. </li><li>Strong sense of integrity. </li><li>Personal values that match our company values.</li></ul>\n<!---->        ",
    "link": "https://boards.greenhouse.io/cobblestoneenergy4/jobs/5241023003?gh_src=1c5b29823us",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3282014231/?refId=81898214-8fac-4b2a-be4f-800eb98bcf98&trackingId=%2BGQLyIdOTCmLFqZNaRRX7w%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664005156295
  },
  {
    "company": "Cobblestone Energy",
    "jobTitle": "GRADUATE SOFTWARE ENGINEER - Dubai, UAE",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQF4PBrf9BZgVg/company-logo_100_100/0/1622142239115?e=1672272000&v=beta&t=8ghULvEavlZSHdmb1nzbBOhFSb4vUzh42PtHUmQPjIQ",
    "location": "Gold Coast",
    "jobDesc": "\n                Starting salary of <strong>55</strong><strong>,000 USD per annum</strong> in a zero-tax environment.<br>\n<br>\nFast progression for strong performers.<br>\n<br>\n<strong>Job location: </strong>Dubai, UAE<br>\n<br>\n<strong>About us:<br>\n<br>\n</strong>Cobblestone Energy is a proprietary trading firm that specializes in the wholesale electricity market across Europe. Electricity is fundamental to the world's economic activities. We trade enough electricity every day to power a small country, and in doing so, we help to address the mismatch between electricity generation and consumption.<br>\n<br>\n<strong>Job Description<br>\n<br>\n</strong>At Cobblestone Energy we are on a mission to build the most advanced European electricity trading and analytics platform, with our technology being used by our teams of commercial traders to create significant value. We are looking for enthusiastic and resourceful developers who are passionate about building exceptionally reliable and performance data processing solutions. You want to help the commercial team make data-informed decisions, have a curious mindset, and are motivated to understand our business better. Developing a strong domain knowledge of our industry over time is key to long term success in this role.<br>\n<br>\nIf you have excellent programming skills, strong problem-solving skills, and a passion for developing and improving applications utilizing cutting edge technologies, then we would like to meet you.<br>\n<br>\n<strong>What We Offer In This Role<br>\n</strong><ul><li>Competitive remuneration, with fast progression for strong performers. </li><li>A challenging but exciting, open, and fun work environment. </li><li>An opportunity to work with remarkably talented colleagues. </li><li>Vast growth potential in every aspect. </li><li>15% target bonus with further upside. </li><li>Employee share scheme participation </li><li>International relocation support </li><li>Opportunity to be embedded within a commercial team for those with strong commercial interest <br>\n<br>\n</li></ul><strong>Responsibilities<br>\n</strong><ul><li>Write software applications and programs for backend/frontend purposes. </li><li>Analyse programs and apps to improve their features and functionalities. </li><li>Test &amp; debug programs and fix any reported bugs. </li><li>Collaborate with the tech team to improve the performance, efficiency, and scalability of our tools. <br>\n<br>\n</li></ul><strong>Requirements<br>\n</strong><ul><li>BS/BE in Computer Science/Computer Engineering/Electrical &amp; Computer Eng. </li><li>Programming skills in Python language. </li><li>Knowledge of at least one popular Python framework (like Django, Flask ...) is a plus. </li><li>Programming skills in Java is a plus. </li><li>Familiarity &amp; Knowledge in front-end technologies such as HTML5, CSS, JQuery, JS, etc. </li><li>Strong knowledge of REST APIs and webservices. </li><li>Strong knowledge of Relational Databases (MySQL, PostgreSQL, SQL Server ...) and SQL language. </li><li>Knowledge of NoSQL databases is a plus. </li><li>Knowledge of AWS is a plus / Knowledge of data visualization tools, mainly Tableau, is a plus. </li><li>Ability to work in a team environment. </li><li>Strong problem-solving skills and analytical skills. </li><li>Resilience and a determination to succeed. </li><li>Independent thinkers with growth mindset. </li><li>Must be passionate, self-motivated, and able to learn quickly. </li><li>Strong sense of integrity. </li><li>Personal values that match our company values.</li></ul>\n<!---->        ",
    "link": "https://boards.greenhouse.io/cobblestoneenergy4/jobs/5241027003?gh_src=6f69eb463us",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3282010809/?refId=81898214-8fac-4b2a-be4f-800eb98bcf98&trackingId=vwvnegL7SziNg7oWbvsTrg%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664005172857
  },
  {
    "company": "Resonate Solutions",
    "jobTitle": "Graduate Software Engineer",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4E0BAQE4-w_akmBlMA/company-logo_100_100/0/1519898554084?e=1672272000&v=beta&t=P0liFcjFdCXKNzAIHqZk00tzdJkEpohZD9glEBu4bj4",
    "location": "North Sydney, New South Wales, Australia",
    "jobDesc": "\n                Resonate is an Australian tech start up that has an enterprise Customer Experience (CX) platform (SaaS). Our Voice of Customer and Voice of Employee platform leverages the latest technology including machine learning, text analytics, and data visualizations to help close the loop faster and deliver actionable insights to leading companies. Resonate has a range of flagship customers and growing brand recognition in the space.<br>\n<br>\n<i><strong>We're looking to fill a graduate position to start as a Junior Software Developer to strengthen the team in our Sydney office.<br>\n<br>\n</strong></i>In this position, you will be augmenting Resonate's product &amp; client delivery by contributing to an agile and creative engineering culture and balancing high-quality outputs at pace with taking a solid place in a high-performing team.<br>\n<br>\n<strong>To be successful, the candidate will have the following key competencies:<br>\n</strong><ul><li>Strong software engineering fundamentals</li><li>Be excited about work on both front- and back-end</li><li>Understanding of Database Systems</li><li>Proficiency in HTML/CSS, and modern (SPA) JS frameworks (Vue, React, etc...)</li><li>High regard for code and quality, you value peer-reviews and enjoy collaboration<br>\n<br>\n</li></ul><strong>Here is what you can expect when working with us:<br>\n</strong><ul><li>Support and guidance to grow within your role and beyond</li><li>Work with highly skilled peers with knowledge sharing as an ethos</li><li>A growing and fun culture that you will be a vital part of and help drive</li><li>Stay cutting edge &amp; help others with the same<br>\n<br>\n</li></ul><strong>Nice to haves include:<br>\n</strong><ul><li>Experience in Cloud development AWS/Azure</li><li>Experience with CI/CD</li><li>Github projects</li><li>Table tennis skills <br>\n<br>\n</li></ul><strong>Qualifications: <br>\n</strong><ul><li>Degree in engineering or IT<br>\n<br>\n</li></ul>Not yet convinced to apply? Resonate offers competitive pay, awesome co-workers and we enjoy fun activities like table tennis, foosball and more.<br>\n<br>\nPlease be sure to include a cover letter explaining why you would be the right candidate for this position.<br>\n<br>\nThis is your chance to join a company that's about to start the next chapter in growth. If you are that person who is a creative thinker, loves to solve problems and deliver quality through excellence, then contact us!<br>\n<br>\n<strong>Housekeeping:<br>\n</strong><ul><li>This is an on-premise job in our North Sydney office</li><li>Applicants need to be eligible to work in a permanent position in Australia</li><li>We are a COVID Safe company with flexible working arrangements around COVID, which includes at least partial attendance in office. <br>\n<br>\n</li></ul><strong>Apply Now!!</strong>\n<!---->        ",
    "link": "https://www.linkedin.com/jobs/view/3281506155/?refId=81898214-8fac-4b2a-be4f-800eb98bcf98&trackingId=Eephs9YWT9uF62nepvFj1Q%3D%3D&trk=flagship3_job_home_savedjobs",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3281506155/?refId=81898214-8fac-4b2a-be4f-800eb98bcf98&trackingId=Eephs9YWT9uF62nepvFj1Q%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664005184492
  },
  {
    "company": "Rokt",
    "jobTitle": "Graduate Software Engineer - 2023",
    "type": "grad",
    "logo": "https://media-exp1.licdn.com/dms/image/C4E0BAQEahSvjEmeYyg/company-logo_100_100/0/1657814908432?e=1672272000&v=beta&t=DnZFfEZwbNAsSXw4ABayB8Ko5qij3e0biCouxic6GV8",
    "location": "Sydney, New South Wales, Australia",
    "jobDesc": "\n                <strong>Who We Are <br>\n<br>\n</strong><strong>Description<br>\n<br>\n</strong>Rokt is the global leader in ecommerce technology, helping companies seize the full potential of every transaction moment to grow revenue and acquire new customers at scale. Live Nation, Groupon, Staples, Lands' End, Fanatics, UrbanStems, GoDaddy, Vistaprint and HelloFresh are among the more than 2,500 leading global businesses and advertisers that are using Rokt's solutions to drive more value through every transaction by offering highly relevant messages to their customers at the moment they are most likely to convert.<br>\n<br>\nWith our December 2021 Series E raise of USD$325M, Rokt is expanding rapidly and globally – operating in 19 countries across North America, Europe and the Asia-Pacific region with the largest office in NYC and a major R&amp;D hub in Sydney. With annual revenues of more than US$200M and vibrant company culture, Rokt has been listed in ‘Great Places to Work’ in the US and Australia. Our award-winning culture is guided by our five core values: Smart with Humility, Own the Outcomes, Force for Good, Conquer New Frontiers, and Enjoy the Ride. These values help us attract, engage, and develop the right talent around the globe and ensure we have the right conditions to do our best work. Keen to join a fast-growing company and a vibrant culture? Learn more at rokt.com.<br>\n<br>\nThe Rokt engineering team builds best-in-class ecommerce technology that provides personalized and relevant experiences for customers globally and empowers marketers with sophisticated, AI-driven tooling to better understand consumers. Our bespoke platform handles millions of transactions per day and considers billions of data points which give engineers the opportunity to build technology at scale, collaborate across teams and gain exposure to a wide range of technology. We are expanding rapidly in our major R&amp;D centers in NYC and Sydney. We are passionate about using intelligent systems to improve the transaction moment for retailers everywhere. Come join us and build the future!<br>\n<br>\nThe Role<br>\n<br>\nWe’re looking for enthusiastic Graduate Software Engineers to join our engineering team at Rokt. You’ve studied hard, completed labs, had some experience and now you’re ready to start coding and ship. With Rokt we’ll give you the tools, support and environment to get straight into coding. You will join a team of experienced engineers who are passionate about writing world class code.<br>\n<br>\nIn your first week you’ll have completed your first task. In your first month, you will have completed a number of fixes and features (at least one of which will be in production), started peer-reviewing your colleagues’ code and you'll be participating in team task estimations and have a growing understanding of your team's systems. By the end of your first year, you will have led design workshops, started to master a handful of technologies and taken primary responsibility for a small system (or a component in a larger system).<br>\n<br>\nWhile you start with one engineering team, your opportunities will be throughout the engineering structure and you'll work with other teams to get exposure to the whole business.<br>\n<br>\nEngineers at Rokt are not afraid of a challenge; we thrive on using our creativity and delivering suitable solutions. Find where your true passion lies!<br>\n<br>\n<strong>The Tech Stack<br>\n<br>\n</strong>The platform employs a globally distributed micro-services and event-driven data pipeline architecture to process the millions of daily consumer interactions that occur on the Rokt network.<br>\n<br>\nThere are currently more than 20 scrum teams working on a huge variety of challenges at Rokt. We believe in using the right tool for the job. We pick technologies not because they’re shiny and new, but because they solve a problem. Our mantra is: you build it, you own it. We strive to give teams autonomy; each team owns its technology choices, tooling, test automation, deployment pipelines, and monitoring and alerting.<br>\n<br>\nOur teams craft their work using languages such as Python, C#, Clojure, Scala, Kotlin and Swift. Our frontend engineering is built on React and Angular frameworks powered by Javascript and Typescript. Our infrastructure is hosted on AWS, and we leverage technologies like SQS, Kinesis, and Redshift. More and more, we’re turning to open source technologies such as Postgresql, Kafka, EMR and Spark to achieve our goals.<br>\n<br>\n<strong> Requirements <br>\n</strong><ul><li>Bachelor's degree in Computer Science or equivalent discipline</li><li>Demonstrable knowledge of data structures and basic algorithms</li><li>Applications must include a tailored cover letter, resume, and academic transcripts. You should also include links to any personal projects / GitHub repositories in your resume.</li><li>Late 2022 (November/December) or early 2023 start (February, March). Please indicate your preference in the cover letter.<br>\n</li></ul><strong> Benefits <br>\n</strong><ul><li> Work with the greatest talent in town. Our recruiting process is tough. We hold a high bar because we have a high-performing, high-velocity culture - we only want the brightest and the best.</li><li> Join a community. We believe the best things happen when we come together to solve complex problems and make meaningful connections with each other through interest groups, sports clubs, and social events.</li><li> Accelerate your career. Develop through our global training events, ‘Level Up’ investment, online training courses, and our fantastic people leaders. Take your career to Rokt’speed - Grow your career in our rapidly growing company.</li><li> Take a break. When you work hard, we know you also need to rest. We offer generous time off and parental leave policies, as well as mental health and wellness days for all employees. We also believe taking time off in sync with one another is important. As such, we shut down our offices every year in late December/early January for two weeks, partially sponsored by the company. We also offer a paid Rokt’star Sabbatical for employees who have been with us for 3 years or more.</li><li> Stay happy and healthy. Enjoy catered lunch 3 times a week and healthy snacks in the office. Plus join the gym on us! Rokt offers a monthly allowance to use on a gym membership or online fitness classes. We also provide all Rokt'stars access to free 1:1 coaching, therapy and digital mental wellness resources.</li><li> Become a shareholder. All Rokt’stars have stock options. If we succeed, everyone enjoys the upside.</li><li> See the world! Along with our global all-staff events in amazing locations (Phuket, Thailand in January 2020, Hawaii in May 2022), we also offer generous relocation packages for those interested in moving to another Rokt office. We have cool offices in great cities - New York, Sydney, London, Singapore, and Tokyo.</li><li> Get the best of both worlds with a hybrid workplace. We firmly believe that we are better together - in-person interaction is an important part of our culture and supports our rapid growth through better apprenticeship and career development. We currently work 3 days a week in the office, allowing you to enjoy the best of both worlds (please note: this is subject to change based on the needs of the business and some support roles still require a full-time presence). One week per quarter, you also have the flexibility to work from anywhere.</li><li> We believe in equality. Rokt is an Equal Opportunity Employer and recognises that a diverse workforce is crucial to our success as a business. We would love you to apply for one of our open roles - irrespective of socio-economic status or background, age, gender identity, race, religion, sexual orientation, colour, pregnancy, carer/family responsibilities, national and social origin, political opinion, marital, veteran, or disability status.<br>\n</li></ul>We require all Rokt’stars as well as anyone else who will be onsite at the Rokt Sydney office to show proof of vaccination and booster shot.<br>\n<br>\nSalary - $120,000 OTE AUD per year, not including equity<br>\n<br>\n\n<!---->        ",
    "link": "https://www.linkedin.com/jobs/view/3137852912/?refId=81898214-8fac-4b2a-be4f-800eb98bcf98&trackingId=qporzC0IQyCAe6Mw6%2FkRFw%3D%3D&trk=flagship3_job_home_savedjobs",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3137852912/?refId=81898214-8fac-4b2a-be4f-800eb98bcf98&trackingId=qporzC0IQyCAe6Mw6%2FkRFw%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664005196147
  },
  {
    "company": "Nexus Silicon Technologies",
    "jobTitle": "Data Scientist Intern",
    "type": "intern",
    "logo": "https://media-exp1.licdn.com/dms/image/C560BAQHuMu6ApjfyGg/company-logo_100_100/0/1641804394967?e=1672272000&v=beta&t=nv6ClDQ6WLnv3jR9jc7_Mg20jw4L0PRt67v_GahYyKc",
    "location": "Canberra, Australian Capital Territory, Australia",
    "jobDesc": "\n                <strong>Job Title: Data Scientist Intern<br>\n<br>\n</strong>Location: Canberra, ACT, Australia<br>\n<br>\nWe are looking to hire a highly creative data scientist intern to address data analytics challenges in our organization, to collect large volumes of data from varying sources, clean and interpret data, create solutions to overcome challenges, and communicate with interested parties.<br>\n<br>\n<strong><u>Data Scientist Intern Responsibilities<br>\n</u></strong><ul><li>Having meetings with team members regarding projects.</li><li>Collecting and interpreting data.</li><li>Automating and integrating processes.</li><li>Researching solutions to overcome data analytics challenges.</li><li>Developing complex mathematical models that integrate business rules and requirements.</li><li>Creating machine learning models.</li><li>Communicating and meeting with engineers, IT teams, and other interested parties.</li><li>Sharing complex ideas verbally and visually in an understandable manner with non-technical stakeholders.<br>\n</li></ul><strong><u>Data Scientist Intern Requirements<br>\n</u></strong><ul><li>Bachelors degree in applied mathematics or statistics.</li><li>Advanced coursework in machine learning and programming.</li><li>Knowledge of data visualization tools.</li><li>Knowledge of data querying languages, and statistical or mathematical software.</li><li>Proficient in writing algorithms, and knowing when to apply them.</li><li>Excellent understanding of statistics, multivariable calculus, and linear algebra.</li><li>Outstanding communication skills.<br>\n</li></ul><strong><u>About Us<br>\n<br>\n</u></strong>Nexus Silicon was formed with the goal of becoming the supplier of choice for clients, employees, and contingent workers. Today, we’re one of the fastest-growing companies in Australia and ranked as one of the best companies to work for by Staffing Industry Analysts and Australia Business. Nexus Silicon provides high-volume staffing, IT managed Services, IT Consulting, Software &amp; Mobile App development, Accounting Outsourcing, IT support, Cloud Infrastructure support &amp; Outsourcing, SOW, and pay rolling services to structured contingent workforce programs and projects across Australia, Nepal &amp; India. We also offer contract-to-hire and direct placement. Our “No-Sell, Service-Only” approach has resulted in “Accelerated Hires,” lower costs, reduced risks, and better service for Fortune 2000 Companies, Large System Integrators, and Government Agencies.<br>\n<br>\nPowered by JazzHR\n<!---->        ",
    "link": "https://au.talent.com/view?id=3f8c62a5e817&source=linkedin-premium&utm_medium=linkedin-premium",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3283947910/?refId=81898214-8fac-4b2a-be4f-800eb98bcf98&trackingId=i4AUyT8ES5%2B%2Fmtrpccb5Dg%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664005212188
  },
  {
    "company": "Tesla",
    "jobTitle": "Applications Engineering Intern",
    "type": "intern",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQHUcu98SZ2TVw/company-logo_100_100/0/1607665771371?e=1672272000&v=beta&t=vupndQeq33qgiy77FQcnNY6FZ6GP0Fod6_3B16_NUho",
    "location": "Melbourne, Victoria, Australia",
    "jobDesc": "\n                <strong><u>What To Expect<br>\n<br>\n</u></strong>The Tesla Energy Projects team is responsible for the successful deployment and management of Tesla’s cutting-edge Energy Systems; Powerwall, Powerpack and Megapack. Working with internal engineering teams and external partners, the Applications Engineering team ensures successful deployment of these products into new applications, from initial validation through productization, and assist with product issues during operations.<br>\n<br>\n<strong><u>What You’ll Do<br>\n</u></strong><ul><li>Support developing software for autonomous Utility Power Plant controllers (Industrial)</li><li>Build Human Machine Interfaces (HMI) for Industrial BESS plants.</li><li>Define, review and refine device interfaces using industrial protocols such as Modbus and DNP3.</li><li>Develop internal software tools and dashboards for the Service Engineering and Field Service Team.</li><li>Collate fleet data and create analytical tables or dashboards for tracking and reporting.</li><li>Determine root cause of product field failures by working with field team and engineering, software/firmware teams and drive improvements through design, software/firmware or manufacturing changes.</li><li>Troubleshoot malfunctioning equipment to identify the cause of the outage and work to restore operation as quickly as possible.</li><li>Provide support on escalated customer cases in order to minimize system downtime.</li></ul> <strong>What You’ll Bring<br>\n</strong><ul><li>Currently working towards a degree in a relevant program such as Mechatronics, Electrical Engineering, Mechanical Engineering, Software Engineering, Engineering Physics </li><li>A passion for sustainable energy </li><li>A bias for action </li><li>High proficiency in at least 1 programming language (Ideally Python or Golang) </li><li>Remain engaged, proactive, and positive while solving very challenging problems </li><li>Understanding of electromechanical system fundamentals and associated dynamics </li><li>Proficiency in making basic electrical measurements with a multi-meter </li><li>Ability to troubleshoot connectivity issues in TCP/IP networks </li><li>Ability to run lab tests, interpret data and draw conclusions about system performance</li><li>This role is full time and for a 6 month contract<br>\n</li></ul><strong>Desired Competencies<br>\n</strong><ul><li>Ability to diagnose issues with electrical systems</li><li>Experience with designing and installing electrical wiring in a lab environment</li><li>Familiarity with Linux servers &amp; bash/shell scripting</li><li>Experience using Python or equivalent for data analysis on very large databases </li></ul>\n<!---->        ",
    "link": "https://www.tesla.com/careers/search/job/applications-engineering-intern-141814?source=LinkedIn",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3281643376/?refId=81898214-8fac-4b2a-be4f-800eb98bcf98&trackingId=iNVDRoIYRkCqys6HnIu75A%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664005227650
  },
  {
    "company": "PEXA",
    "jobTitle": "Junior Software Engineer - (3rd Year University Student) - Part Time",
    "type": "intern",
    "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQG0rr5cZLl06Q/company-logo_100_100/0/1656651013359?e=1672272000&v=beta&t=dWokMtI04OjgmI2jB_uon4rXrLWs6XGaOMuYKkGSL-M",
    "location": "Melbourne, Victoria, Australia",
    "jobDesc": "\n                <strong>Hi, we’re PEXA!</strong><p><br>\n</p>We know you’ll Google us before applying, so let’s keep this brief. PEXA revolutionised the way that property is settled in Australia, turning a paper-based process into a digital one. Our solution is a world-first, with over 500 people across Australia and an expanding international team, we’re helping 20,000+ families into their homes each week.<p><br>\n</p>We’re passionate about solving problems for our customers – always striving to set the standard for how property is bought and sold. Being awarded as one of the best places to work in Australia is a recognition of our culture and commitment to innovation, customers and our community.<p><br>\n</p>We’re growing fast, that is where you come in.<p><br>\n</p><strong>Why become a PEXArian?</strong><p><br>\n</p>Great question! Being a PEXArian is so much more than just a job. We’re a passionate, motivated and unash amedly enthusiastic bunch at PEXA – we love what we do and we’re proud to admit it! Creating brilliant experiences for our members and their clients wouldn’t be possible without ensuring we deliver an exceptional employee experience.<p><br>\n</p><strong>Here’s a snapshot of what your life at PEXA could look like:</strong><p><br>\n</p><strong>Your growth:</strong><p><br>\n</p>We encourage you to hit your personal and professional learning and development goals with our tailored programs and tools.<p><br>\n</p><strong>Your wellness:</strong><p><br>\n</p>We care about your holistic wellbeing – take advantage of our ergonomic environment, a fully stocked kitchen, four wellness days, a $250 wellness subsidy as well as lunch and learn sessions to support your financial wellbeing.<p><br>\n</p><strong>Your work/life blend:</strong><p><br>\n</p>We know that work is just one aspect of your life – we want to help you create your ideal work/life blend, rather than squeezing in life around work.<p><br>\n</p><strong>Your family:</strong><p><br>\n</p>With a range of benefits aimed at supporting your family including access to a subsidised school holiday program, when we say, ‘welcome to the family’, we really mean it!<p><br>\n</p><strong>A day in the life:</strong><p><br>\n</p>This exciting role is part of a completely new team within the organisation. You will be part of a global team that is challenging the status quo of property settlement experience in many countries.<p><br>\n</p>Ideally you are studying or completed a Bachelor’s degree in Computer Science or similar. You have learned to code on your own and have personal projects to showcase.<p><br>\n</p>As a Junior Developer you will work closely with your team of engineers, pairing across time zones writing and reviewing code.<p><br>\n</p>At PEXA, we are extremely proud of our work culture and the highly motivated and skilled team we have built. In joining our team, you will have the opportunity to work on a range of initiatives and deliver the “wow” moments as the company continues to grow and expand.<p><br>\n</p><strong>Key Accountabilities:</strong><p><br>\n</p><ul><li>Design, develop and test quality applications using a variety of languages, frameworks, and tools</li><li>Work collaboratively and contribute to every stage of the software development lifecycle including technical design, pair programming, peer code review, documenting, testing and CI/CD</li><li>Support and maintain applications in a build-and-run fashion, including automated tests, bug fixes and general maintenance</li><li>Actively participate in agile ceremonies based on SCRUM or Kanban</li><li>Review tasks critically and ensures they are appropriately sized for continuous integration and incremental delivery</li><li>Security aware – approach all engineering work with a security lens. Actively look for security vulnerabilities both in the code and when providing peer reviews</li><li>Deliver praise and constructive feedback to your team, teammates and manager in a useful manner. Deliver feedback to business stakeholders when opportunities arise</li><li>Mentor team members in an open and respectful manner. Seek out mentoring opportunities specifically to create team redundancy and backfill ability</li><li>Help team members overcome obstacles, resolve blockers and complete work tasks</li><li>Participate in On-call rotation and support activities </li><li>Comply with corporate and compliance policies</li></ul><p><br>\n</p><strong>Skills and Experience:</strong><p><br>\n</p><ul><li>Provide Year 12 ATAR transcript and/or University transcript</li><li>Share portfolio of coding projects (GitHub, GitLabs, etc)</li><li>Experience in Java, Kotlin, JavaScript, TypeScript and ReactJS are considered highly advantageous.</li><li>Understanding of Object-Oriented Design, SOLID, KISS, DRY principles</li><li>Familiar with common data structures and algorithms.</li><li>Ability to communicate effectively in written and verbal form both technical and non-technical concepts to engineers of different levels as well as non-technical partners.</li></ul><p><br>\n</p><strong>We also would value any experience with the following:</strong><p><br>\n</p><ul><li>Experience in frontend development using Typescript / React</li><li>Experience in integrations with third party APIs</li><li>Experience designing and building well-defined RESTful APIs for internal and external consumption</li><li>Experience building observable systems, operating them at scale and being on-call</li><li>Experience in user identity management and SSO</li><li>Exposure to distributed storage and database systems (e.g. SQL, NoSQL)</li><li>Exposure to event driven systems such as Kafka</li><li>Knowledge of cloud technology such as AWS, Docker or Kubernetes</li></ul><p><br>\n</p><strong>Key Attributes:</strong><p><br>\n</p><ul><li>An effective communicator with good written and verbal skills to describe both technical and non-technical subjects</li><li>Able to build relationships with your teammates, manager, and product counterparts, as well as relevant business stakeholders</li><li>Open to share opinions and actively contribute to discussions in a respectful manner and encourage others to do the same</li><li>Open to share knowledge with team members and encourage others to do the same</li><li>Be customer centric, actively seek out customer driven data to help prove or disprove features hypothesis, liaise with customers to design, and improve our products</li><li>Good creative problem-solving skills and can-do approach to work</li></ul><p><br>\n</p><strong>Sounds like you?</strong><p><br>\n</p>We at PEXA are ready so if this role sounds like you apply today.<p></p>\n<!---->        ",
    "link": "https://jobs.lever.co/pexa/729f49db-9b4e-4464-88be-e7cadf46365a?lever-source=LinkedInJobs",
    "linkedinLink": "https://www.linkedin.com/jobs/view/3270535137/?refId=81898214-8fac-4b2a-be4f-800eb98bcf98&trackingId=xFV%2Be1kjRpG%2F1mFompsaxw%3D%3D&trk=flagship3_job_home_savedjobs",
    "posted": 1664005244676
  }
]
